/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"assets/commands.json.add_compile_definitions": "Hiermit werden der Kompilierung von Quelldateien Präprozessordefinitionen hinzugefügt.",
	"assets/commands.json.add_compile_options": "Hiermit werden der Kompilierung von Quelldateien Optionen hinzugefügt.",
	"assets/commands.json.add_custom_command": "Fügen Sie dem generierten Buildsystem eine benutzerdefinierte Buildregel hinzu.",
	"assets/commands.json.add_custom_target": "Fügen Sie ein Ziel ohne Ausgabe hinzu, damit der Build immer erstellt wird.",
	"assets/commands.json.add_definitions": "Hiermit werden der Kompilierung von Quelldateien -D-Definitionsflags hinzugefügt.",
	"assets/commands.json.add_dependencies": "Fügen Sie zwischen Zielen der obersten Ebene eine Abhängigkeit hinzu.",
	"assets/commands.json.add_executable": "Fügen Sie dem Projekt mithilfe der angegebenen Quelldateien eine ausführbare Datei hinzu.",
	"assets/commands.json.add_library": "Fügen Sie dem Projekt mithilfe der angegebenen Quelldateien eine Bibliothek hinzu.",
	"assets/commands.json.add_link_options": "Hiermit werden dem Schritt zur Verknüpfung von Zielen (ausführbare Dateien, freigegebene Bibliotheken oder Modulbibliotheken) im aktuellen Verzeichnis und darunter Optionen hinzugefügt. Das Hinzufügen erfolgt nach dem Aufrufen dieses Befehls.",
	"assets/commands.json.add_subdirectory": "Fügen Sie dem Build ein Unterverzeichnis hinzu.",
	"assets/commands.json.add_test": "Fügen Sie dem Projekt einen Test hinzu, der von \"ctest\" aufgeführt wird.",
	"assets/commands.json.aux_source_directory": "Finden Sie alle Quelldateien in einem Verzeichnis.",
	"assets/commands.json.block": "Werten Sie eine Gruppe von Befehlen mit einer dedizierten Variablen und/oder einem Richtlinienbereich aus.",
	"assets/commands.json.break": "Brechen Sie eine einschließende foreeach- oder while-Schleife ab.",
	"assets/commands.json.build_command": "Erstellen Sie das aktuelle Projekt mittels Befehlszeile. Dies ist hauptsächlich für die interne Verwendung durch das CTest-Modul vorgesehen.",
	"assets/commands.json.build_name": "Seit Version 3.0 unzulässig. Siehe CMake-Richtlinie CMP0036.",
	"assets/commands.json.cmake_file_api": "Ermöglicht die Interaktion mit der CMake-Datei-API <cmake-file-api(7)>.",
	"assets/commands.json.cmake_host_system_information": "Fragen Sie verschiedene Hostsysteminformationen ab.",
	"assets/commands.json.cmake_language": "Hiermit werden Metavorgänge für CMake-Befehle aufgerufen.",
	"assets/commands.json.cmake_minimum_required": "Hiermit wird eine Mindestversion von CMake als erforderlich festgelegt.",
	"assets/commands.json.cmake_parse_arguments": "Hiermit werden Funktions- oder Makroargumente analysiert.",
	"assets/commands.json.cmake_path": "Dieser Befehl dient zum Bearbeiten von Pfaden. Nur syntaktische Aspekte von Pfaden werden behandelt, es findet keine Interaktion jeglicher Art mit einem zugrunde liegenden Dateisystem statt. Der dargestellte Pfad ist möglicherweise nicht vorhanden oder auf dem aktuellen Dateisystem oder der aktuellen Plattform sogar unzulässig. Vorgänge, die mit dem Dateisystem interagieren, finden Sie im Befehl \"file\".",
	"assets/commands.json.cmake_policy": "Verwalten Sie CMake-Richtlinieneinstellungen. Siehe das Handbuch zu den cmake-Richtlinien, um Informationen zu definierten Richtlinien zu erhalten.",
	"assets/commands.json.configure_file": "Kopieren Sie eine Datei an einen anderen Speicherort, und modifizieren Sie deren Inhalte.",
	"assets/commands.json.continue": "Fahren Sie mit dem Anfang der einschließenden foreach- oder while-Schleife fort.",
	"assets/commands.json.create_test_sourcelist": "Erstellen Sie ein Testtreiberprogramm, das viele kleine Tests zu einer einzigen ausführbaren Datei verknüpft. Dies ist beim Erstellen statischer ausführbarer Dateien mit großen Bibliotheken hilfreich, um die erforderliche Gesamtgröße zu verkleinern.",
	"assets/commands.json.ctest_build": "Führen Sie den CTest-Buildschritt als Dashboardclient aus.",
	"assets/commands.json.ctest_configure": "Führen Sie den CTest-Configure-Schritt als Dashboardclient aus.",
	"assets/commands.json.ctest_coverage": "Führen Sie den CTest-Coverage-Schritt als Dashboardclient aus.",
	"assets/commands.json.ctest_empty_binary_directory": "leert das Binärverzeichnis",
	"assets/commands.json.ctest_memcheck": "Führen Sie den CTest-MemCheck-Schritt als Dashboardclient aus.",
	"assets/commands.json.ctest_read_custom_files": "CTestCustom-Dateien lesen.",
	"assets/commands.json.ctest_run_script": "Führt ein ctest -S-Skript aus.",
	"assets/commands.json.ctest_sleep": "Wird für eine bestimmte Zeit deaktiviert.",
	"assets/commands.json.ctest_start": "Startet den Testvorgang für ein gegebenes Modell",
	"assets/commands.json.ctest_submit": "Führen Sie den CTest-Submit-Schritt als Dashboardclient aus.",
	"assets/commands.json.ctest_test": "Führen Sie den CTest-Test-Schritt als Dashboardclient aus.",
	"assets/commands.json.ctest_update": "Führen Sie den CTest-Update-Schritt als Dashboardclient aus.",
	"assets/commands.json.ctest_upload": "Laden Sie als Dasboardclient Dateien auf einen Dashboardserver hoch.",
	"assets/commands.json.define_property": "Definieren und dokumentieren Sie benutzerdefinierte Eigenschaften.",
	"assets/commands.json.else": "Startet den else-Teil eines if-Blocks.",
	"assets/commands.json.elseif": "Hiermit wird ein elseif-Abschnitt eines if-Blocks gestartet.",
	"assets/commands.json.enable_language": "Sprachen aktivieren (CXX/C/OBJC/OBJCXX/Fortran usw.)",
	"assets/commands.json.enable_testing": "Ermöglicht das Testen des aktuellen Verzeichnisses und darunter angeordneter Elemente.",
	"assets/commands.json.endblock": "Beendet eine Liste von Befehlen in einem Block und entfernt die durch den Blockbefehl erstellten Bereiche.",
	"assets/commands.json.endforeach": "Beendet eine Liste von Befehlen in einem foreeach-Block.",
	"assets/commands.json.endfunction": "Beendet eine Liste von Befehlen in einem function-Block.",
	"assets/commands.json.endif": "Beendet eine Liste von Befehlen in einem if-Block.",
	"assets/commands.json.endmacro": "Beendet eine Liste von Befehlen in einem macro-Block.",
	"assets/commands.json.endwhile": "Beendet eine Liste von Befehlen in einem while-Block.",
	"assets/commands.json.execute_process": "Führen Sie mindestens einen untergeordneten Prozess aus.",
	"assets/commands.json.exec_program": "Hiermit wird während der Verarbeitung der Datei \"CMakeList.txt\" ein ausführbares Programm ausgeführt.",
	"assets/commands.json.export": "Exportieren Sie Ziele oder Pakete für externe Projekte, um sie ohne Installation direkt aus dem Build-Baum des aktuellen Projekts zu verwenden.",
	"assets/commands.json.export_library_dependencies": "Seit Version 3.0 unzulässig. Siehe CMake-Richtlinie CMP0033.",
	"assets/commands.json.file": "Befehl zur Dateimanipulation.",
	"assets/commands.json.find_file": "Mit diesem Befehl wird ein vollständiger Pfad zu einer benannten Datei gefunden.",
	"assets/commands.json.find_library": "Dieser Befehl wird zum Finden einer Bibliothek verwendet.",
	"assets/commands.json.find_package": "Suchen Sie nach einem Paket (das normalerweise von außerhalb des Projekts bereitgestellt wird), und laden Sie dessen paketspezifischen Details. Aufrufe dieses Befehls können auch von Abhängigkeitsanbietern abgefangen werden.",
	"assets/commands.json.find_path": "Mit diesem Befehl suchen Sie ein Verzeichnis, das die benannte Datei enthält.",
	"assets/commands.json.find_program": "Dieser Befehl wird verwendet, um ein Programm zu suchen.",
	"assets/commands.json.fltk_wrap_ui": "Erstellen Sie Wrapper für FLTK-Benutzeroberflächen.",
	"assets/commands.json.foreach": "Werten Sie für alle Werte in der Liste eine Gruppe von Befehlen aus.",
	"assets/commands.json.function": "Hiermit wird die Aufzeichnung einer Funktion zum späteren Aufruf als Befehl gestartet.",
	"assets/commands.json.get_cmake_property": "Rufen Sie eine globale Eigenschaft der CMake-Instanz ab.",
	"assets/commands.json.get_directory_property": "Rufen Sie eine Eigenschaft des Bereichs DIRECTORY auf.",
	"assets/commands.json.get_filename_component": "Rufen Sie eine spezifische Komponente eines vollständigen Dateinamens ab.",
	"assets/commands.json.get_property": "Eigenschaft abrufen.",
	"assets/commands.json.get_source_file_property": "Rufen Sie eine Eigenschaft einer Quelldatei ab.",
	"assets/commands.json.get_target_property": "Rufen Sie eine Eigenschaft von einem Ziel ab.",
	"assets/commands.json.get_test_property": "Rufen Sie eine Eigenschaft des Tests ab.",
	"assets/commands.json.if": "Führen Sie bedingt eine Gruppe von Befehlen aus.",
	"assets/commands.json.include": "Laden Sie CMake-Code von einer Datei oder einem Modul.",
	"assets/commands.json.include_directories": "Fügen Sie dem Build Includeverzeichnisse hinzu.",
	"assets/commands.json.include_external_msproject": "Schließen Sie eine externe Microsoft-Projektdatei in einen Arbeitsbereich ein.",
	"assets/commands.json.include_guard": "Stellt einen Include-Wächter für die Datei bereit, die gerade von CMake verarbeitet wird.",
	"assets/commands.json.include_regular_expression": "Legen Sie den regulären Ausdruck fest, der für die Abhängigkeitsüberprüfung verwendet wird.",
	"assets/commands.json.install": "Geben Sie Regeln an, die zum Zeitpunkt der Installation ausgeführt werden.",
	"assets/commands.json.install_files": "Dieser Befehl wurde durch den Install-Befehl ersetzt. Er wird aus Gründen der Kompatibilität mit älterem CMake-Code bereitgestellt. Das FILES-Format wird direkt durch das FILES-Format des Install-Befehls ersetzt. Das regexp-Format kann mithilfe des GLOB-Formats des File-Befehls klarer ausgedrückt werden.",
	"assets/commands.json.install_programs": "Dieser Befehl wurde durch den Install-Befehl ersetzt. Er wird aus Gründen der Kompatibilität mit älterem CMake-Code bereitgestellt. Das FILES-Format wird direkt durch das PROGRAMS-Format des Install-Befehls ersetzt. Das regexp-Format kann mithilfe des GLOB-Formats des File-Befehls klarer ausgedrückt werden.",
	"assets/commands.json.install_targets": "Dieser Befehl wurde durch den Install-Befehl ersetzt. Er wird aus Gründen der Kompatibilität mit älterem CMake-Code bereitgestellt.",
	"assets/commands.json.link_directories": "Fügen Sie Verzeichnisse hinzu, in denen der Linker nach Bibliotheken sucht.",
	"assets/commands.json.link_libraries": "Verknüpfen Sie Bibliotheken mit allen später hinzugefügten Zielen.",
	"assets/commands.json.list": "Vorgänge für durch Semikolons getrennte Listen.",
	"assets/commands.json.load_cache": "Laden Sie die Werte des CMake-Cache eines anderen Projekts.",
	"assets/commands.json.load_command": "Seit Version 3.0 unzulässig. Siehe CMake-Richtlinie CMP0031.",
	"assets/commands.json.macro": "Hiermit wird die Aufzeichnung eines Makros zum späteren Aufruf als Befehl gestartet.",
	"assets/commands.json.make_directory": "Erstellt das angegebene Verzeichnis. Es müssen vollständige Pfade angegeben werden. Alle übergeordneten Verzeichnisse, die nicht vorhanden sind, werden ebenfalls erstellt. Verwenden Sie diesen Befehl mit Bedacht.",
	"assets/commands.json.mark_as_advanced": "Markieren Sie von CMake zwischengespeicherte Variablen als \"erweitert\".",
	"assets/commands.json.math": "Hiermit wird ein mathematischer Ausdruck ausgewertet.",
	"assets/commands.json.message": "Meldung protokollieren.",
	"assets/commands.json.option": "Hiermit wird eine boolesche Option bereitgestellt, die der Benutzer optional auswählen kann.",
	"assets/commands.json.output_required_files": "Seit Version 3.0 unzulässig. Siehe CMake-Richtlinie CMP0032.",
	"assets/commands.json.project": "Hiermit wird der Name des Projekts festgelegt.",
	"assets/commands.json.qt_wrap_cpp": "Hiermit werden Qt-Wrapper manuell erstellt.",
	"assets/commands.json.qt_wrap_ui": "Hiermit werden Wrapper für Qt-Benutzerschnittstellen manuell erstellt.",
	"assets/commands.json.remove": "Hiermit wird VALUE aus der Variablen VAR entfernt. Dieser Befehl wird üblicherweise zum Entfernen von Einträgen aus einem Vektor verwendet (z. B. eine durch Semikolon getrennte Liste). VALUE wird erweitert.",
	"assets/commands.json.remove_definitions": "Hiermit werden -D-Definitionsflags entfernt, die per \"add_definitions\" hinzugefügt wurden.",
	"assets/commands.json.return": "Rückgabewert einer Datei, eines Verzeichnisses oder einer Funktion.",
	"assets/commands.json.separate_arguments": "Hiermit werden Befehslzeilenargumente in eine durch Semikolon getrennte Liste umgewandelt.",
	"assets/commands.json.set": "Legen Sie für einen gegebenen Wert eine Normal-, Cache- oder Umgebungsvariable fest. Die Dokumentation zu den cmake-language(7)-Variablen enthält Informationen über die Bereiche und die Interaktion normaler Variablen und über Cacheeinträge.",
	"assets/commands.json.set_directory_properties": "Hiermit werden die Eigenschaften des aktuellen Verzeichnisses und der Unterverzeichnisse festgelegt.",
	"assets/commands.json.set_property": "Legen Sie in einem gegebenen Bereich eine benannte Eigenschaft fest.",
	"assets/commands.json.set_source_files_properties": "Quelldateien können Eigenschaften aufweisen, die ihre Erstellung beeinflussen.",
	"assets/commands.json.set_target_properties": "Ziele können Eigenschaften aufweisen, die ihre Erstellung beeinflussen.",
	"assets/commands.json.set_tests_properties": "Legen Sie eine Eigenschaft der Tests fest.",
	"assets/commands.json.site_name": "Legen Sie die gegebene Variable auf den Namen des Computers fest.",
	"assets/commands.json.source_group": "Definieren Sie beim Generieren eines IDE-Projekts eine Gruppierung für Quelldateien. Zum Erstellen von Quellgruppen stehen zwei unterschiedliche Signaturen zur Verfügung.",
	"assets/commands.json.string": "Zeichenfolgenvorgänge.",
	"assets/commands.json.subdirs": "Hiermit wird dem Build eine Liste mit Unterverzeichnissen hinzugefügt.",
	"assets/commands.json.subdir_depends": "Seit Version 3.0 unzulässig. Siehe CMake-Richtlinie CMP0029.",
	"assets/commands.json.target_compile_definitions": "Fügen Sie einem Ziel Kompilierungsdefinitionen hinzu.",
	"assets/commands.json.target_compile_features": "Fügen Sie einem Ziel erwartete Compilerfeatures hinzu.",
	"assets/commands.json.target_compile_options": "Fügen Sie einem Ziel Kompilierungsoptionen hinzu.",
	"assets/commands.json.target_include_directories": "Fügen Sie einem Ziel Includeverzeichnisse hinzu.",
	"assets/commands.json.target_link_directories": "Fügen Sie einem Ziel Verknüpfungsverzeichnisse hinzu.",
	"assets/commands.json.target_link_libraries": "Geben Sie Bibliotheken oder Flags zum Verknüpfen eines gegebenen Ziels und/oder der entsprechenden abhängigen Elemente an. Die Nutzungsanforderungen von Zielen des Typs verknüpfte Bibliothek werden weitergegeben. Die Nutzungsanforderungen der Abhängigkeiten eines Ziels wirken sich auf die Kompilierung seiner eigenen Quellen aus.",
	"assets/commands.json.target_link_options": "Hiermit werden dem Schritt zur Verknüpfung eines Ziels (eine ausführbare Datei, eine freigegebene Bibliothek oder ein Modul) Optionen hinzugefügt.",
	"assets/commands.json.target_precompile_headers": "Hiermit wird eine Liste der Headerdateien angegeben, die vorkompiliert werden sollen.",
	"assets/commands.json.target_sources": "Fügen Sie einem Ziel Quellen hinzu.",
	"assets/commands.json.try_compile": "Erstellen Sie Code.",
	"assets/commands.json.try_run": "Versuchen Sie, Code zu kompilieren und dann auszuführen.",
	"assets/commands.json.unset": "Heben Sie die Einstellung einer Variable, Cachevariable oder Umgebungsvariable auf.",
	"assets/commands.json.use_mangled_mesa": "Seit Version 3.0 unzulässig. Siehe CMake-Richtlinie CMP0030.",
	"assets/commands.json.utility_source": "Seit Version 3.0 unzulässig. Siehe CMake-Richtlinie CMP0034.",
	"assets/commands.json.variable_requires": "Seit Version 3.0 unzulässig. Siehe CMake-Richtlinie CMP0035.",
	"assets/commands.json.variable_watch": "Überprüfen Sie die CMake-Variable auf Änderungen.",
	"assets/commands.json.while": "Werten Sie eine Gruppe von Befehlen aus, wenn eine Bedingung erfüllt ist",
	"assets/commands.json.write_file": "Das erste Argument ist der Dateiname, die übrigen Argumente sind Meldungen, die geschrieben werden sollen. Wenn das Argument APPEND angegeben ist, wird die Meldung angefügt."
}