/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"assets/variables.json.ANDROID": "Auf \"1\" setzen, wenn das Zielsystem (CMAKE_SYSTEM_NAME) Android ist.",
	"assets/variables.json.APPLE": "Setzen Sie sie auf TRUE, wenn das Zielsystem eine Apple-Plattform ist (macOS, iOS, tvOS, visionOS oder watchOS).",
	"assets/variables.json.BORLAND": "\"True\", wenn der Borland-Compiler verwendet wird.",
	"assets/variables.json.BSD": "Wird auf einen Zeichenfolgenwert festgelegt, wenn das Zielsystem BSD ist. Dieser Wert kann einer der folgenden sein: DragonFlyBSD, FreeBSD, OpenBSD oder NetBSD.",
	"assets/variables.json.BUILD_SHARED_LIBS": "Hiermit wird add_library beim Aufruf ohne expliziten Bibliothekstyp auf den Standardwert \"SHARED libraries\" und nicht auf \"STATIC libraries\" festgelegt.",
	"assets/variables.json.CACHE": "Ein Operator zum Lesen von Cachevariablen.",
	"assets/variables.json.CMAKE_ABSOLUTE_DESTINATION_FILES": "Liste der Dateien, die mithilfe eines ABSOLUTE DESTINATION-Pfads installiert wurden.",
	"assets/variables.json.CMAKE_ADD_CUSTOM_COMMAND_DEPENDS_EXPLICIT_ONLY": "Gibt an, ob die Option DEPENDS_EXPLICIT_ONLY standardmäßig in add_custom_command aktiviert werden soll.",
	"assets/variables.json.CMAKE_ADSP_ROOT": "Bei :ref:`Cross Compiling for ADSP SHARC/Blackfin` enthält diese Variable den absoluten Pfad zur neuesten CCES- oder VDSP++-Installation. Es wird erwartet, dass das Verzeichnis die Compiler cc21k.exe und ccblkfn.exe enthält. Dies wird automatisch festgelegt, wenn eine Standardinstallation von CCES oder VDSP++ gefunden wird.",
	"assets/variables.json.CMAKE_AIX_EXPORT_ALL_SYMBOLS": "Der Standardwert der AIX_EXPORT_ALL_SYMBOLS-Eigenschaft des Ziels. Mit dieser Variablen wird die Eigenschaft für die einzelnen Ziele bei deren Erstellung initialisiert.",
	"assets/variables.json.CMAKE_ANDROID_ANT_ADDITIONAL_OPTIONS": "Standardwert der Zieleigenschaft ANDROID_ANT_ADDITIONAL_OPTIONS. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_ANDROID_API": "Bei der Crosskompilierung für Android mit NVIDIA Nsight Tegra Visual Studio Edition kann diese Variable zur Angabe des Standardwerts der Zieleigenschaft ANDROID_API festgelegt werden. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_ANDROID_API_MIN": "Der Standardwert der Zieleigenschaft ANDROID_API_MIN. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_ANDROID_ARCH": "Bei der Crosskompilierung für Android mit der NVIDIA Nsight Tegra Visual Studio Edition kann diese Variable zur Angabe des Standardwerts der Zieleigenschaft ANDROID_ARCH festgelegt werden. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_ANDROID_ARCH_ABI": "Bei der Crosskompilierung für Android gibt diese Variable die zu verwendende Zielarchitektur und ABI an. Gültige Werte:",
	"assets/variables.json.CMAKE_ANDROID_ARM_MODE": "Wenn Sie eine Crosskompilierung für Android durchführen und CMAKE_ANDROID_ARCH_ABI auf eine der \"armeabi\"-Architekturen festgelegt ist, setzen Sie zur Angabe von 32-Bit-ARM-Prozessoren (\"-marm\") als Ziel CMAKE_ANDROID_ARM_MODE auf ON. Andernfalls werden standardmäßig 16-Bit-Thumb-Prozessoren (\"-mthumb\") als Ziel angegeben.",
	"assets/variables.json.CMAKE_ANDROID_ARM_NEON": "Ist bei der Crosskompilierung für Android CMAKE_ANDROID_ARCH_ABI auf \"armeabi-v7a\" gesetzt, legen Sie CMAKE_ANDROID_ARM_NEON auf ON fest, um ARM NEON-Geräte als Ziel anzugeben.",
	"assets/variables.json.CMAKE_ANDROID_ASSETS_DIRECTORIES": "Der Standardwert der Zieleigenschaft ANDROID_ASSETS_DIRECTORIES. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_ANDROID_EXCEPTIONS": "Bei einer Crosskompilierung für Android mit dem NDK wird diese Variable möglicherweise festgelegt, um anzugeben, ob Ausnahmen aktiviert sind.",
	"assets/variables.json.CMAKE_ANDROID_GUI": "Der Standardwert der Zieleigenschaft ANDROID_GUI. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_ANDROID_JAR_DEPENDENCIES": "Der Standardwert der Zieleigenschaft ANDROID_JAR_DEPENDENCIES. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_ANDROID_JAR_DIRECTORIES": "Der Standardwert der Zieleigenschaft ANDROID_JAR_DIRECTORIES. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_ANDROID_JAVA_SOURCE_DIR": "Der Standardwert der Zieleigenschaft ANDROID_JAVA_SOURCE_DIR. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_ANDROID_NATIVE_LIB_DEPENDENCIES": "Der Standardwert der Zieleigenschaft ANDROID_NATIVE_LIB_DEPENDENCIES. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_ANDROID_NATIVE_LIB_DIRECTORIES": "Der Standardwert der Zieleigenschaft ANDROID_NATIVE_LIB_DIRECTORIES. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_ANDROID_NDK": "Wird die Crosskompilierung für Android mit dem NDK durchgeführt, enthält diese Variable den absoluten Pfad zum Stammverzeichnis des NDK. Das Verzeichnis muss das Unterverzeichnis \"platforms\" mit den android-<api>-Verzeichnissen enthalten.",
	"assets/variables.json.CMAKE_ANDROID_NDK_DEPRECATED_HEADERS": "Bei einer Crosskompilierung für Android mit dem NDK wird diese Variable möglicherweise festgelegt, um anzugeben, ob anstelle der vereinheitlichten Kopfzeilen die veralteten, für die einzelnen API-Ebenen bestimmten Kopfzeilen verwendet werden.",
	"assets/variables.json.CMAKE_ANDROID_NDK_TOOLCHAIN_HOST_TAG": "Bei einer Crosskompilierung für Android mit dem NDK stellt diese Variable das \"Host-Tag\" des NDK bereit, das zum Erstellen des Pfads zu vordefinierten Toolketten verwendet wird, die auf dem Host ausgeführt werden.",
	"assets/variables.json.CMAKE_ANDROID_NDK_TOOLCHAIN_VERSION": "Bei einer Crosskompilierung für Android mit dem NDK wird diese Variable möglicherweise festgelegt, um die Version der Toolkette anzugeben, die als Compiler verwendet wird.",
	"assets/variables.json.CMAKE_ANDROID_NDK_VERSION": "Bei einer Crosskompilierung für Android mit dem NDK und bei Verwendung von Android NDK-Version 11 und höher wird diese Variable von CMake bereitgestellt, um die Nummer der NDK-Version zu melden.",
	"assets/variables.json.CMAKE_ANDROID_PROCESS_MAX": "Der Standardwert der Zieleigenschaft ANDROID_PROCESS_MAX. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_ANDROID_PROGUARD": "Der Standardwert der Zieleigenschaft ANDROID_PROGUARD. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_ANDROID_PROGUARD_CONFIG_PATH": "Der Standardwert der Zieleigenschaft ANDROID_PROGUARD_CONFIG_PATH. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_ANDROID_RTTI": "Bei einer Crosskompilierung für Android mit dem NDK wird diese Variable möglicherweise festgelegt, um anzugeben, ob RTTI aktiviert ist.",
	"assets/variables.json.CMAKE_ANDROID_SECURE_PROPS_PATH": "Der Standardwert der Zieleigenschaft ANDROID_SECURE_PROPS_PATH. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_ANDROID_SKIP_ANT_STEP": "Der Standardwert der Zieleigenschaft ANDROID_SKIP_ANT_STEP. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_ANDROID_STANDALONE_TOOLCHAIN": "Wird die Crosskompilierung für Android mit einer eigenständigen Toolkette durchgeführt, enthält diese Variable den absoluten Pfad zum Stammverzeichnis der Toolkette. Das angegebene Verzeichnis muss ein \"sysroot\"-Unterverzeichnis enthalten.",
	"assets/variables.json.CMAKE_ANDROID_STL_TYPE": "Bei der Crosskompilierung für Android mit NVIDIA Nsight Tegra Visual Studio Edition kann diese Variable zur Angabe des Standardwerts der Zieleigenschaft ANDROID_STL_TYPE festgelegt werden. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_APPBUNDLE_PATH": "Eine mittels Semikolon getrennte Liste mit Verzeichnissen unter Angabe eines Suchpfads für macOS-Anwendungsbundles, der von den Befehlen \"find_program\" und \"find_package\" verwendet wird.",
	"assets/variables.json.CMAKE_APPLE_SILICON_PROCESSOR": "Legen Sie diese Variable auf Apple Silicon-Hosts unter macOS fest, um CMake die Architektur anzugeben, die für CMAKE_HOST_SYSTEM_PROCESSOR verwendet werden soll. Der Wert muss entweder \"arm64\" oder \"x86_64\" lauten.",
	"assets/variables.json.CMAKE_AR": "Der Name des für statische Bibliotheken genutzten Archivierungstools.",
	"assets/variables.json.CMAKE_ARCHIVE_OUTPUT_DIRECTORY": "Gibt an, wo alle ARCHIV-Zieldateien nach der Erstellung abgelegt werden.",
	"assets/variables.json.CMAKE_ARCHIVE_OUTPUT_DIRECTORY_CONFIG": "Gibt an, wo alle ARCHIVE-Zieldateien nach der Erstellung für eine bestimmte Konfiguration abgelegt werden.",
	"assets/variables.json.CMAKE_ARGC": "Die Anzahl an Befehlszeilenargumenten, die im Skriptmodus an CMake übergeben werden.",
	"assets/variables.json.CMAKE_ARGV0": "Ein Befehlszeilenargument, das im Skriptmodus an CMake übergeben wird.",
	"assets/variables.json.CMAKE_AUTOGEN_BETTER_GRAPH_MULTI_CONFIG": "Diese Variable wird verwendet, um die AUTOGEN_BETTER_GRAPH_MULTI_CONFIG-Eigenschaft für alle Ziele zu initialisieren, während sie erstellt werden. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_AUTOGEN_COMMAND_LINE_LENGTH_MAX": "Grenzwert für die Befehlszeilenlänge für autogen-Ziele, d. h. „moc“ oder „uic“, der die Verwendung von Antwortdateien unter Windows auslöst, anstatt alle Argumente an die Befehlszeile zu übergeben.",
	"assets/variables.json.CMAKE_AUTOGEN_ORIGIN_DEPENDS": "Wechseln Sie zum Weiterleiten von Ursprungszielabhängigkeiten an die entsprechenden <ORIGIN>_autogen-Ziele.",
	"assets/variables.json.CMAKE_AUTOGEN_PARALLEL": "Die Anzahl paralleler moc- oder uic-Prozesse, die bei Verwendung von AUTOMOC und AUTOUIC gestartet werden.",
	"assets/variables.json.CMAKE_AUTOGEN_USE_SYSTEM_INCLUDE": "Diese Variable wird verwendet, um die AUTOGEN_USE_SYSTEM_INCLUDE-Eigenschaft für alle Ziele zu initialisieren, während sie erstellt werden. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_AUTOGEN_VERBOSE": "Legt die Ausführlichkeit von AUTOMOC, AUTOUIC und AUTORCC fest. Bei einem positiven Ganzzahlwert oder einem wahren booleschen Wert geben die AUTO*-Generatoren zusätzliche Verarbeitungsinformationen aus.",
	"assets/variables.json.CMAKE_AUTOMOC": "Gibt an, ob moc für Qt-Ziele automatisch verarbeitet wird.",
	"assets/variables.json.CMAKE_AUTOMOC_COMPILER_PREDEFINES": "Mit dieser Variable wird die Eigenschaft AUTOMOC_COMPILER_PREDEFINES auf allen Zielen initialisiert. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_AUTOMOC_DEPEND_FILTERS": "Filtern Sie von CMAKE_AUTOMOC verwendete Definitionen, um Dateinamen aus dem Quellcode als zusätzliche Abhängigkeiten der MOC-Datei zu extrahieren.",
	"assets/variables.json.CMAKE_AUTOMOC_EXECUTABLE": "Mit dieser Variable wird die Eigenschaft AUTOMOC_EXECUTABLE auf allen Zielen initialisiert. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_AUTOMOC_MACRO_NAMES": "Eine durch Semikolon getrennte Liste mit Makronamen. Sie wird von CMAKE_AUTOMOC verwendet, um zu bestimmen, ob eine C++-Datei von \"moc\" verarbeitet werden muss.",
	"assets/variables.json.CMAKE_AUTOMOC_MOC_OPTIONS": "Zusätzliche Optionen für moc beim Verwenden von CMAKE_AUTOMOC.",
	"assets/variables.json.CMAKE_AUTOMOC_PATH_PREFIX": "Hiermit wird angegeben, ob für Qt-Ziele mit AUTOMOC-Aktivierung die Pfadpräfix Option \"-p\" generiert werden soll.",
	"assets/variables.json.CMAKE_AUTOMOC_RELAXED_MODE": "Wechseln Sie zwischen dem strikten und dem gelockerten Automoc-Modus.",
	"assets/variables.json.CMAKE_AUTORCC": "Gibt an, ob rcc für Qt-Ziele automatisch verarbeitet wird.",
	"assets/variables.json.CMAKE_AUTORCC_EXECUTABLE": "Mit dieser Variable wird die Eigenschaft AUTORCC_EXECUTABLE auf allen Zielen initialisiert. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_AUTORCC_OPTIONS": "Zusätzliche Optionen für rcc beim Verwenden von CMAKE_AUTORCC.",
	"assets/variables.json.CMAKE_AUTOUIC": "Gibt an, ob uic für Qt-Ziele automatisch verarbeitet wird.",
	"assets/variables.json.CMAKE_AUTOUIC_EXECUTABLE": "Mit dieser Variable wird die Eigenschaft AUTOUIC_EXECUTABLE auf allen Zielen initialisiert. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_AUTOUIC_OPTIONS": "Zusätzliche Optionen für uic beim Verwenden von CMAKE_AUTOUIC.",
	"assets/variables.json.CMAKE_AUTOUIC_SEARCH_PATHS": "Suchpfadliste, mit der CMAKE_AUTOUIC enthaltene .ui-Dateien findet.",
	"assets/variables.json.CMAKE_BACKWARDS_COMPATIBILITY": "Veraltet. Siehe Dokumentation zur CMake-Richtlinie CMP0001.",
	"assets/variables.json.CMAKE_BINARY_DIR": "Der Pfad zur obersten Ebene des Buildbaums.",
	"assets/variables.json.CMAKE_BUILD_RPATH": "Eine durch Semikolon getrennte Liste zur Angabe von Laufzeitpfadeinträgen (RPATH-Einträgen), die in der Buildstruktur verknüpften Binärdateien hinzugefügt werden (für Plattformen mit entsprechender Unterstützung). Die Einträge werden nicht für Binärdateien in der Installationsstruktur verwendet. Siehe auch Variable CMAKE_INSTALL_RPATH.",
	"assets/variables.json.CMAKE_BUILD_RPATH_USE_ORIGIN": "Gibt an, ob relative Pfade für den RPATH-Wert des Builds verwendet werden sollen.",
	"assets/variables.json.CMAKE_BUILD_TOOL": "Diese Variable existiert nur aus Gründen der Abwärtskompatibilität. Sie enthält den gleichen Wert wie CMAKE_MAKE_PROGRAM. Verwenden Sie stattdessen diese Variable.",
	"assets/variables.json.CMAKE_BUILD_TYPE": "Gibt den Buildtyp für Generatoren mit nur einer Konfiguration an (z. B. Makefile-Generatoren oder Ninja). Typische Werte sind Debug, Release, RelWithDebInfo und MinSizeRel, aber auch benutzerdefinierte Buildtypen können definiert werden.",
	"assets/variables.json.CMAKE_BUILD_WITH_INSTALL_NAME_DIR": "Legt fest, ob für Ziele im Buildbaum INSTALL_NAME_DIR verwendet wird.",
	"assets/variables.json.CMAKE_BUILD_WITH_INSTALL_RPATH": "Verwenden Sie den Installationspfad für RPATH.",
	"assets/variables.json.CMAKE_CACHEFILE_DIR": "Diese Variable wird intern von CMake verwendet und darf während der ersten Konfiguration eines Build-Baums nicht festgelegt werden. Wenn es gesetzt ist, hat es denselben Wert wie CMAKE_BINARY_DIR. Verwenden Sie stattdessen diese Variable.",
	"assets/variables.json.CMAKE_CACHE_MAJOR_VERSION": "Hauptversion von CMake zum Erstellen der Datei \"CMakeCache.txt\"",
	"assets/variables.json.CMAKE_CACHE_MINOR_VERSION": "Nebenversion von CMake zum Erstellen der Datei \"CMakeCache.txt\"",
	"assets/variables.json.CMAKE_CACHE_PATCH_VERSION": "Patchversion von CMake zum Erstellen der Datei \"CMakeCache.txt\"",
	"assets/variables.json.CMAKE_CFG_INTDIR": "Buildzeitverweis auf Ausgabeunterverzeichnis (pro Konfiguration)",
	"assets/variables.json.CMAKE_CLANG_VFS_OVERLAY": "Bei einer Crosskompilierung für Windows mit clang-cl kann diese Variable ein absoluter Pfad sein, der auf die YAML-Datei eines virtuellen clang-Dateisystems verweist. So kann clang-cl Windows-Headernamen in einem Dateisystem auflösen, bei dem die Groß-/Kleinschreibung relevant ist.",
	"assets/variables.json.CMAKE_CL_64": "Nicht empfohlen. Verwenden Sie stattdessen CMAKE_SIZEOF_VOID_P.",
	"assets/variables.json.CMAKE_CODEBLOCKS_COMPILER_ID": "Ändern Sie die Compiler-ID in den generierten CodeBlocks-Projektdateien.",
	"assets/variables.json.CMAKE_CODEBLOCKS_EXCLUDE_EXTERNAL_FILES": "Ändern Sie die Vorgehensweise des CodeBlocks-Generators beim Erstellen von Projektdateien.",
	"assets/variables.json.CMAKE_CODELITE_USE_TARGETS": "Ändern Sie die Vorgehensweise des CodeLite-Generators beim Erstellen von Projektdateien.",
	"assets/variables.json.CMAKE_COLOR_DIAGNOSTICS": "Aktivieren Sie die Farbdiagnose im gesamten Bereich.",
	"assets/variables.json.CMAKE_COLOR_MAKEFILE": "Aktiviert die Farbausgabe beim Verwenden der Makefile-Generatoren.",
	"assets/variables.json.CMAKE_COMMAND": "Der vollständige Pfad zur ausführbaren CMake-Datei.",
	"assets/variables.json.CMAKE_COMPILER_2005": "Verwenden des Visual Studio 2005-Compilers von Microsoft",
	"assets/variables.json.CMAKE_COMPILER_IS_GNUCC": "WAHR, wenn der C-Compiler GNU ist.",
	"assets/variables.json.CMAKE_COMPILER_IS_GNUCXX": "WAHR, wenn der C++ (CXX)-Compiler GNU ist.",
	"assets/variables.json.CMAKE_COMPILER_IS_GNUG77": "WAHR, wenn der Fortran-Compiler GNU ist.",
	"assets/variables.json.CMAKE_COMPILE_PDB_OUTPUT_DIRECTORY": "Ausgabeverzeichnis für MS-Debugsymbol-.pdb-Dateien, die der Compiler beim Erstellen von Quelldateien generiert.",
	"assets/variables.json.CMAKE_COMPILE_PDB_OUTPUT_DIRECTORY_CONFIG": "Ausgabeverzeichnis (pro Konfiguration ) für MS-Debugsymbol-.pdb-Dateien, die der Compiler beim Erstellen von Quelldateien generiert.",
	"assets/variables.json.CMAKE_COMPILE_WARNING_AS_ERROR": "Geben Sie an, ob Warnungen bei der Kompilierung als Fehler behandelt werden sollen.",
	"assets/variables.json.CMAKE_CONFIGURATION_TYPES": "Gibt die verfügbaren Buildtypen (Konfigurationen) für Generatoren mit mehreren Konfigurationen (z. B. Visual Studio, Xcode oder Ninja Multi-Config) als durch Semikolons getrennte Liste an. Typische Einträge sind Debug, Release, RelWithDebInfo und MinSizeRel, aber auch benutzerdefinierte Buildtypen können definiert werden.",
	"assets/variables.json.CMAKE_CONFIG_POSTFIX": "Standardmäßiges Dateinamenpostfix für Bibliotheken unter Konfiguration <CONFIG>.",
	"assets/variables.json.CMAKE_CPACK_COMMAND": "Der vollständige Pfad zum Befehl \"cpack\", der mit CMake installiert wird.",
	"assets/variables.json.CMAKE_CROSSCOMPILING": "Diese Variable wird von CMake festgelegt, um anzugeben, ob es sich um eine Kreuzkompilierung handelt. Beachten Sie jedoch die unten beschriebenen Einschränkungen.",
	"assets/variables.json.CMAKE_CROSSCOMPILING_EMULATOR": "Diese Variable wird nur verwendet, wenn CMAKE_CROSSCOMPILING aktiviert ist. Sie verweist auf einen Befehl des Hostsystems, über den für das Zielsystem erstellte ausführbare Dateien ausgeführt werden können.",
	"assets/variables.json.CMAKE_CROSS_CONFIGS": "Hiermit wird eine durch Semikolon getrennte Liste der Konfigurationen angegeben, die in allen build-<Config>.ninja-Dateien im Ninja-Multi-Config-Generator verfügbar sind. Mit dieser Variable wird der konfigurationsübergreifende Modus aktiviert. Ziele aus jeder in dieser Variablen angegebenen Konfiguration können aus einer beliebigen build-<Config>.ninja-Datei kompiliert werden. Benutzerdefinierte Befehle verwenden die native Konfiguration für build-<Config>.ninja-Dateien. Wenn diese Option auf \"all\" festgelegt ist, gelten alle Konfigurationen aus CMAKE_CONFIGURATION_TYPES konfigurationsübergreifend. Wird diese Option nicht angegeben oder ist die Option leer, enthält jede build-<Config>.ninja-Datei nur Buildregeln für die eigene Konfiguration.",
	"assets/variables.json.CMAKE_CTEST_ARGUMENTS": "Legen Sie diese Variable auf eine durch Semikolon getrennte Liste der Befehlszeilenargumente fest, die beim Ausführen von Tests über das test-Ziel (oder RUN_TESTS) des generierten Buildsystems an \"ctest\" übergeben werden sollen.",
	"assets/variables.json.CMAKE_CTEST_COMMAND": "Der vollständige Pfad zum Befehl \"ctest\", der mit CMake installiert wird.",
	"assets/variables.json.CMAKE_CUDA_ARCHITECTURES": "Der Standardwert der CUDA_ARCHITECTURES-Eigenschaft von Zielen.",
	"assets/variables.json.CMAKE_CUDA_COMPILE_FEATURES": "Eine Liste der Features, die dem CUDA-Compiler bekannt sind.",
	"assets/variables.json.CMAKE_CUDA_EXTENSIONS": "Standardwert für CUDA_EXTENSIONS Zieleigenschaft, wenn beim Erstellen eines Ziels festgelegt.",
	"assets/variables.json.CMAKE_CUDA_HOST_COMPILER": "Dies ist der ursprüngliche CUDA-spezifische Name für die allgemeinere CMAKE_<LANG>_HOST_COMPILER-Variable. Weitere Informationen finden Sie im letzteren Abschnitt.",
	"assets/variables.json.CMAKE_CUDA_RESOLVE_DEVICE_SYMBOLS": "Standardwert für die Zieleigenschaft CUDA_RESOLVE_DEVICE_SYMBOLS, sofern definiert. Diese Variable ist standardmäßig nicht definiert.",
	"assets/variables.json.CMAKE_CUDA_RUNTIME_LIBRARY": "Wählen Sie die CUDA-Laufzeitbibliothek aus, die beim Kompilieren und Verknüpfen von CUDA verwendet werden soll. Mit dieser Variablen wird die CUDA_RUNTIME_LIBRARY-Eigenschaft für alle Ziele bei deren Erstellung initialisiert.",
	"assets/variables.json.CMAKE_CUDA_SEPARABLE_COMPILATION": "Standardwert der Zieleigenschaft CUDA_SEPARABLE_COMPILATION. Mit dieser Variable wird die Eigenschaft während des Erstellens auf allen Zielen initialisiert.",
	"assets/variables.json.CMAKE_CUDA_STANDARD": "Standardwert für CUDA_STANDARD Zieleigenschaft, wenn beim Erstellen eines Ziels festgelegt.",
	"assets/variables.json.CMAKE_CUDA_STANDARD_REQUIRED": "Standardwert für CUDA_STANDARD_REQUIRED Zieleigenschaft, wenn beim Erstellen eines Ziels festgelegt.",
	"assets/variables.json.CMAKE_CUDA_TOOLKIT_INCLUDE_DIRECTORIES": "Bei aktivierter CUDA-Sprache wird hiermit eine durch Semikolon getrennte Liste der Includeverzeichnisse angegeben, die vom CUDA-Toolkit bereitgestellt werden. Dieser Wert kann nützlich sein, wenn C++-Quelldateien CUDA-Header enthalten sollen.",
	"assets/variables.json.CMAKE_CURRENT_BINARY_DIR": "Der Pfad zum Binärverzeichnis, das gerade verarbeitet wird.",
	"assets/variables.json.CMAKE_CURRENT_FUNCTION": "Beim Ausführen von Code innerhalb einer Funktion enthält diese Variable den Namen der aktuellen Funktion. Dieser kann für Diagnose- oder Debugmeldungen nützlich sein.",
	"assets/variables.json.CMAKE_CURRENT_FUNCTION_LIST_DIR": "Beim Ausführen von Code innerhalb einer Funktion enthält diese Variable das vollständige Verzeichnis der Listendatei, die die aktuelle Funktion definiert hat.",
	"assets/variables.json.CMAKE_CURRENT_FUNCTION_LIST_FILE": "Beim Ausführen von Code innerhalb einer Funktion enthält diese Variable den vollständigen Pfad zur Listendatei, die die aktuelle Funktion definiert hat.",
	"assets/variables.json.CMAKE_CURRENT_FUNCTION_LIST_LINE": "Beim Ausführen von Code innerhalb einer Funktion enthält diese Variable die Zeilennummer in der Listendatei, in der die aktuelle Funktion definiert wurde.",
	"assets/variables.json.CMAKE_CURRENT_LIST_DIR": "Das vollständige Verzeichnis der Listendatei, die gerade verarbeitet wird.",
	"assets/variables.json.CMAKE_CURRENT_LIST_FILE": "Der vollständige Pfad zur Listendatei, die gerade verarbeitet wird.",
	"assets/variables.json.CMAKE_CURRENT_LIST_LINE": "Die Zeilennummer der Datei, die gerade verarbeitet wird.",
	"assets/variables.json.CMAKE_CURRENT_SOURCE_DIR": "Der Pfad zum Quellverzeichnis, das gerade verarbeitet wird.",
	"assets/variables.json.CMAKE_CXX_COMPILER_IMPORT_STD": "Eine Liste der C++-Standardebenen, für die standardmäßige Importunterstützung für die aktuelle C++-Toolkette vorhanden ist. Die Unterstützung für C++-<NN> kann mithilfe eines <NN> IN_LIST CMAKE_CXX_COMPILER_IMPORT_STD Prädikats mit dem if-Befehl erkannt werden.",
	"assets/variables.json.CMAKE_CXX_COMPILE_FEATURES": "Liste mit Features, die dem C++-Compiler bekannt sind",
	"assets/variables.json.CMAKE_CXX_EXTENSIONS": "Standardwert für CXX_EXTENSIONS Zieleigenschaft, wenn beim Erstellen eines Ziels festgelegt.",
	"assets/variables.json.CMAKE_CXX_MODULE_STD": "Gibt an, ob Hilfsprogrammziele als Abhängigkeiten zu Zielen mit mindestens cxx_std_23 hinzugefügt werden sollen oder nicht.",
	"assets/variables.json.CMAKE_CXX_SCAN_FOR_MODULES": "Gibt an, ob C++-Quelldateien auf Modulabhängigkeiten überprüft werden sollen.",
	"assets/variables.json.CMAKE_CXX_STANDARD": "Standardwert für CXX_STANDARD Zieleigenschaft, wenn beim Erstellen eines Ziels festgelegt.",
	"assets/variables.json.CMAKE_CXX_STANDARD_REQUIRED": "Standardwert für CXX_STANDARD_REQUIRED Zieleigenschaft, wenn beim Erstellen eines Ziels festgelegt.",
	"assets/variables.json.CMAKE_C_COMPILE_FEATURES": "Liste mit Features, die dem C-Compiler bekannt sind",
	"assets/variables.json.CMAKE_C_EXTENSIONS": "Standardwert für C_EXTENSIONS Zieleigenschaft, wenn beim Erstellen eines Ziels festgelegt.",
	"assets/variables.json.CMAKE_C_STANDARD": "Standardwert für C_STANDARD Zieleigenschaft, wenn beim Erstellen eines Ziels festgelegt.",
	"assets/variables.json.CMAKE_C_STANDARD_REQUIRED": "Standardwert für C_STANDARD_REQUIRED Zieleigenschaft, wenn beim Erstellen eines Ziels festgelegt.",
	"assets/variables.json.CMAKE_DEBUG_POSTFIX": "Siehe Variable CMAKE_<CONFIG>_POSTFIX.",
	"assets/variables.json.CMAKE_DEBUG_TARGET_PROPERTIES": "Ermöglicht die Ausgabenachverfolgung für Zieleigenschaften.",
	"assets/variables.json.CMAKE_DEFAULT_BUILD_TYPE": "Gibt die Konfiguration an, die standardmäßig in einer build.ninja-Datei im Ninja Multi-Config-Generator verwendet werden soll. Wenn diese Variable angegeben ist, verwendet \"build.ninja\" standardmäßig Buildregeln aus \"build-<Config>.ninja\". Alle benutzerdefinierten Befehle werden mit dieser Konfiguration ausgeführt. Wenn die Variable nicht angegeben ist, wird stattdessen das erste Element aus CMAKE_CONFIGURATION_TYPES verwendet.",
	"assets/variables.json.CMAKE_DEFAULT_CONFIGS": "Hiermit wird eine durch Semikolon getrennte Liste der Konfigurationen angegeben, die für ein Ziel in \"build.ninja\" erstellt werden sollen, wenn kein :<Config>-Suffix im Ninja Multi-Config-Generator angegeben ist. Bei einer Festlegung auf \"all\" werden alle Konfigurationen aus CMAKE_CROSS_CONFIGS verwendet. Ohne Festlegung wird standardmäßig CMAKE_DEFAULT_BUILD_TYPE verwendet.",
	"assets/variables.json.CMAKE_DEPENDS_IN_PROJECT_ONLY": "Wird die Einstellung in einem Verzeichnis auf TRUE gesetzt, berücksichtigt das von den Makefile-Generatoren produzierte Buildsystem nur die Abhängigkeiten bei Quelldateien, die entweder im Quell- oder Binärverzeichnis vorhanden sind. Bei Änderungen an Quelldateien, die sich außerhalb dieser Verzeichnisse befinden, erfolgen keine Wiederherstellungen.",
	"assets/variables.json.CMAKE_DEPENDS_USE_COMPILER": "Bei den Makefile-Generatoren werden Quellabhängigkeiten für eine Auswahl von Compilern jetzt vom Compiler selbst generiert. Indem Sie diese Variable mit dem Wert FALSE definieren, können Sie das Legacyverhalten wiederherstellen (z. B. Verwendung von CMAKE zur Ermittlung von Abhängigkeiten).",
	"assets/variables.json.CMAKE_DIRECTORY_LABELS": "Geben Sie Bezeichnungen für das aktuelle Verzeichnis an.",
	"assets/variables.json.CMAKE_DISABLE_FIND_PACKAGE_PackageName": "Variable zum Deaktivieren von find_package-Aufrufen.",
	"assets/variables.json.CMAKE_DISABLE_PRECOMPILE_HEADERS": "Der Standardwert für DISABLE_PRECOMPILE_HEADERS von Zielen.",
	"assets/variables.json.CMAKE_DLL_NAME_WITH_SOVERSION": "Diese Variable wird zur Initialisierung der DLL_NAME_WITH_SOVERSION-Eigenschaft auf gemeinsam genutzten Bibliothekszielen für die Windows-Plattform verwendet, die ausgewählt wird, wenn die WIN32-Variable gesetzt ist.",
	"assets/variables.json.CMAKE_DL_LIBS": "Name der Bibliothek, die \"dlopen\" und \"dlclose\" enthält.",
	"assets/variables.json.CMAKE_DOTNET_SDK": "Standardwert für die DOTNET_SDK-Eigenschaft von Zielen.",
	"assets/variables.json.CMAKE_DOTNET_TARGET_FRAMEWORK": "Der Standardwert der DOTNET_TARGET_FRAMEWORK-Eigenschaft von Zielen.",
	"assets/variables.json.CMAKE_DOTNET_TARGET_FRAMEWORK_VERSION": "Standardwert der Eigenschaft DOTNET_TARGET_FRAMEWORK_VERSION von Zielen.",
	"assets/variables.json.CMAKE_ECLIPSE_GENERATE_LINKED_RESOURCES": "Diese Cachevariable wird vom Eclipse-Projektgenerator verwendet. Siehe \"cmake-generators\".",
	"assets/variables.json.CMAKE_ECLIPSE_GENERATE_SOURCE_PROJECT": "Diese Cachevariable wird vom Eclipse-Projektgenerator verwendet. Siehe \"cmake-generators\".",
	"assets/variables.json.CMAKE_ECLIPSE_MAKE_ARGUMENTS": "Diese Cachevariable wird vom Eclipse-Projektgenerator verwendet. Siehe \"cmake-generators\".",
	"assets/variables.json.CMAKE_ECLIPSE_RESOURCE_ENCODING": "Diese Cachevariable weist den Eclipse CDT4-Projektgenerator an, die Ressourcencodierung in generierten Projektdateien auf den angegebenen Wert festzulegen. Ist kein Wert angegeben, wird keine Codierung festgelegt.",
	"assets/variables.json.CMAKE_ECLIPSE_VERSION": "Diese Cachevariable wird vom Eclipse-Projektgenerator verwendet. Siehe \"cmake-generators\".",
	"assets/variables.json.CMAKE_EDIT_COMMAND": "Vollständiger Pfad zu cmake-gui oder ccmake. Wird nur für Makefile- und Ninja-Generatoren definiert, wenn keine zusätzlichen Generatoren verwendet werden.",
	"assets/variables.json.CMAKE_ENABLE_EXPORTS": "Hiermit wird angegeben, ob ausführbare Dateien Symbole für ladbare Module exportieren sollen.",
	"assets/variables.json.CMAKE_ERROR_DEPRECATED": "Legt fest, ob aufgrund veralteter Funktionen Fehlermeldungen angezeigt werden.",
	"assets/variables.json.CMAKE_ERROR_ON_ABSOLUTE_INSTALL_DESTINATION": "Das Skript \"cmake_install.cmake\" veranlassen, eine Fehlermeldung anzuzeigen, wenn eine Datei mit absolutem INSTALL DESTINATION gefunden wird.",
	"assets/variables.json.CMAKE_EXECUTABLE_ENABLE_EXPORTS": "Hiermit wird angegeben, ob ausführbare Dateien Symbole für ladbare Module exportieren sollen.",
	"assets/variables.json.CMAKE_EXECUTABLE_SUFFIX": "Das auf dieser Plattform verwendete Suffix für ausführbare Dateien.",
	"assets/variables.json.CMAKE_EXECUTABLE_SUFFIX_LANG": "Das Suffix, das für das Ende eines ausführbaren Dateinamens von <LANG> Compiler-Zielarchitektur verwendet werden soll, sofern vorhanden.",
	"assets/variables.json.CMAKE_EXECUTE_PROCESS_COMMAND_ECHO": "Wenn diese Variable auf STDERR, STDOUT oder NONE festgelegt ist, werden Befehle in \"execute_process\" entweder an \"stderr\" oder \"stdout\" oder gar nicht ausgegeben.",
	"assets/variables.json.CMAKE_EXE_LINKER_FLAGS": "Linkerflags zum Erstellen ausführbarer Dateien.",
	"assets/variables.json.CMAKE_EXE_LINKER_FLAGS_CONFIG": "Flags, die beim Verknüpfen einer ausführbaren Datei verwendet werden.",
	"assets/variables.json.CMAKE_EXE_LINKER_FLAGS_CONFIG_INIT": "Wert, mit dem der Cacheeintrag CMAKE_EXE_LINKER_FLAGS_ beim erstmaligen Konfigurieren eines Buildbaums initialisiert wird. Diese Variable wird i. d. R. durch eine Toolkettendatei festgelegt. Je nach Umgebung und Zielplattform fügt CMake vor oder nach dem Wert Inhalte hinzu.",
	"assets/variables.json.CMAKE_EXE_LINKER_FLAGS_INIT": "Wert, mit dem der Cacheeintrag CMAKE_EXE_LINKER_FLAGS_ beim erstmaligen Konfigurieren eines Buildbaums initialisiert wird. Diese Variable muss durch eine Toolkettendatei festgelegt werden. Je nach Umgebung und Zielplattform fügt CMake vor oder nach dem Wert Inhalte hinzu.",
	"assets/variables.json.CMAKE_EXPORT_COMPILE_COMMANDS": "Aktivieren/deaktivieren Sie die Ausgabe von Kompilierungsbefehlen während der Erstellung.",
	"assets/variables.json.CMAKE_EXPORT_FIND_PACKAGE_NAME": "Initialisiert den Wert von EXPORT_FIND_PACKAGE_NAME.",
	"assets/variables.json.CMAKE_EXPORT_NO_PACKAGE_REGISTRY": "Hiermit wird der Befehl \"export\" deaktiviert, wenn CMP0090 nicht auf NEW festgelegt ist.",
	"assets/variables.json.CMAKE_EXPORT_PACKAGE_REGISTRY": "Hiermit wird der Befehl \"export\" aktiviert, wenn CMP0090 auf NEW festgelegt ist.",
	"assets/variables.json.CMAKE_EXTRA_GENERATOR": "Der zusätzliche Generator zum Erstellen des Projekts. Siehe \"cmake-generators\".",
	"assets/variables.json.CMAKE_EXTRA_SHARED_LIBRARY_SUFFIXES": "Zusätzliche Suffixe für freigegebene Bibliotheken.",
	"assets/variables.json.CMAKE_FIND_APPBUNDLE": "Diese Variable beeinflusst, wie find_*-Befehle eine Auswahl zwischen macOS-Anwendungsbundles und Unix-ähnlichen Paketkomponenten treffen.",
	"assets/variables.json.CMAKE_FIND_DEBUG_MODE": "Hiermit werden neben dem Standardfehler zusätzliche find-Aufrufinformationen für die folgenden Befehle ausgegeben:",
	"assets/variables.json.CMAKE_FIND_FRAMEWORK": "Diese Variable beeinflusst, wie find_*-Befehle eine Auswahl zwischen macOS-Frameworks und Unix-ähnlichen Paketkomponenten treffen.",
	"assets/variables.json.CMAKE_FIND_LIBRARY_CUSTOM_LIB_SUFFIX": "Geben Sie ein <suffix> ein, damit der Befehl \"find_library\" zunächst ein bestimmtes lib<suffix>-Verzeichnis durchsucht, bevor die anderen lib-Verzeichnisse durchsucht werden.",
	"assets/variables.json.CMAKE_FIND_LIBRARY_PREFIXES": "Voranzustellende Präfixe, wenn nach Bibliotheken gesucht wird.",
	"assets/variables.json.CMAKE_FIND_LIBRARY_SUFFIXES": "Anzufügende Suffixe, wenn nach Bibliotheken gesucht wird.",
	"assets/variables.json.CMAKE_FIND_NO_INSTALL_PREFIX": "Schließen Sie die Werte der Variablen CMAKE_INSTALL_PREFIX und CMAKE_STAGING_PREFIX von CMAKE_SYSTEM_PREFIX_PATH aus. CMake fügt diese Projektzielpräfixe standardmäßig CMAKE_SYSTEM_PREFIX_PATH hinzu, damit eine Reihe abhängiger Pakete erstellt und in einem gemeinsamen Präfix installiert werden kann. Setzen Sie CMAKE_FIND_NO_INSTALL_PREFIX auf TRUE, um dieses Verhalten zu unterdrücken.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_NAME": "Wird über den Befehl find_package während des Ladens eines gefundenen Moduls definiert, um den vom Aufrufer angegebenen Paketnamen aufzuzeichnen. Weitere Informationen finden Sie in der Befehlsdokumentation.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_NO_PACKAGE_REGISTRY": "Diese Variable ist standardmäßig nicht festgelegt. Wenn weder CMAKE_FIND_USE_PACKAGE_REGISTRY noch CMAKE_FIND_PACKAGE_NO_PACKAGE_REGISTRY festgelegt ist, verwendet \"find_package()\" die Benutzerpaketregistrierung, sofern nicht die Option NO_CMAKE_PACKAGE_REGISTRY angegeben ist.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_NO_SYSTEM_PACKAGE_REGISTRY": "Diese Variable ist standardmäßig nicht festgelegt. Wenn weder CMAKE_FIND_USE_SYSTEM_PACKAGE_REGISTRY noch CMAKE_FIND_PACKAGE_NO_SYSTEM_PACKAGE_REGISTRY festgelegt ist, verwendet \"find_package()\" die Systempaketregistrierung, sofern nicht die Option NO_CMAKE_SYSTEM_PACKAGE_REGISTRY angegeben ist.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_PREFER_CONFIG": "Hiermit wird \"find_package\" angewiesen, den Modus \"Config\" vor dem Modus \"Module\" auszuprobieren, wenn kein Modus angegeben wurde.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_REDIRECTS_DIR": "Diese schreibgeschützte Variable gibt ein Verzeichnis an, das der Befehl „find_package“ zuerst überprüft, bevor an einer anderen Stelle nach einer Modul- oder Konfigurationspaketdatei sucht. Eine Konfigurationspaketdatei in diesem Verzeichnis wird immer vor jeder anderen Suchmoduldatei oder Konfigurationspaketdatei gefunden.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_RESOLVE_SYMLINKS": "Legen Sie den Wert dieser Variablen auf TRUE fest, damit in find_package-Aufrufen symbolische Links in den Wert von <PackageName>_DIR aufgelöst werden.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_SORT_DIRECTION": "Die von CMAKE_FIND_PACKAGE_SORT_ORDER verwendete Sortierungsrichtung. Einer der folgenden Werte kann gesetzt werden:",
	"assets/variables.json.CMAKE_FIND_PACKAGE_SORT_ORDER": "Die Standardreihenfolge beim Sortieren von Paketen, die mit \"find_package\" gefunden wurden. Einer der folgenden Werte ist möglich:",
	"assets/variables.json.CMAKE_FIND_PACKAGE_TARGETS_GLOBAL": "Durch Festlegen auf WAHR werden alle IMPORTIERTEN Ziele, die von „find_package“ ermittelt werden, in einen GLOBALEN Bereich höher gestuft.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_WARN_NO_MODULE": "Veranlassen Sie find_package, einen Warnhinweis anzuzeigen, wenn der Aufruf ohne Explicit-Modus erfolgt.",
	"assets/variables.json.CMAKE_FIND_ROOT_PATH": "Eine mittels Semikolon getrennte Liste mit Stammpfaden, die im Dateisystem durchsucht werden.",
	"assets/variables.json.CMAKE_FIND_ROOT_PATH_MODE_INCLUDE": "Diese Variable steuert, ob CMAKE_FIND_ROOT_PATH und CMAKE_SYSROOT von FIND_XXX verwendet werden.",
	"assets/variables.json.CMAKE_FIND_ROOT_PATH_MODE_LIBRARY": "Diese Variable steuert, ob CMAKE_FIND_ROOT_PATH und CMAKE_SYSROOT von FIND_XXX verwendet werden.",
	"assets/variables.json.CMAKE_FIND_ROOT_PATH_MODE_PACKAGE": "Diese Variable steuert, ob CMAKE_FIND_ROOT_PATH und CMAKE_SYSROOT von FIND_XXX verwendet werden.",
	"assets/variables.json.CMAKE_FIND_ROOT_PATH_MODE_PROGRAM": "Diese Variable steuert, ob CMAKE_FIND_ROOT_PATH und CMAKE_SYSROOT von FIND_XXX verwendet werden.",
	"assets/variables.json.CMAKE_FIND_USE_CMAKE_ENVIRONMENT_PATH": "Steuert das Standardverhalten der folgenden Befehle in Bezug auf das Durchsuchen von Pfaden, die über CMake-spezifische Umgebungsvariablen angegeben werden:",
	"assets/variables.json.CMAKE_FIND_USE_CMAKE_PATH": "Steuert das Standardverhalten der folgenden Befehle in Bezug auf das Durchsuchen von Pfaden, die über CMake-spezifische Cachevariablen angegeben werden:",
	"assets/variables.json.CMAKE_FIND_USE_CMAKE_SYSTEM_PATH": "Steuert das Standardverhalten der folgenden Befehle in Bezug auf das Durchsuchen von Pfaden, die über plattformspezifische CMake-Variablen angegeben werden:",
	"assets/variables.json.CMAKE_FIND_USE_INSTALL_PREFIX": "Steuert das Standardverhalten der folgenden Befehle, um zu bestimmen, ob die Speicherorte in den Variablen CMAKE_INSTALL_PREFIX und CMAKE_STAGING_PREFIX durchsucht werden sollen.",
	"assets/variables.json.CMAKE_FIND_USE_PACKAGE_REGISTRY": "Steuert das Standardverhalten des Befehls \"find_package\" in Bezug auf das Durchsuchen von Pfaden, die über die Benutzerpaketregistrierung angegeben werden.",
	"assets/variables.json.CMAKE_FIND_USE_PACKAGE_ROOT_PATH": "Steuert das Standardverhalten der folgenden Befehle in Bezug auf das Durchsuchen von Pfaden, die über <PackageName>_ROOT-Variablen angegeben werden:",
	"assets/variables.json.CMAKE_FIND_USE_SYSTEM_ENVIRONMENT_PATH": "Steuert das Standardverhalten der folgenden Befehle in Bezug auf das Durchsuchen von Pfaden, die über standardmäßige Systemumgebungsvariablen angegeben werden:",
	"assets/variables.json.CMAKE_FIND_USE_SYSTEM_PACKAGE_REGISTRY": "Steuert das Verhalten beim Durchsuchen der Systempaketregistrierung über den Befehl \"find_package\".",
	"assets/variables.json.CMAKE_FOLDER": "Legen Sie den Ordnernamen fest, und ordnen Sie Ziele in einer IDE an.",
	"assets/variables.json.CMAKE_Fortran_FORMAT": "Auf FIXED oder FREE setzen, um das Fortran-Quelllayout anzugeben.",
	"assets/variables.json.CMAKE_Fortran_MODDIR_DEFAULT": "Das standardmäßige Fortran-Modulausgabeverzeichnis.",
	"assets/variables.json.CMAKE_Fortran_MODDIR_FLAG": "Das Fortran-Flag für das Modulausgabeverzeichnis.",
	"assets/variables.json.CMAKE_Fortran_MODOUT_FLAG": "Fortran-Flag zum Aktivieren der Modulausgabe.",
	"assets/variables.json.CMAKE_Fortran_MODULE_DIRECTORY": "Fortran-Modulausgabeverzeichnis.",
	"assets/variables.json.CMAKE_Fortran_PREPROCESS": "Der Standardwert der Fortran_PREPROCESS-Eigenschaft von Zielen.",
	"assets/variables.json.CMAKE_FRAMEWORK": "Der Standardwert der FRAMEWORK-Eigenschaft von Zielen.",
	"assets/variables.json.CMAKE_FRAMEWORK_MULTI_CONFIG_POSTFIX_CONFIG": "Ein Standardpostfix für den Frameworkdateinamen unter Konfiguration <CONFIG>, wenn ein Generator mit Unterstützung für mehrere Konfigurationen verwendet wird.",
	"assets/variables.json.CMAKE_FRAMEWORK_PATH": "Eine mittels Semikolon getrennte Liste mit Verzeichnissen unter Angabe eines Suchpfads für macOS-Frameworks, die von den Befehlen \"find_library\", \"find_package\" und \"find_file\" verwendet werden.",
	"assets/variables.json.CMAKE_GENERATOR": "Der Generator zum Erstellen des Projekts. Siehe cmake-generators.",
	"assets/variables.json.CMAKE_GENERATOR_INSTANCE": "Vom Benutzer bereitgestellte generatorspezifische Spezifikation der Instanz.",
	"assets/variables.json.CMAKE_GENERATOR_PLATFORM": "Vom Benutzer bereitgestellte generatorspezifische Spezifikation der Zielplattform.",
	"assets/variables.json.CMAKE_GENERATOR_TOOLSET": "Vom Benutzer bereitgestellte Toolset-Spezifikation des nativen Buildsystems.",
	"assets/variables.json.CMAKE_GHS_NO_SOURCE_GROUP_FILE": "Ein boolescher Wert, der auf ON oder OFF festgelegt werden kann. Dieser Wert steuert, ob die Projektdatei für ein Ziel eine einzelne Datei ist oder aus mehreren Dateien bestehen soll. Weitere Informationen finden Sie unter GHS_NO_SOURCE_GROUP_FILE.",
	"assets/variables.json.CMAKE_GLOBAL_AUTOGEN_TARGET": "Eine Option, mit der die Generierung eines globalen autogen-Ziels aktiviert werden kann.",
	"assets/variables.json.CMAKE_GLOBAL_AUTOGEN_TARGET_NAME": "Hiermit kann der Name des globalen autogen-Ziels geändert werden.",
	"assets/variables.json.CMAKE_GLOBAL_AUTORCC_TARGET": "Eine Option, mit der die Generierung eines globalen autorcc-Ziels aktiviert werden kann.",
	"assets/variables.json.CMAKE_GLOBAL_AUTORCC_TARGET_NAME": "Hiermit kann der Name des globalen autorcc-Ziels geändert werden.",
	"assets/variables.json.CMAKE_GNUtoMS": "Konvertieren Sie GNU-Importbibliotheken (.dll.a) in das MS-Format (.lib).",
	"assets/variables.json.CMAKE_HIP_ARCHITECTURES": "Eine Liste der GPU-Architekturen, für die ein Gerätecode generiert werden soll. Architekturnamen werden auf der Grundlage von CMAKE_HIP_PLATFORM interpretiert.",
	"assets/variables.json.CMAKE_HIP_COMPILE_FEATURES": "Liste mit Features, die dem HIP-Compiler bekannt sind",
	"assets/variables.json.CMAKE_HIP_EXTENSIONS": "Standardwert für HIP_EXTENSIONS Zieleigenschaft, wenn beim Erstellen eines Ziels festgelegt.",
	"assets/variables.json.CMAKE_HIP_PLATFORM": "GPU-Plattform, für die HIP-Sprachquellen kompiliert werden sollen.",
	"assets/variables.json.CMAKE_HIP_STANDARD": "Standardwert für HIP_STANDARD Zieleigenschaft, wenn beim Erstellen eines Ziels festgelegt.",
	"assets/variables.json.CMAKE_HIP_STANDARD_REQUIRED": "Standardwert für HIP_STANDARD_REQUIRED Zieleigenschaft, wenn beim Erstellen eines Ziels festgelegt.",
	"assets/variables.json.CMAKE_HOME_DIRECTORY": "Der Pfad zur obersten Ebene der Quellstruktur. Identisch mit CMAKE_SOURCE_DIR.",
	"assets/variables.json.CMAKE_HOST_APPLE": "Bei macOS-Betriebssystemen von Apple auf \"true\" gesetzt.",
	"assets/variables.json.CMAKE_HOST_BSD": "Wird auf einen Zeichenfolgenwert festgelegt, wenn das Hostsystem BSD ist. Dieser Wert kann einer der folgenden sein: DragonFlyBSD, FreeBSD, OpenBSD oder NetBSD.",
	"assets/variables.json.CMAKE_HOST_LINUX": "Wird auf WAHR festgelegt, wenn das Hostsystem Linux ist.",
	"assets/variables.json.CMAKE_HOST_SOLARIS": "Bei Oracle Solaris-Betriebssystemen auf \"true\" gesetzt.",
	"assets/variables.json.CMAKE_HOST_SYSTEM": "Zusammengesetzter Name des Betriebssystems, unter dem CMake ausgeführt wird.",
	"assets/variables.json.CMAKE_HOST_SYSTEM_NAME": "Name des Betriebssystems, unter dem CMake ausgeführt wird.",
	"assets/variables.json.CMAKE_HOST_SYSTEM_PROCESSOR": "Name der CPU, unter der CMake ausgeführt wird.",
	"assets/variables.json.CMAKE_HOST_SYSTEM_VERSION": "Die Betriebssystemversion, unter der CMake ausgeführt wird.",
	"assets/variables.json.CMAKE_HOST_UNIX": "Bei UNIX-Betriebssystemen und UNIX-ähnlichen Betriebssystemen auf \"true\" gesetzt.",
	"assets/variables.json.CMAKE_HOST_WIN32": "\"True\", wenn das Hostsystem unter Windows ausgeführt wird (einschließlich Windows 64-Bit und MSYS).",
	"assets/variables.json.CMAKE_IGNORE_PATH": "Semikolon-getrennte Liste von Verzeichnissen, die von den verschiedenen find...()-Befehlen ignoriert werden sollen.",
	"assets/variables.json.CMAKE_IGNORE_PREFIX_PATH": "Semikolon-getrennte Liste von Suchpräfixen, die von den Befehlen find_program, find_library, find_file und find_path ignoriert werden sollen. Die Präfixe werden auch vom Konfigurationsmodus des Befehls find_package ignoriert (der Modulmodus ist davon nicht betroffen). Um stattdessen bestimmte Verzeichnisse zu ignorieren, siehe CMAKE_IGNORE_NONPREFIX_VAR.",
	"assets/variables.json.CMAKE_IMPORT_LIBRARY_PREFIX": "Das Präfix für Importbibliotheken, zu denen Sie eine Verknüpfung herstellen.",
	"assets/variables.json.CMAKE_IMPORT_LIBRARY_SUFFIX": "Das Suffix für Importbibliotheken, zu denen Sie eine Verknüpfung herstellen.",
	"assets/variables.json.CMAKE_INCLUDE_CURRENT_DIR": "Fügen Sie automatisch die aktuelle Quelle hinzu, und erstellen Sie Verzeichnisse für den Include-Pfad.",
	"assets/variables.json.CMAKE_INCLUDE_CURRENT_DIR_IN_INTERFACE": "Fügen Sie automatisch die aktuelle Quelle hinzu, und erstellen Sie Verzeichnisse für die Zieleigenschaft INTERFACE_INCLUDE_DIRECTORIES.",
	"assets/variables.json.CMAKE_INCLUDE_DIRECTORIES_BEFORE": "Gibt an, ob Verzeichnisse bei \"include_directories\" standardmäßig am Anfang oder Ende hinzugefügt werden.",
	"assets/variables.json.CMAKE_INCLUDE_DIRECTORIES_PROJECT_BEFORE": "Legt fest, ob bei Projekt-Include-Verzeichnissen das Hinzufügen am Anfang erzwungen wird.",
	"assets/variables.json.CMAKE_INCLUDE_PATH": "Eine mittels Semikolon getrennte Liste mit Verzeichnissen unter Angabe eines Suchpfads für die Befehle „find_file“ und „commands“. Die Liste ist standardmäßig leer und vom Projekt festzulegen.",
	"assets/variables.json.CMAKE_INSTALL_DEFAULT_COMPONENT_NAME": "Die in \"install commands\" verwendete Standardkomponente.",
	"assets/variables.json.CMAKE_INSTALL_DEFAULT_DIRECTORY_PERMISSIONS": "Standardberechtigungen für Verzeichnisse, die implizit während der Installation von Dateien durch \"install\" und \"file\" erstellt werden.",
	"assets/variables.json.CMAKE_INSTALL_MESSAGE": "Legen Sie die Ausführlichkeit des durch den Befehl \"install\" (über den Befehl \"file\") generierten Installationsskriptcodes fest. Bei neu installierten oder aktualisierten Pfaden erfolgen bei der Installation möglicherweise die folgenden Zeilen:",
	"assets/variables.json.CMAKE_INSTALL_NAME_DIR": "Verzeichnisname für installierte Ziele auf Apple-Plattformen.",
	"assets/variables.json.CMAKE_INSTALL_PREFIX": "Das von \"install\" verwendete Installationsverzeichnis.",
	"assets/variables.json.CMAKE_INSTALL_PREFIX_INITIALIZED_TO_DEFAULT": "CMake legt diese Variable auf einen WAHR-Wert fest, wenn das CMAKE_INSTALL_PREFIX gerade auf seinen Standardwert initialisiert wurde, in der Regel bei der ersten Ausführung von CMake in einer neuen Buildstruktur und, wenn die CMAKE_INSTALL_PREFIX-Umgebungsvariable nicht bei der ersten Ausführung von CMake festgelegt ist. Dies kann vom Projektcode verwendet werden, um den Standardwert zu ändern, ohne einen vom Benutzer bereitgestellten Wert zu überschreiben:",
	"assets/variables.json.CMAKE_INSTALL_REMOVE_ENVIRONMENT_RPATH": "Hiermit wird festgelegt, ob über die Toolkette definierte rpath-Werte während der Installation entfernt werden sollen.",
	"assets/variables.json.CMAKE_INSTALL_RPATH": "Der rpath zur Verwendung für installierte Ziele.",
	"assets/variables.json.CMAKE_INSTALL_RPATH_USE_LINK_PATH": "Fügen Sie der Linkersuche und dem installierten rpath Pfade hinzu.",
	"assets/variables.json.CMAKE_INTERNAL_PLATFORM_ABI": "Eine interne Variable, die sich ändert.",
	"assets/variables.json.CMAKE_INTERPROCEDURAL_OPTIMIZATION": "Standardwert für INTERPROCEDURAL_OPTIMIZATION von Zielen.",
	"assets/variables.json.CMAKE_INTERPROCEDURAL_OPTIMIZATION_CONFIG": "Standardwert für INTERPROCEDURAL_OPTIMIZATION_ von Zielen.",
	"assets/variables.json.CMAKE_IOS_INSTALL_COMBINED": "Standardwert für IOS_INSTALL_COMBINED von Zielen.",
	"assets/variables.json.CMAKE_ISPC_HEADER_DIRECTORY": "Das von ISPC generierte Headerausgabeverzeichnis.",
	"assets/variables.json.CMAKE_ISPC_HEADER_SUFFIX": "Das zu verwendende Ausgabesuffix für Header, die von ISPC generiert werden.",
	"assets/variables.json.CMAKE_ISPC_INSTRUCTION_SETS": "Der Standardwert der Eigenschaft ISPC_INSTRUCTION_SETS von Zielen.",
	"assets/variables.json.CMAKE_JOB_POOLS": "Ist die globale Eigenschaft JOB_POOLS nicht festgelegt, wird stattdessen der Wert dieser Variable verwendet. Siehe JOB_POOLS, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_JOB_POOL_COMPILE": "Diese Variable wird verwendet, um die Eigenschaft JOB_POOL_COMPILE auf allen Zielen zu initialisieren. Siehe JOB_POOL_COMPILE, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_JOB_POOL_LINK": "Diese Variable wird verwendet, um die Eigenschaft JOB_POOL_LINK auf allen Zielen zu initialisieren. Siehe JOB_POOL_LINK, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_JOB_POOL_PRECOMPILE_HEADER": "Diese Variable wird verwendet, um die Eigenschaft JOB_POOL_PRECOMPILE_HEADER für alle Ziele zu initialisieren. Weitere Informationen finden Sie unter JOB_POOL_PRECOMPILE_HEADER.",
	"assets/variables.json.CMAKE_KATE_FILES_MODE": "Diese Cachevariable wird vom Kate-Projektgenerator verwendet und steuert, in welchem Modus der Dateieintrag in der Projektdatei festgelegt wird. Siehe „cmake-generators“.",
	"assets/variables.json.CMAKE_KATE_MAKE_ARGUMENTS": "Diese Cachevariable wird vom Kate-Projektgenerator verwendet. Siehe „cmake-generators“.",
	"assets/variables.json.CMAKE_LANG_ANDROID_TOOLCHAIN_MACHINE": "Bei der Crosskompilierung für Android enthält diese Variable den Namen des Computers (z. B. \"gcc -dumpmachine\"), auf dem sich die Toolketten-Binutils befinden. Der Name der Binutils enthält i .d. R. ein <machine>-Präfix.",
	"assets/variables.json.CMAKE_LANG_ANDROID_TOOLCHAIN_PREFIX": "Bei der Crosskompilierung für Android enthält diese Variable den absoluten Pfad als Präfix des Toolketten-GUP-Compilers und dessen Binutils.",
	"assets/variables.json.CMAKE_LANG_ANDROID_TOOLCHAIN_SUFFIX": "Bei der Crosskompilierung für Android enthält diese Variable das Hostplattformsuffix des Toolketten-GNU-Compilers und dessen Binutils.",
	"assets/variables.json.CMAKE_LANG_ARCHIVE_APPEND": "Regelvariable, die einem statischen Archiv angefügt wird.",
	"assets/variables.json.CMAKE_LANG_ARCHIVE_CREATE": "Regelvariable zum Erstellen eines neuen statischen Archivs.",
	"assets/variables.json.CMAKE_LANG_ARCHIVE_FINISH": "Regelvariable zum Beenden eines bestehenden statischen Archivs.",
	"assets/variables.json.CMAKE_LANG_BYTE_ORDER": "Die Bytereihenfolge der Zielarchitektur für den <LANG>-Compiler, falls bekannt. Wenn diese definiert wird und nicht leer ist, werden folgende Werte unterstützt:",
	"assets/variables.json.CMAKE_LANG_CLANG_TIDY": "Der Standardwert der <LANG>_CLANG_TIDY-Eigenschaft des Ziels, wenn <LANG> C, CXX, OBJC oder OBJCXX ist.",
	"assets/variables.json.CMAKE_LANG_CLANG_TIDY_EXPORT_FIXES_DIR": "Der Standardwert der <LANG>_CLANG_TIDY_EXPORT_FIXES_DIR-Eigenschaft des Ziels, wenn <LANG> C, CXX, OBJC oder OBJCXX ist.",
	"assets/variables.json.CMAKE_LANG_COMPILER": "Der vollständige Pfad zum Compiler für LANG.",
	"assets/variables.json.CMAKE_LANG_COMPILER_ABI": "Eine interne Variable, die sich ändert.",
	"assets/variables.json.CMAKE_LANG_COMPILER_AR": "Ein Wrapper, der ar umgibt und für den Compiler die entsprechende --plugin-Option hinzufügt.",
	"assets/variables.json.CMAKE_LANG_COMPILER_ARCHITECTURE_ID": "Eine interne Variable, die sich ändert.",
	"assets/variables.json.CMAKE_LANG_COMPILER_EXTERNAL_TOOLCHAIN": "Die externe Toolkette zur Crosskompilierung (falls unterstützt).",
	"assets/variables.json.CMAKE_LANG_COMPILER_FRONTEND_VARIANT": "Identifikationszeichenfolge der Front-End-Variante des Compilers.",
	"assets/variables.json.CMAKE_LANG_COMPILER_ID": "Die Zeichenfolge zur Identifizierung des Compilers.",
	"assets/variables.json.CMAKE_LANG_COMPILER_LAUNCHER": "Der Standardwert der <LANG>_COMPILER_LAUNCHER-Eigenschaft des Ziels. Mit dieser Variablen wird die Eigenschaft für die einzelnen Ziele bei deren Erstellung initialisiert. Dies geschieht nur, wenn <LANG> einen der folgenden Werte aufweist: C, Fortran, HIP, ISPC, OBJC, OBJCXX oder CUDA.",
	"assets/variables.json.CMAKE_LANG_COMPILER_LINKER": "Der vollständige Pfad zum Linker für LANG.",
	"assets/variables.json.CMAKE_LANG_COMPILER_LINKER_FRONTEND_VARIANT": "Identifikationszeichenfolge der Linker-Front-End-Variante.",
	"assets/variables.json.CMAKE_LANG_COMPILER_LINKER_ID": "Linkeridentifikationszeichenfolge.",
	"assets/variables.json.CMAKE_LANG_COMPILER_LINKER_VERSION": "Linkerversionszeichenfolge.",
	"assets/variables.json.CMAKE_LANG_COMPILER_LOADED": "Als \"true\" definiert, wenn die Sprache aktiviert ist.",
	"assets/variables.json.CMAKE_LANG_COMPILER_PREDEFINES_COMMAND": "Befehl, der die Vordefinitionen des Compilers ausgibt.",
	"assets/variables.json.CMAKE_LANG_COMPILER_RANLIB": "Ein Wrapper, der ranlib umgibt und für den Compiler die entsprechende --plugin-Option hinzufügt.",
	"assets/variables.json.CMAKE_LANG_COMPILER_TARGET": "Das Ziel für die Crosskompilierung (falls unterstützt).",
	"assets/variables.json.CMAKE_LANG_COMPILER_VERSION": "Die Versionszeichenfolge des Compilers.",
	"assets/variables.json.CMAKE_LANG_COMPILER_VERSION_INTERNAL": "Eine interne Variable, die sich ändert.",
	"assets/variables.json.CMAKE_LANG_COMPILE_OBJECT": "Regelvariable zum Kompilieren einer einzelnen Objektdatei.",
	"assets/variables.json.CMAKE_LANG_CPPCHECK": "Standardwert der Zieleigenschaft <LANG>_CPPCHECK. Mit dieser Variable wird die Eigenschaft auf allen Zielen während des Erstellens initialisiert. Dies erfolgt nur, wenn <LANG> C oder CXX ist.",
	"assets/variables.json.CMAKE_LANG_CPPLINT": "Standardwert der Zieleigenschaft <LANG>_CPPLINT. Mit dieser Variable wird die Eigenschaft auf allen Zielen während des Erstellens initialisiert. Dies erfolgt nur, wenn <LANG> C oder CXX ist.",
	"assets/variables.json.CMAKE_LANG_CREATE_SHARED_LIBRARY": "Regelvariable zum Erstellen einer freigegebenen Bibliothek.",
	"assets/variables.json.CMAKE_LANG_CREATE_SHARED_MODULE": "Regelvariable zum Erstellen eines freigegebenen Moduls.",
	"assets/variables.json.CMAKE_LANG_CREATE_STATIC_LIBRARY": "Regelvariable zum Erstellen einer statischen Bibliothek.",
	"assets/variables.json.CMAKE_LANG_EXTENSIONS": "Die Variationen sind:",
	"assets/variables.json.CMAKE_LANG_EXTENSIONS_DEFAULT": "Standarderweiterungsmodus des Compilers. Wird als Standard für die Zieleigenschaft <LANG>_EXTENSIONS verwendet, wenn CMAKE_<LANG>_EXTENSIONS nicht festgelegt ist (siehe CMP0128).",
	"assets/variables.json.CMAKE_LANG_FLAGS": "Sprachspezifische Flags für die Sprache <LANG>, die bei der Erstellung für alle Konfigurationen verwendet werden. Diese Flags werden an alle Aufrufe des Compilers übergeben. Dies schließt Aufrufe ein, die das Kompilieren von Laufwerken steuern, und Aufrufe, die die Verknüpfung steuern.",
	"assets/variables.json.CMAKE_LANG_FLAGS_CONFIG": "Sprachspezifische Flags für die Sprache <LANG>, die bei der Erstellung für die <CONFIG>-Konfiguration verwendet werden. Diese Flags werden an alle Aufrufe des Compilers in der entsprechenden Konfiguration übergeben. Dies schließt Aufrufe ein, die das Kompilieren von Laufwerken steuern, und Aufrufe, die die Verknüpfung steuern.",
	"assets/variables.json.CMAKE_LANG_FLAGS_CONFIG_INIT": "Wert, mit dem der Cacheeintrag CMAKE_<LANG>FLAGS_ beim erstmaligen Konfigurieren eines Buildbaums für die Sprache <LANG> initialisiert wird. Diese Variable muss durch eine Toolkettendatei festgelegt werden. Je nach Umgebung und Zielplattform fügt CMake dem Wert am Anfang oder Ende Inhalte hinzu.",
	"assets/variables.json.CMAKE_LANG_FLAGS_DEBUG": "Diese Variable ist die Debug-Variante der Variable CMAKE_<LANG>_FLAGS_.",
	"assets/variables.json.CMAKE_LANG_FLAGS_DEBUG_INIT": "Diese Variable ist die Debug-Variante der Variable CMAKE_<LANG>_FLAGS_<CONFIG>_INIT.",
	"assets/variables.json.CMAKE_LANG_FLAGS_INIT": "Der Wert zum Initialisieren des CMAKE_<LANG>_FLAGS-Cacheeintrags, wenn eine Buildstruktur zum ersten Mal für die Sprache <LANG> konfiguriert wird. Diese Variable soll von einer Toolkettendatei festgelegt werden. CMake kann dem Wert basierend auf Umgebung und Zielplattform Inhalte voranstellen oder Inhalte anfügen. Beispielsweise werden die Inhalte einer xxxFLAGS-Umgebungsvariable dort vorangestellt, wo xxx Sprachen-spezifisch ist aber nicht identisch ist mit <LANG> (z. B. CXXFLAGS für CXX, FFLAGS für Fortran usw.). Dieser Wert ist ein Befehlszeilenzeichenfolgenfragment. Verschiedene Optionen sollten daher durch Leerzeichen getrennt und Optionen mit Leerzeichen in Anführungszeichen gesetzt werden.",
	"assets/variables.json.CMAKE_LANG_FLAGS_MINSIZEREL": "Diese Variable ist die MinSizeRel-Variante der Variable CMAKE_<LANG>_FLAGS_.",
	"assets/variables.json.CMAKE_LANG_FLAGS_MINSIZEREL_INIT": "Diese Variable ist die MinSizeRel-Variante der Variable CMAKE_<LANG>_FLAGS_<CONFIG>_INIT.",
	"assets/variables.json.CMAKE_LANG_FLAGS_RELEASE": "Diese Variable ist die Release-Variante der Variable CMAKE_<LANG>_FLAGS_.",
	"assets/variables.json.CMAKE_LANG_FLAGS_RELEASE_INIT": "Diese Variable ist die Release-Variante der Variable CMAKE_<LANG>_FLAGS_<CONFIG>_INIT.",
	"assets/variables.json.CMAKE_LANG_FLAGS_RELWITHDEBINFO": "Diese Variable ist die RelWithDebInfo-Variante der Variable CMAKE_<LANG>_FLAGS_.",
	"assets/variables.json.CMAKE_LANG_FLAGS_RELWITHDEBINFO_INIT": "Diese Variable ist die RelWithDebInfo-Variante der Variable CMAKE_<LANG>_FLAGS_<CONFIG>_INIT.",
	"assets/variables.json.CMAKE_LANG_HOST_COMPILER": "Diese Variable ist verfügbar, wenn <LANG> CUDA oder HIP ist.",
	"assets/variables.json.CMAKE_LANG_IGNORE_EXTENSIONS": "Dateierweiterungen, die vom Build ignoriert werden sollen.",
	"assets/variables.json.CMAKE_LANG_IMPLICIT_INCLUDE_DIRECTORIES": "Verzeichnisse, die vom Compiler implizit nach Headerdateien durchsucht werden.",
	"assets/variables.json.CMAKE_LANG_IMPLICIT_LINK_DIRECTORIES": "Impliziter Linker-Suchpfad, der für Sprache <LANG> erkannt wurde.",
	"assets/variables.json.CMAKE_LANG_IMPLICIT_LINK_FRAMEWORK_DIRECTORIES": "Impliziter Linker-Framework-Suchpfad, der für Sprache <LANG> erkannt wurde.",
	"assets/variables.json.CMAKE_LANG_IMPLICIT_LINK_LIBRARIES": "Implizite Verknüpfungsbibliotheken und Flags, die für Sprache <LANG> erkannt wurden.",
	"assets/variables.json.CMAKE_LANG_INCLUDE_WHAT_YOU_USE": "Standardwert der Zieleigenschaft <LANG>_INCLUDE_WHAT_YOU_USE. Mit dieser Variable wird die Eigenschaft auf allen Zielen während des Erstellens initialisiert. Dies erfolgt nur, wenn <LANG> C oder CXX ist.",
	"assets/variables.json.CMAKE_LANG_LIBRARY_ARCHITECTURE": "Der für <LANG> erkannte Verzeichnisname der Zielarchitekturbibliothek.",
	"assets/variables.json.CMAKE_LANG_LINKER_LAUNCHER": "Der Standardwert der Zieleigenschaft <LANG>_COMPILER_LAUNCHER. Mit dieser Variable wird die Eigenschaft auf allen Zielen während der Erstellung initialisiert. Dies erfolgt nur, wenn <LANG> C, CXX, OBJC oder OBJCXX entspricht.",
	"assets/variables.json.CMAKE_LANG_LINKER_PREFERENCE": "Eine interne Variable, die sich ändert.",
	"assets/variables.json.CMAKE_LANG_LINKER_PREFERENCE_PROPAGATES": "Eine interne Variable, die sich ändert.",
	"assets/variables.json.CMAKE_LANG_LINKER_WRAPPER_FLAG": "Definiert die Syntax der Compilertreiberoption so, dass Optionen an das Linkertool übergeben werden, und übersetzt das Präfix \"LINKER:\" in den Verknüpfungsoptionen (siehe \"add_link_options\" und \"target_link_options\").",
	"assets/variables.json.CMAKE_LANG_LINKER_WRAPPER_FLAG_SEP": "Diese Variable wird mit der Variable CMAKE_<LANG>_LINKER_WRAPPER_FLAG verwendet, um das Präfix \"LINKER:\" in den Verknüpfungsoptionen zu formatieren (siehe \"add_link_options\" und \"target_link_options\").",
	"assets/variables.json.CMAKE_LANG_LINK_EXECUTABLE": "Regelvariable zum Verknüpfen einer ausführbaren Datei.",
	"assets/variables.json.CMAKE_LANG_LINK_GROUP_USING_FEATURE": "Diese Variable definiert, wie eine Gruppe von Bibliotheken für das angegebene <FEATURE> verknüpft werden, wenn ein LINK_GROUP-Generatorausdruck verwendet wird und die Linksprache für das Ziel <LANG> ist. Damit diese Variable Auswirkungen hat, muss die zugeordnete Variable CMAKE_<LANG>_LINK_GROUP_USING_<FEATURE>_SUPPORTED auf WAHR festgelegt sein.",
	"assets/variables.json.CMAKE_LANG_LINK_GROUP_USING_FEATURE_SUPPORTED": "Diese Variable gibt an, ob das <FEATURE> für die Linksprache <LANG> unterstützt wird. Wenn diese Variable WAHR ist, dann muss das <FEATURE> durch CMAKE_<LANG>_LINK_GROUP_USING_ definiert werden, und die generischeren Variablen CMAKE_LINK_GROUP_USING_<FEATURE>_SUPPORTED und CMAKE_LINK_GROUP_USING_ werden nicht verwendet.",
	"assets/variables.json.CMAKE_LANG_LINK_LIBRARY_FEATURE_ATTRIBUTES": "Diese Variable definiert die Semantik der angegebenen Linkbibliothek <FEATURE> beim Verknüpfen mit der Linksprache <LANG>. Sie hat Vorrang vor CMAKE_LINK_LIBRARY_<FEATURE>_ATTRIBUTES, wenn diese Variable auch für dasselbe <FEATURE> definiert ist, hat andernfalls aber ähnliche Auswirkungen. Weitere Informationen finden Sie unter CMAKE_LINK_LIBRARY_<FEATURE>_ATTRIBUTES.",
	"assets/variables.json.CMAKE_LANG_LINK_LIBRARY_FILE_FLAG": "Ein sprachenspezifisches Flag, mit dem eine Bibliothek verknüpft wird, die durch einen Pfad zur zugehörigen Datei angegeben ist.",
	"assets/variables.json.CMAKE_LANG_LINK_LIBRARY_FLAG": "Ein Flag, mit dem eine Bibliothek mit einer freigegebenen Bibliothek oder einer ausführbaren Datei verknüpft wird.",
	"assets/variables.json.CMAKE_LANG_LINK_LIBRARY_SUFFIX": "Ein sprachenspezifisches Suffix für Bibliotheken, mit denen Sie eine Verknüpfung erstellen.",
	"assets/variables.json.CMAKE_LANG_LINK_LIBRARY_USING_FEATURE": "Diese Variable definiert, wie eine Bibliothek oder ein Framework für das angegebene <FEATURE> verknüpft wird, wenn ein LINK_LIBRARY-Generatorausdruck verwendet wird und die Linksprache für das Ziel <LANG> ist. Damit diese Variable Auswirkungen hat, muss die zugeordnete Variable CMAKE_<LANG>_LINK_LIBRARY_USING_<FEATURE>_SUPPORTED auf WAHR festgelegt sein.",
	"assets/variables.json.CMAKE_LANG_LINK_LIBRARY_USING_FEATURE_SUPPORTED": "Auf WAHR festgelegt, wenn das <FEATURE>, wie von der Variable CMAKE_<LANG>_LINK_LIBRARY_USING_, für die Linkersprache <LANG> unterstützt wird.",
	"assets/variables.json.CMAKE_LANG_LINK_WHAT_YOU_USE_FLAG": "Linkerflag, das zum Konfigurieren des Linkers verwendet werden soll, sodass alle angegebenen Bibliotheken in der Befehlszeile mit dem Ziel verknüpft werden.",
	"assets/variables.json.CMAKE_LANG_OUTPUT_EXTENSION": "Erweiterung für die Ausgabe der Kompilierung einer einzelnen Datei.",
	"assets/variables.json.CMAKE_LANG_PLATFORM_ID": "Eine interne Variable, die sich ändert.",
	"assets/variables.json.CMAKE_LANG_SIMULATE_ID": "Identifikationszeichenfolge des \"simulierten\" Compilers.",
	"assets/variables.json.CMAKE_LANG_SIMULATE_VERSION": "Versionszeichenfolge eines \"simulierten\" Compilers.",
	"assets/variables.json.CMAKE_LANG_SIZEOF_DATA_PTR": "Größe der Zeiger-zu-Daten-Typen für Sprache <LANG>.",
	"assets/variables.json.CMAKE_LANG_SOURCE_FILE_EXTENSIONS": "Erweiterungen von Quelldateien für die gegebene Sprache.",
	"assets/variables.json.CMAKE_LANG_STANDARD": "Die Variationen sind:",
	"assets/variables.json.CMAKE_LANG_STANDARD_DEFAULT": "Der Standardstandard des Compilers für die Sprache <LANG>. Leer, wenn der Compiler keine Standardebenen aufweist.",
	"assets/variables.json.CMAKE_LANG_STANDARD_INCLUDE_DIRECTORIES": "Schließen Sie Verzeichnisse ein, die für alle mit dem Compiler <LANG> kompilierten Quelldateien verwendet werden. Dies ist für die Spezifikation von Includeverzeichnissen des Systems vorgesehen, die von der Sprache der aktuellen Plattform benötigt werden. Die Verzeichnisse erscheinen immer am Ende des an den Compiler übergebenen Include-Pfads.",
	"assets/variables.json.CMAKE_LANG_STANDARD_LATEST": "Diese Variable stellt das Minimum zwischen der neuesten Version des Standards für die Sprache <LANG> dar, die vom aktuellen Compiler unterstützt wird, und der aktuellen Version, die von CMake unterstützt wird. Der Wert wird auf einen der unterstützten Werte der entsprechenden <LANG>_STANDARD-Zieleigenschaft festgelegt. Eine Liste der unterstützten Sprachen finden Sie in der Dokumentation zu dieser Eigenschaft.",
	"assets/variables.json.CMAKE_LANG_STANDARD_LIBRARIES": "Bibliotheken, die in alle ausführbaren und freigegebenen Bibliotheken eingebunden sind, die für Sprache <LANG> verknüpft sind. Dies ist für die Spezifikation von Systembibliotheken gedacht, die von der Sprache für die aktuelle Plattform benötigt werden.",
	"assets/variables.json.CMAKE_LANG_STANDARD_REQUIRED": "Die Variationen sind:",
	"assets/variables.json.CMAKE_LANG_USING_LINKER_MODE": "Hiermit wird gesteuert, wie der Wert der variablen CMAKE_<LANG>_USING_LINKER_ interpretiert werden soll. Die unterstützten Linkermoduswerte sind:",
	"assets/variables.json.CMAKE_LANG_USING_LINKER_TYPE": "Diese Variable definiert, wie der <TYPE> Linker für den Linkschritt angegeben wird, der von der CMAKE_LINKER_TYPE Variablen oder der LINKER_TYPE Zieleigenschaft gesteuert wird. Abhängig vom Wert der variablen CMAKE_<LANG>_USING_LINKER_MODE kann CMAKE_<LANG>_USING_LINKER_<TYPE> Compilerflags für den Linkschritt oder Flags enthalten, die direkt an das Linkertool übergeben werden sollen.",
	"assets/variables.json.CMAKE_LANG_VISIBILITY_PRESET": "Standardwert der Zieleigenschaft <LANG>_VISIBILITY_PRESET, wenn ein Ziel erstellt wird.",
	"assets/variables.json.CMAKE_LIBRARY_ARCHITECTURE": "Der Verzeichnisname der Zielarchitekturbibliothek.",
	"assets/variables.json.CMAKE_LIBRARY_ARCHITECTURE_REGEX": "RegEx gleicht mögliche Verzeichnisnamen der Zielarchitekturbibliothek ab.",
	"assets/variables.json.CMAKE_LIBRARY_OUTPUT_DIRECTORY": "Gibt an, wo die LIBRARY-Zieldateien beim Erstellen abgelegt werden.",
	"assets/variables.json.CMAKE_LIBRARY_OUTPUT_DIRECTORY_CONFIG": "Gibt an, wo alle LIBRARY-Zieldateien nach der Erstellung für eine bestimmte Konfiguration abgelegt werden.",
	"assets/variables.json.CMAKE_LIBRARY_PATH": "Eine mittels Semikolon getrennte Liste mit Verzeichnissen unter Angabe eines Suchpfads für den Befehl „find_library“. Die Liste ist standardmäßig leer und vom Projekt festzulegen.",
	"assets/variables.json.CMAKE_LIBRARY_PATH_FLAG": "Das Flag, mit dem ein Bibliotheksuchpfad einem Compiler hinzugefügt wird.",
	"assets/variables.json.CMAKE_LINKER_TYPE": "Geben Sie an, welcher Linker für den Linkschritt verwendet werden soll.",
	"assets/variables.json.CMAKE_LINK_DEF_FILE_FLAG": "Ein Linker-Flag, mit dem eine .def-Datei zur DLL-Erstellung angegeben wird.",
	"assets/variables.json.CMAKE_LINK_DEPENDS_NO_SHARED": "Gibt an, ob Verknüpfungsabhängigkeiten zu Dateien freigegebener Bibliotheken übersprungen werden.",
	"assets/variables.json.CMAKE_LINK_DEPENDS_USE_LINKER": "Für die Makefile- und Ninja-Generatoren werden die Linkabhängigkeiten nun für eine Auswahl von Linkern vom Linker selbst erzeugt. Indem Sie diese Variable mit dem Wert FALSE definieren, können Sie diese Funktion deaktivieren.",
	"assets/variables.json.CMAKE_LINK_DIRECTORIES_BEFORE": "Gibt an, ob Verzeichnisse in \"include_directories\" am Anfang oder Ende hinzugefügt werden.",
	"assets/variables.json.CMAKE_LINK_GROUP_USING_FEATURE": "Diese Variable definiert, wie eine Gruppe von Bibliotheken für das angegebene <FEATURE> verknüpft wird, wenn ein LINK_GROUP-Generatorausdruck verwendet wird. Beide der folgenden Bedingungen müssen erfüllt sein, damit diese Variable Auswirkungen hat:",
	"assets/variables.json.CMAKE_LINK_GROUP_USING_FEATURE_SUPPORTED": "Diese Variable gibt an, ob das <FEATURE> unabhängig von der Linksprache unterstützt wird. Wenn diese Variable WAHR ist, dann muss das <FEATURE> durch CMAKE_LINK_GROUP_USING_ definiert werden.",
	"assets/variables.json.CMAKE_LINK_INTERFACE_LIBRARIES": "Standardwert für LINK_INTERFACE_LIBRARIES von Zielen.",
	"assets/variables.json.CMAKE_LINK_LIBRARIES_ONLY_TARGETS": "Legen Sie diese Variable fest, um die Eigenschaft LINK_LIBRARIES_ONLY_TARGETS von nicht importierten Zielen zu initialisieren, wenn sie erstellt werden. Das Setzen auf „true“ ermöglicht eine zusätzliche Überprüfung, ob alle von target_link_libraries benannten Elemente, die Zielnamen sein können, tatsächlich Namen vorhandener Ziele sind. Einzelheiten finden Sie in der Zieleigenschaften-Dokumentation.",
	"assets/variables.json.CMAKE_LINK_LIBRARY_FEATURE_ATTRIBUTES": "Diese Variable definiert das Verhalten der angegebenen Linkbibliothek <FEATURE>. Gibt an, wie <FEATURE> mit anderen Features interagiert, wann <FEATURE> angewendet werden soll, und Aspekte, wie <FEATURE> behandelt werden soll, wenn CMake die letzte Linkerbefehlszeile zusammenfügt (z. B. Deduplizierung).",
	"assets/variables.json.CMAKE_LINK_LIBRARY_FILE_FLAG": "Flag, mit dem eine durch einen Pfad angegebene Bibliothek mit ihrer Datei verknüpft wird.",
	"assets/variables.json.CMAKE_LINK_LIBRARY_FLAG": "Flag, mit dem eine Bibliothek mit einer ausführbaren Datei verknüpft wird.",
	"assets/variables.json.CMAKE_LINK_LIBRARY_SUFFIX": "Das Suffix für Bibliotheken, zu denen Sie eine Verknüpfung erstellen.",
	"assets/variables.json.CMAKE_LINK_LIBRARY_USING_FEATURE": "Diese Variable definiert, wie eine Bibliothek oder ein Framework für das angegebene <FEATURE> verknüpft wird, wenn ein LINK_LIBRARY-Generatorausdruck verwendet wird. Beide der folgenden Bedingungen müssen erfüllt sein, damit diese Variable Auswirkungen hat:",
	"assets/variables.json.CMAKE_LINK_LIBRARY_USING_FEATURE_SUPPORTED": "Auf WAHR festgelegt, wenn das <FEATURE>, wie von der Variable CMAKE_LINK_LIBRARY_USING_ definiert, unabhängig von der Linkersprache unterstützt wird.",
	"assets/variables.json.CMAKE_LINK_SEARCH_END_STATIC": "Beenden Sie eine Verknüpfungszeile so, dass statische Systembibliotheken verwendet werden.",
	"assets/variables.json.CMAKE_LINK_SEARCH_START_STATIC": "Nehmen Sie an, dass der Linker standardmäßig nach statischen Bibliotheken sucht.",
	"assets/variables.json.CMAKE_LINK_WHAT_YOU_USE": "Standardwert der Zieleigenschaft LINK_WHAT_YOU_USE. Mit dieser Variable wird die Eigenschaft während des Erstellens auf allen Zielen initialisiert.",
	"assets/variables.json.CMAKE_LINK_WHAT_YOU_USE_CHECK": "Definiert den Befehl, der nach dem Linkschritt ausgeführt wird, um die Verwendung von Bibliotheken zu überprüfen. Diese Überprüfung ist derzeit nur auf ELF-Plattformen mit dem Wert ldd -u -r definiert.",
	"assets/variables.json.CMAKE_MACOSX_BUNDLE": "Standardwert für MACOSX_BUNDLE von Zielen.",
	"assets/variables.json.CMAKE_MACOSX_RPATH": "Gibt an, ob unter macOS und iOS rpaths verwendet werden soll.",
	"assets/variables.json.CMAKE_MAJOR_VERSION": "Die erste Versionsnummernkomponente der Variable CMAKE_VERSION.",
	"assets/variables.json.CMAKE_MAKE_PROGRAM": "Tool, mit dem das native Buildsystem gestartet werden kann. Der Wert ist möglicherweise der vollständige Pfad zur ausführbaren Datei oder nur der Toolname, wenn angenommen wird, dass er sich im PFAD befindet.",
	"assets/variables.json.CMAKE_MAP_IMPORTED_CONFIG_CONFIG": "Der Standardwert für MAP_IMPORTED_CONFIG_ von Zielen.",
	"assets/variables.json.CMAKE_MATCH_COUNT": "Die Anzahl der Übereinstimmungen mit dem letzten regulären Ausdruck.",
	"assets/variables.json.CMAKE_MATCH_n": "Erfassungsgruppe <n>, die mit dem letzten regulären Ausdruck abgeglichen wurde (Gruppen 0 bis 9). Gruppe 0 ist die gesamte Übereinstimmung. Die Gruppen 1 bis 9 sind Unterausdrücke, die von der ()-Syntax erfasst werden.",
	"assets/variables.json.CMAKE_MAXIMUM_RECURSION_DEPTH": "Die maximale Rekursionstiefe für CMake-Skripts. Diese Variable ist zur Festlegung mit -DCMAKE_MAXIMUM_RECURSION_DEPTH=<x> in der Befehlszeile oder zur Festlegung innerhalb von \"CMakeLists.txt\" durch Projekte vorgesehen, die eine große Rekursionstiefe erfordern. Projekte mit Festlegung dieser Variable sollten es dem Benutzer ermöglichen, die Variable zu überschreiben. Beispiel:",
	"assets/variables.json.CMAKE_MESSAGE_CONTEXT": "Bei einer Aktivierung über die Befehlszeilenoption „cmake --log-context“ oder die Variable CMAKE_MESSAGE_CONTEXT_SHOW konvertiert der Befehl „message“ die CMAKE_MESSAGE_CONTEXT-Liste in eine durch Punkte getrennte und von eckigen Klammern umschlossene Zeichenfolge und stellt sie jeder Zeile für Meldungen der Protokollierungsstufen NOTICE und darunter voran.",
	"assets/variables.json.CMAKE_MESSAGE_CONTEXT_SHOW": "Wenn diese Variable auf TRUE festgelegt wird, kann für jede durch den message-Befehl protokollierte Zeile ein Kontext angezeigt werden (Informationen zum Angeben des Kontexts selbst finden Sie unter CMAKE_MESSAGE_CONTEXT).",
	"assets/variables.json.CMAKE_MESSAGE_INDENT": "Der Befehl \"message\" verknüpft die Zeichenfolgen aus dieser Liste und stellt für die Protokollebenen NOTICE und darunter die resultierende Zeichenfolge jeder Zeile der Meldung voran.",
	"assets/variables.json.CMAKE_MESSAGE_LOG_LEVEL": "Sofern festgelegt, gibt diese Variable den vom Befehl „message“ verwendeten Protokolliergrad an. Gültige Werte sind die gleichen wie die für die Befehlszeilenoption „--log-level <cmake --log-level>“ des Programms cmake. Wenn diese Variable festgelegt und die Befehlszeilenoption „--log-level <cmake --log-level>“ angegeben ist, hat die Befehlszeilenoption Vorrang.",
	"assets/variables.json.CMAKE_MFC_FLAG": "Hiermit wird die Verwendung der MFC-Bibliothek für eine ausführbare Datei oder DLL gesteuert.",
	"assets/variables.json.CMAKE_MINIMUM_REQUIRED_VERSION": "Die <min>Version von CMake, die dem letzten Aufruf des Befehls cmake_minimum_required im aktuellen Variablenbereich oder einem übergeordneten Variablenbereich zugewiesen wurde.",
	"assets/variables.json.CMAKE_MINOR_VERSION": "Die zweite Versionsnummernkomponente der Variable CMAKE_VERSION.",
	"assets/variables.json.CMAKE_MODULE_LINKER_FLAGS": "Linkerflags zum Erstellen von Modulen.",
	"assets/variables.json.CMAKE_MODULE_LINKER_FLAGS_CONFIG": "Flags, die beim Verknüpfen eines Moduls verwendet werden.",
	"assets/variables.json.CMAKE_MODULE_LINKER_FLAGS_CONFIG_INIT": "Wert, mit dem der Cacheeintrag CMAKE_MODULE_LINKER_FLAGS_ beim erstmaligen Konfigurieren eines Buildbaums initialisiert wird. Diese Variable muss durch eine Toolkettendatei festgelegt werden. Je nach Umgebung und Zielplattform fügt CMake dem Wert am Anfang oder Ende Inhalte hinzu.",
	"assets/variables.json.CMAKE_MODULE_LINKER_FLAGS_INIT": "Wert, mit dem der Cacheeintrag CMAKE_MODULE_LINKER_FLAGS beim erstmaligen Konfigurieren eines Buildbaums initialisiert wird. Diese Variable muss durch eine Toolkettendatei festgelegt werden. Je nach Umgebung und Zielplattform fügt CMake dem Wert am Anfang oder Ende Inhalte hinzu.",
	"assets/variables.json.CMAKE_MODULE_PATH": "Eine mittels Semikolons getrennte Liste mit Verzeichnissen, dargestellt mit Schrägstrichen, unter Angabe eines Suchpfads für CMake-Module, die von den Befehlen „include“ und „find_package“ vor dem Überprüfen der standardmäßig in CMake enthaltenen Module geladen werden. Die Liste ist standardmäßig leer und vom Projekt festzulegen.",
	"assets/variables.json.CMAKE_MSVCIDE_RUN_PATH": "Zusätzliche PATH-Speicherorte, die beim Ausführen von \"add_custom_command\" oder \"add_custom_target\" unter Verwendung des Generators von Visual Studio 12 2013 (oder höher). Hierdurch wird das Ausführen von Befehlen und Verwenden von DLLs ermöglicht, die der IDE-Umgebung nicht bekannt sind.",
	"assets/variables.json.CMAKE_MSVC_DEBUG_INFORMATION_FORMAT": "Wählen Sie das Format der Debuggen-Informationen für das Ziel MSVC-ABI aus. Mit dieser Variablen wird die Eigenschaft MSVC_DEBUG_INFORMATION_FORMAT für alle Ziele bei deren Erstellung initialisiert. Sie wird auch durch Aufrufe des Befehls „try_compile“ im Testprojekt weitergegeben.",
	"assets/variables.json.CMAKE_MSVC_RUNTIME_LIBRARY": "Hiermit wird die MSVC-Laufzeitbibliothek für Compiler ausgewählt, die MSVC ABI als Ziel verwenden. Mit dieser Variablen wird die MSVC_RUNTIME_LIBRARY-Eigenschaft für alle Ziele bei deren Erstellung initialisiert. Sie wird auch durch Aufrufe des Befehls \"try_compile\" im Testprojekt weitergegeben.",
	"assets/variables.json.CMAKE_NETRC": "Diese Variable wird verwendet, um die NETRC-Option für die Datei- und Dateibefehle zu initialisieren. Weitere Informationen finden Sie in \"Diese Befehle\".",
	"assets/variables.json.CMAKE_NETRC_FILE": "Diese Variable wird verwendet, um die NETRC_FILE Option für die Datei- und Dateibefehle zu initialisieren. Weitere Informationen finden Sie in \"Diese Befehle\".",
	"assets/variables.json.CMAKE_NINJA_OUTPUT_PATH_PREFIX": "Weisen Sie die Ninja-Generatoren an, jedem Ausgabepfad in build.ninja ein Präfix hinzuzufügen. An das Präfix wird ein nachgestellter Schrägstrich angefügt, falls er fehlt.",
	"assets/variables.json.CMAKE_NOT_USING_CONFIG_FLAGS": "Falls \"true\", werden _BUILD_TYPE-Flags übersprungen.",
	"assets/variables.json.CMAKE_NO_BUILTIN_CHRPATH": "Verwenden Sie nicht den integrierten binären Editor, um Suchpfade der Laufzeitbibliothek bei der Installation zu korrigieren.",
	"assets/variables.json.CMAKE_NO_SYSTEM_FROM_IMPORTED": "Der Standardwert für NO_SYSTEM_FROM_IMPORTED von Zielen.",
	"assets/variables.json.CMAKE_OBJCXX_EXTENSIONS": "Standardwert für OBJCXX_EXTENSIONS Zieleigenschaft, wenn beim Erstellen eines Ziels festgelegt.",
	"assets/variables.json.CMAKE_OBJCXX_STANDARD": "Standardwert für OBJCXX_STANDARD Zieleigenschaft, wenn beim Erstellen eines Ziels festgelegt.",
	"assets/variables.json.CMAKE_OBJCXX_STANDARD_REQUIRED": "Standardwert für OBJCXX_STANDARD_REQUIRED Zieleigenschaft, wenn beim Erstellen eines Ziels festgelegt.",
	"assets/variables.json.CMAKE_OBJC_EXTENSIONS": "Standardwert für OBJC_EXTENSIONS Zieleigenschaft, wenn beim Erstellen eines Ziels festgelegt.",
	"assets/variables.json.CMAKE_OBJC_STANDARD": "Standardwert für OBJC_STANDARD Zieleigenschaft, wenn beim Erstellen eines Ziels festgelegt.",
	"assets/variables.json.CMAKE_OBJC_STANDARD_REQUIRED": "Standardwert für OBJC_STANDARD_REQUIRED Zieleigenschaft, wenn beim Erstellen eines Ziels festgelegt.",
	"assets/variables.json.CMAKE_OBJECT_PATH_MAX": "Maximale Länge des vollständigen Objektdateipfads, die von nativ erstellten Tools zugelassen wird.",
	"assets/variables.json.CMAKE_OPTIMIZE_DEPENDENCIES": "Initialisiert die OPTIMIZE_DEPENDENCIES-Eigenschaft des Ziels.",
	"assets/variables.json.CMAKE_OSX_ARCHITECTURES": "Zielspezifische Architekturen für macOS und iOS.",
	"assets/variables.json.CMAKE_OSX_DEPLOYMENT_TARGET": "Geben Sie die Mindestversion der Zielplattform (z. B. macOS oder iOS) an, auf der die Zielbinärdateien bereitgestellt werden. CMake verwendet diesen Variablenwert für das Flag -mmacosx-version-min oder die entsprechenden Zielplattformentsprechungen. Bei älteren Xcode-Versionen mit mehreren macOS-SDKs erleichtert diese Variable auch die Auswahl des SDK, falls CMAKE_OSX_SYSROOT nicht gesetzt ist.",
	"assets/variables.json.CMAKE_OSX_SYSROOT": "Geben Sie den Speicherort oder den Namen des zu verwendenden macOS-Plattform-SDK an. CMake verwendet diesen Wert, um den Wert des Flags -isysroot (oder entsprechend) zu berechnen und es den find_*-Befehlen zu ermöglichen, Dateien im SDK zu finden.",
	"assets/variables.json.CMAKE_PARENT_LIST_FILE": "Der vollständige Pfad der CMake-Datei, die das aktuelle Element enthielt.",
	"assets/variables.json.CMAKE_PATCH_VERSION": "Die dritte Versionsnummernkomponente der Variable CMAKE_VERSION.",
	"assets/variables.json.CMAKE_PCH_INSTANTIATE_TEMPLATES": "Mit dieser Variablen wird die PCH_INSTANTIATE_TEMPLATES-Eigenschaft für Ziele bei deren Erstellung initialisiert.",
	"assets/variables.json.CMAKE_PCH_WARN_INVALID": "Mit dieser Variablen wird die PCH_WARN_INVALID-Eigenschaft für Ziele bei deren Erstellung initialisiert.",
	"assets/variables.json.CMAKE_PDB_OUTPUT_DIRECTORY": "Ausgabeverzeichnis für MS-Debugsymbol-.pdb-Dateien, die vom Linker für die Ziele ausführbare Datei und freigegebene Bibliothek generiert werden.",
	"assets/variables.json.CMAKE_PDB_OUTPUT_DIRECTORY_CONFIG": "Ausgabeverzeichnis (pro Konfiguration) für MS-Debugsymbol-.pdb-Dateien, die vom Linker für die Ziele ausführbare Datei und freigegebene Bibliothek generiert werden.",
	"assets/variables.json.CMAKE_PLATFORM_NO_VERSIONED_SONAME": "Diese Variable wird verwendet, um global zu steuern, ob die Zieleigenschaften VERSION und SOVERSION für gemeinsam genutzte Bibliotheken verwendet werden sollen. Bei Festlegung auf „true“ ist das Hinzufügen von Versionsinformationen zu jedem gemeinsam genutzten Bibliotheksziel deaktiviert.",
	"assets/variables.json.CMAKE_POLICY_DEFAULT_CMPNNNN": "Standardwert für CMake-Richtlinien-CMP<NNNN> (falls nicht gesetzt).",
	"assets/variables.json.CMAKE_POLICY_WARNING_CMPNNNN": "Aktivieren oder deaktivieren Sie die Warnung explizit, wenn CMAke Policy CMP<NNNN> nicht explizit durch cmake_policy oder implizit durch cmake_minimum_required festgelegt wurde. Dies ist nur für Richtlinien sinnvoll, die nicht standardmäßig warnen:",
	"assets/variables.json.CMAKE_POSITION_INDEPENDENT_CODE": "Standardwert für POSITION_INDEPENDENT_CODE von Zielen.",
	"assets/variables.json.CMAKE_PREFIX_PATH": "Eine mittels Semikolon getrennte Liste mit Verzeichnissen unter Angabe von Installationspräfixen, die von den Befehlen \"find_package\", \"find_program\", \"find_library\", \"find_file\" und \"find_path\" durchsucht werden. Jeder Befehl fügt wie in der zugehörigen Dokumentation angegeben entsprechende Unterverzeichnisse (z. B. \"bin\", \"lib\" oder \"include\") hinzu.",
	"assets/variables.json.CMAKE_PROGRAM_PATH": "Eine mittels Semikolon getrennte Liste mit Verzeichnissen, die einen Suchpfads für den Befehl „find_program“ angeben. Die Liste ist standardmäßig leer und vom Projekt festzulegen.",
	"assets/variables.json.CMAKE_PROJECT_DESCRIPTION": "Die Beschreibung des Projekts der obersten Ebene.",
	"assets/variables.json.CMAKE_PROJECT_HOMEPAGE_URL": "Die URL der Homepage des Projekts der obersten Ebene.",
	"assets/variables.json.CMAKE_PROJECT_INCLUDE": "Eine CMake-Sprachdatei, die als letzter Schritt aller Projektbefehlsaufrufe eingeschlossen werden soll. Dies ist für das Injizieren von benutzerdefiniertem Code in Projektbuilds vorgesehen, ohne deren Quelle zu ändern. Eine ausführlichere Erläuterung der Dateien, die möglicherweise während eines Projektaufrufs enthalten sind, finden Sie unter „Code-Injektion“.",
	"assets/variables.json.CMAKE_PROJECT_INCLUDE_BEFORE": "Eine CMake-Sprachdatei, die als erster Schritt aller Projektbefehlsaufrufe eingeschlossen werden soll. Dies ist für das Injizieren von benutzerdefiniertem Code in Projektbuilds vorgesehen, ohne deren Quelle zu ändern. Eine ausführlichere Erläuterung der Dateien, die möglicherweise während eines Projektaufrufs enthalten sind, finden Sie unter „Code-Injektion“.",
	"assets/variables.json.CMAKE_PROJECT_NAME": "Der Name des Projekts der obersten Ebene.",
	"assets/variables.json.CMAKE_PROJECT_PROJECT-NAME_INCLUDE": "Eine CMake-Sprachdatei, die als letzter Schritt aller Projektbefehlsaufrufe eingeschlossen werden soll, die <PROJECT-NAME> als Projektnamen angeben. Dies ist für das Injizieren von benutzerdefiniertem Code in Projektbuilds vorgesehen, ohne deren Quelle zu ändern. Eine ausführlichere Erläuterung der Dateien, die möglicherweise während eines Projektaufrufs enthalten sind, finden Sie unter „Code-Injektion“.",
	"assets/variables.json.CMAKE_PROJECT_PROJECT-NAME_INCLUDE_BEFORE": "Eine CMake-Sprachdatei, die als erster Schritt aller Projektbefehlsaufrufe eingeschlossen werden soll, die <PROJECT-NAME> als Projektnamen angeben. Dies ist für das Injizieren von benutzerdefiniertem Code in Projektbuilds vorgesehen, ohne deren Quelle zu ändern. Eine ausführlichere Erläuterung der Dateien, die möglicherweise während eines Projektaufrufs enthalten sind, finden Sie unter „Code-Injektion“.",
	"assets/variables.json.CMAKE_PROJECT_TOP_LEVEL_INCLUDES": "Durch Semikolons getrennte Liste von CMake-Sprachdateien, die als Teil des ersten Projektaufrufs eingeschlossen werden sollen. Die Dateien werden unmittelbar nach dem Lesen der Toolkettendatei (sofern eine angegeben ist) und dem Festlegen von Plattformvariablen, aber vor der Aktivierung von Sprachen eingeschlossen. Daher werden sprachspezifische Variablen, z. B. CMAKE_<LANG>_COMPILER, möglicherweise nicht festgelegt. Eine ausführlichere Erläuterung der Dateien, die möglicherweise während eines Projektaufrufs enthalten sind, finden Sie unter „Code-Injektion“.",
	"assets/variables.json.CMAKE_PROJECT_VERSION": "Die Version des Projekts der obersten Ebene.",
	"assets/variables.json.CMAKE_PROJECT_VERSION_MAJOR": "Die Hauptversion des Projekts der obersten Ebene.",
	"assets/variables.json.CMAKE_PROJECT_VERSION_MINOR": "Die Nebenversion des Projekts der obersten Ebene.",
	"assets/variables.json.CMAKE_PROJECT_VERSION_PATCH": "Die Patchversion des Projekts der obersten Ebene.",
	"assets/variables.json.CMAKE_PROJECT_VERSION_TWEAK": "Die Optimierungsversion des Projekts der obersten Ebene.",
	"assets/variables.json.CMAKE_RANLIB": "Der Name des Randomisierungstools für statische Bibliotheken.",
	"assets/variables.json.CMAKE_REQUIRE_FIND_PACKAGE_PackageName": "Variable für find_package Aufruf ERFORDERLICH.",
	"assets/variables.json.CMAKE_ROOT": "Installationsverzeichnis zum Ausführen von cmake.",
	"assets/variables.json.CMAKE_RULE_MESSAGES": "Geben Sie an, ob für jede make-Regel eine Meldung gemeldet werden soll.",
	"assets/variables.json.CMAKE_RUNTIME_OUTPUT_DIRECTORY": "Gibt an, wo die RUNTIME-Zieldateien nach der Erstellung abgelegt werden.",
	"assets/variables.json.CMAKE_RUNTIME_OUTPUT_DIRECTORY_CONFIG": "Gibt an, wo alle RUNTIME-Zieldateien nach der Erstellung für eine bestimmte Konfiguration abgelegt werden.",
	"assets/variables.json.CMAKE_SCRIPT_MODE_FILE": "Der vollständige Pfad zur cmake -P-Skriptdatei, die gerade verarbeitet wird.",
	"assets/variables.json.CMAKE_SHARED_LIBRARY_ENABLE_EXPORTS": "Geben Sie an, ob die freigegebene Bibliothek eine Importdatei generiert.",
	"assets/variables.json.CMAKE_SHARED_LIBRARY_PREFIX": "Das Präfix für freigegebene Bibliotheken, zu denen Sie eine Verknüpfung herstellen.",
	"assets/variables.json.CMAKE_SHARED_LIBRARY_SUFFIX": "Das Suffix für freigegebene Bibliotheken, zu denen Sie eine Verknüpfung herstellen.",
	"assets/variables.json.CMAKE_SHARED_LINKER_FLAGS": "Linkerflags zum Erstellen freigegebener Bibliotheken.",
	"assets/variables.json.CMAKE_SHARED_LINKER_FLAGS_CONFIG": "Flags zum Verknüpfen einer freigegebenen Bibliothek.",
	"assets/variables.json.CMAKE_SHARED_LINKER_FLAGS_CONFIG_INIT": "Wert, mit dem der Cacheeintrag CMAKE_SHARED_LINKER_FLAGS_ beim erstmaligen Konfigurieren eines Buildbaums initialisiert wird. Diese Variable muss durch eine Toolkettendatei festgelegt werden. Je nach Umgebung und Zielplattform fügt CMake dem Wert am Anfang oder Ende Inhalte hinzu.",
	"assets/variables.json.CMAKE_SHARED_LINKER_FLAGS_INIT": "Wert, mit dem der Cacheeintrag CMAKE_SHARED_LINKER_FLAGS beim erstmaligen Konfigurieren eines Buildbaums initialisiert wird. Diese Variable muss durch eine Toolkettendatei festgelegt werden. Je nach Umgebung und Zielplattform fügt CMake dem Wert am Anfang oder Ende Inhalte hinzu.",
	"assets/variables.json.CMAKE_SHARED_MODULE_PREFIX": "Das Präfix für ladbare Module, zu denen Sie eine Verknüpfung herstellen.",
	"assets/variables.json.CMAKE_SHARED_MODULE_SUFFIX": "Das Suffix für freigegebene Bibliotheken, zu denen Sie eine Verknüpfung herstellen.",
	"assets/variables.json.CMAKE_SIZEOF_VOID_P": "Größe eines void-Zeigers.",
	"assets/variables.json.CMAKE_SKIP_BUILD_RPATH": "RPATHs nicht in den Buildbaum einschließen.",
	"assets/variables.json.CMAKE_SKIP_INSTALL_ALL_DEPENDENCY": "Heben Sie die Abhängigkeit des install-Ziels vom all-Ziel auf.",
	"assets/variables.json.CMAKE_SKIP_INSTALL_RPATH": "Schließen Sie RPATHs nicht in den Installationsbaum mit ein.",
	"assets/variables.json.CMAKE_SKIP_INSTALL_RULES": "Legt fest, ob das Generieren von Installationsregeln deaktiviert wird.",
	"assets/variables.json.CMAKE_SKIP_RPATH": "Bei \"true\" keine Laufzeitpfadinformationen hinzufügen.",
	"assets/variables.json.CMAKE_SKIP_TEST_ALL_DEPENDENCY": "Hiermit wird gesteuert, ob das Testziel vom gesamten Ziel abhängig ist.",
	"assets/variables.json.CMAKE_SOURCE_DIR": "Der Pfad zur obersten Ebene des Quellbaums.",
	"assets/variables.json.CMAKE_STAGING_PREFIX": "Diese Variable wird möglicherweise auf einen bei der Crosskompilierung zu installierenden Pfad gesetzt. Dies kann nützlich sein, wenn der Pfad in CMAKE_SYSROOT schreibgeschützt ist oder anderweitig nicht beeinflusst werden kann.",
	"assets/variables.json.CMAKE_STATIC_LIBRARY_PREFIX": "Das Präfix für statische Bibliotheken, zu denen Sie eine Verknüpfung herstellen.",
	"assets/variables.json.CMAKE_STATIC_LIBRARY_SUFFIX": "Das Suffix für statische Bibliotheken, zu denen Sie eine Verknüpfung herstellen.",
	"assets/variables.json.CMAKE_STATIC_LINKER_FLAGS": "Flags, die zum Erstellen statischer Bibliotheken verwendet werden sollen. Diese Flags werden beim Erstellen einer statischen Bibliothek an das Archivierungsprogramm übergeben.",
	"assets/variables.json.CMAKE_STATIC_LINKER_FLAGS_CONFIG": "Flags, die zum Erstellen statischer Bibliotheken verwendet werden sollen. Diese Flags werden beim Erstellen einer statischen Bibliothek in der <CONFIG>-Konfiguration an das Archivierungsprogramm übergeben.",
	"assets/variables.json.CMAKE_STATIC_LINKER_FLAGS_CONFIG_INIT": "Wert, mit dem der Cacheeintrag CMAKE_STATIC_LINKER_FLAGS_ beim erstmaligen Konfigurieren eines Buildbaums initialisiert wird. Diese Variable muss durch eine Toolkettendatei festgelegt werden. Je nach Umgebung und Zielplattform fügt CMake dem Wert am Anfang oder Ende Inhalte hinzu.",
	"assets/variables.json.CMAKE_STATIC_LINKER_FLAGS_INIT": "Wert, mit dem der Cacheeintrag CMAKE_STATIC_LINKER_FLAGS beim erstmaligen Konfigurieren eines Buildbaums initialisiert wird. Diese Variable muss durch eine Toolkettendatei festgelegt werden. Je nach Umgebung und Zielplattform fügt CMake dem Wert am Anfang oder Ende Inhalte hinzu.",
	"assets/variables.json.CMAKE_SUBLIME_TEXT_2_ENV_SETTINGS": "Diese Variable enthält eine Liste mit Umgebungsvariablen als Liste mit Token mit der Syntax \"var=value\".",
	"assets/variables.json.CMAKE_SUBLIME_TEXT_2_EXCLUDE_BUILD_TREE": "Wenn diese Variable am Ende der Datei \"CMakeLists.txt\" (oberste Ebene) ON ergibt, schließt der zusätzliche Generator Sublime Text 2 den Buildbaum aus \".sublime-project\" aus (falls innerhalb des Quellbaums).",
	"assets/variables.json.CMAKE_SUPPRESS_REGENERATION": "Ist CMAKE_SUPPRESS_REGENERATION auf OFF gesetzt, fügt CMake ein spezielles Ziel hinzu, von dem alle anderen Ziele abhängig sind. Dieses Ziel überprüft das Buildsystem und führt CMake optional erneut aus, um das Buildsystem bei einer Änderung der Zielspezifikation der Quelle erneut zu generieren.",
	"assets/variables.json.CMAKE_Swift_COMPILATION_MODE": "Geben Sie an, wie Swift ein Ziel kompiliert. Diese Variable wird verwendet, um die Swift_COMPILATION_MODE Eigenschaft für Ziele während der Erstellung zu initialisieren.",
	"assets/variables.json.CMAKE_Swift_LANGUAGE_VERSION": "Hiermit wird die Swift-Sprachversion festgelegt. Ohne Festlegung wird die älteste Legacyversion angenommen, die bekanntermaßen in der Xcode-Hostversion verfügbar ist:",
	"assets/variables.json.CMAKE_Swift_MODULE_DIRECTORY": "Hiermit wird das Swift-Modulausgabeverzeichnis angegeben.",
	"assets/variables.json.CMAKE_Swift_NUM_THREADS": "Die Anzahl von Threads für die parallele Kompilierung von Swift-Zielen.",
	"assets/variables.json.CMAKE_SYSROOT": "Pfad, der im --sysroot-Flag an den Compiler übergeben wird.",
	"assets/variables.json.CMAKE_SYSROOT_COMPILE": "Pfad, der bei der Kompilierung von Quelldateien im --sysroot-Flag an den Compiler übergeben wird. Dies entspricht CMAKE_SYSROOT, dient jedoch nur dem Kompilieren von Quellen und nicht dem Verknüpfen.",
	"assets/variables.json.CMAKE_SYSROOT_LINK": "Pfad, der beim Verknüpfen im --sysroot-Flag an den Compiler übergeben wird. Dies entspricht CMAKE_SYSROOT, dient jedoch nur dem Verknüpfen und nicht dem Kompilieren von Quellen.",
	"assets/variables.json.CMAKE_SYSTEM": "Zusammengesetzter Name des Betriebssystems, für das CMake kompiliert.",
	"assets/variables.json.CMAKE_SYSTEM_APPBUNDLE_PATH": "Suchpfad für macOS-Anwendungsbundles, der von den Befehlen \"find_program\" und \"find_package\" verwendet wird. Er enthält standardmäßig die Standardverzeichnisse des aktuellen Systems. Eine Modifizierung durch das Projekt ist nicht vorgesehen. Nutzen Sie hierfür CMAKE_APPBUNDLE_PATH.",
	"assets/variables.json.CMAKE_SYSTEM_FRAMEWORK_PATH": "Suchpfad für macOS-Frameworks, der von den Befehlen \"find_library\", \"find_package\", \"find_path\" und \"find_file\" verwendet wird. Er enthält standardmäßig die Standardverzeichnisse des aktuellen Systems. Eine Modifizierung durch das Projekt ist nicht vorgesehen. Nutzen Sie hierfür CMAKE_FRAMEWORK_PATH.",
	"assets/variables.json.CMAKE_SYSTEM_IGNORE_PATH": "Semikolon-getrennte Liste von Verzeichnissen, die von den verschiedenen find...()-Befehlen ignoriert werden sollen.",
	"assets/variables.json.CMAKE_SYSTEM_IGNORE_PREFIX_PATH": "Semikolon-getrennte Liste von Suchpräfixen, die von den Befehlen find_program, find_library, find_file und find_path ignoriert werden sollen. Die Präfixe werden auch vom Konfigurationsmodus des Befehls find_package ignoriert (der Modulmodus ist davon nicht betroffen). Um stattdessen bestimmte Verzeichnisse zu ignorieren, siehe CMAKE_IGNORE_NONPREFIX_VAR.",
	"assets/variables.json.CMAKE_SYSTEM_INCLUDE_PATH": "Eine mittels Semikolon getrennte Liste mit Verzeichnissen unter Angabe eines Suchpfads für die Befehle \"find_file\" und \"find_path\". Standardmäßig sind die Standardverzeichnisse des aktuellen Systems enthalten. Eine Modifizierung durch das Projekt ist nicht vorgesehen. Nutzen Sie hierfür CMAKE_INCLUDE_PATH. Siehe auch CMAKE_SYSTEM_PREFIX_PATH.",
	"assets/variables.json.CMAKE_SYSTEM_LIBRARY_PATH": "Eine mittels Semikolon getrennte Liste mit Verzeichnissen unter Angabe eines Suchpfads für den Befehl \"find_library\". Standardmäßig sind die Standardverzeichnisse des aktuellen Systems enthalten. Eine Modifizierung durch das Projekt ist nicht vorgesehen. Nutzen Sie hierfür CMAKE_LIBRARY_PATH. Siehe auch CMAKE_SYSTEM_PREFIX_PATH.",
	"assets/variables.json.CMAKE_SYSTEM_NAME": "Der Name des Betriebssystems, für das CMake Buildvorgänge durchführt. Siehe Variable CMAKE_SYSTEM_VERSION, um die Version des Betriebssystems zu erfahren.",
	"assets/variables.json.CMAKE_SYSTEM_PREFIX_PATH": "Eine mittels Semikolon getrennte Liste mit Verzeichnissen unter Angabe von Installationspräfixen, die von den Befehlen \"find_package\", \"find_program\", \"find_library\", \"find_file\" und \"find_path\" durchsucht werden. Jeder Befehl fügt wie in der zugehörigen Dokumentation angegeben entsprechende Unterverzeichnisse (z. B. \"bin\", \"lib\" oder \"include\") hinzu.",
	"assets/variables.json.CMAKE_SYSTEM_PROCESSOR": "Wenn keine Crosskompilierung ausgeführt wird, weist diese Variable den gleichen Wert wie die Variable CMAKE_HOST_SYSTEM_PROCESSOR auf. In vielen Fällen entspricht dies der Zielarchitektur für den Build, dies ist jedoch nicht unbedingt der Fall. (Unter Windows kann der Host beispielsweise auch dann AMD64 aufweisen, wenn ein MSVC-cl-Compiler mit einem 32-Bit-Ziel verwendet wird.)",
	"assets/variables.json.CMAKE_SYSTEM_PROGRAM_PATH": "Eine mittels Semikolon getrennte Liste mit Verzeichnissen unter Angabe eines Suchpfads für den Befehl \"find_program\". Standardmäßig sind die Standardverzeichnisse des aktuellen Systems enthalten. Eine Modifizierung durch das Projekt ist nicht vorgesehen. Nutzen Sie hierfür CMAKE_PROGRAM_PATH. Siehe auch CMAKE_SYSTEM_PREFIX_PATH.",
	"assets/variables.json.CMAKE_SYSTEM_VERSION": "Die Version des Betriebssystems, für das CMake Buildvorgänge durchführt. Siehe Variable CMAKE_SYSTEM_NAME, um die Version des Betriebssystems zu erfahren.",
	"assets/variables.json.CMAKE_TASKING_TOOLSET": "Wählen Sie das Aufgabentoolset aus, das den Compiler bereitstellt.",
	"assets/variables.json.CMAKE_TEST_LAUNCHER": "Diese Variable wird verwendet, um die TEST_LAUNCHER Zieleigenschaft ausführbarer Ziele beim Erstellen zu initialisieren. Hiermit wird ein Startprogramm zum Ausführen von Tests angegeben, das durch den Befehl \"add_test\" hinzugefügt wird und auf dem ein ausführbares Ziel ausgeführt wird.",
	"assets/variables.json.CMAKE_TLS_CAINFO": "Geben Sie den Standardwert für die TLS_CAINFO Optionen der Datei- und Dateibefehle an. Die Festlegung ist standardmäßig aufgehoben.",
	"assets/variables.json.CMAKE_TLS_VERIFY": "Geben Sie den Standardwert für die TLS_VERIFY Optionen für Datei-und Dateibefehle an. Wenn diese Variable nicht festgelegt ist, überprüfen die Befehle die Umgebungsvariable CMAKE_TLS_VERIFY. Wenn keines festgelegt ist, ist der Standardwert deaktiviert.",
	"assets/variables.json.CMAKE_TLS_VERSION": "Geben Sie den Standardwert für die TLS_VERSION Optionen für Datei-und Dateibefehle an. Wenn diese Variable nicht festgelegt ist, überprüfen die Befehle die Umgebungsvariable CMAKE_TLS_VERSION.",
	"assets/variables.json.CMAKE_TOOLCHAIN_FILE": "Der für cmake bereitgestellte Pfad zur Toolkettendatei.",
	"assets/variables.json.CMAKE_TRY_COMPILE_CONFIGURATION": "Buildkonfiguration für try_compile- und try_run-Projekte.",
	"assets/variables.json.CMAKE_TRY_COMPILE_NO_PLATFORM_VARIABLES": "Wird auf einen Wert WAHR festgelegt, um den Befehl „try_compile“ anzuweisen, keine Plattformvariablen an das Testprojekt zu verteilen.",
	"assets/variables.json.CMAKE_TRY_COMPILE_PLATFORM_VARIABLES": "Liste mit Variablen, die die Quelldateisignatur des Befehls \"try_compile\" im Testprojekt verteilen muss, um die gleiche Plattform wie beim Hostprojekt als Ziel anzugeben.",
	"assets/variables.json.CMAKE_TRY_COMPILE_TARGET_TYPE": "Zieltyp, der mittels Quelldateisignatur für try_compile-Aufrufe generiert wird. Gültige Werte sind:",
	"assets/variables.json.CMAKE_TWEAK_VERSION": "Auf \"0\" gesetzt, um eine Kompatibilität mit Code zu erzielen, der für ältere Versionen von CMake (mit möglicherweise höher definierten Werten) geschrieben wurde.",
	"assets/variables.json.CMAKE_UNITY_BUILD": "Mit dieser Variablen wird die UNITY_BUILD-Eigenschaft für Ziele bei deren Erstellung initialisiert. Durch eine Festlegung auf TRUE wird die Batchkompilierung mehrerer Quellen innerhalb jedes Ziels aktiviert. Dieses Feature wird als Unity- oder Jumbo-Build bezeichnet.",
	"assets/variables.json.CMAKE_UNITY_BUILD_BATCH_SIZE": "Mit dieser Variablen wird die UNITY_BUILD-Eigenschaft für Ziele bei deren Erstellung initialisiert. Sie gibt die standardmäßige Obergrenze für die Anzahl von Quelldateien an, die bei der Aktivierung von Unity-Builds für ein Ziel in einer einzigen Unity-Quelldatei kombiniert werden können.",
	"assets/variables.json.CMAKE_UNITY_BUILD_UNIQUE_ID": "Mit dieser Variablen wird die UNITY_BUILD_UNIQUE_ID-Eigenschaft für Ziele bei deren Erstellung initialisiert. Sie gibt den Namen des eindeutigen Bezeichners an, der für jede Datei in einem Unity-Build generiert wird.",
	"assets/variables.json.CMAKE_USER_MAKE_RULES_OVERRIDE": "Geben Sie eine CMake-Datei an, mit der die Plattforminformationen überschrieben werden.",
	"assets/variables.json.CMAKE_USER_MAKE_RULES_OVERRIDE_LANG": "Geben Sie eine CMake-Datei an, mit der die Plattforminformationen für <LANG> überschrieben werden.",
	"assets/variables.json.CMAKE_USE_RELATIVE_PATHS": "Diese Variable hat keine Auswirkungen. Die in früheren Versionen teilweise zu beobachtenden Auswirkungen wurden in CMake 3.4 entfernt.",
	"assets/variables.json.CMAKE_VERBOSE_MAKEFILE": "Aktivieren Sie die ausführliche Ausgabe von Makefile-Builds.",
	"assets/variables.json.CMAKE_VERIFY_INTERFACE_HEADER_SETS": "Diese Variable wird verwendet, um die VERIFY_INTERFACE_HEADER_SETS-Eigenschaft von Zielen zu initialisieren, wenn sie erstellt werden. Wenn sie auf WAHR festgelegt wird, wird die Überprüfung des Headersatzes aktiviert.",
	"assets/variables.json.CMAKE_VERSION": "Die CMake-Versionszeichenfolge in Form von drei nicht-negativen ganzzahligen Komponenten, getrennt durch \".\" und möglicherweise gefolgt von \"-\" und anderen Informationen. Die ersten beiden Komponenten repräsentieren die Featureebene, während die dritte Komponente entweder eine Fehlerkorrekturebene oder ein Entwicklungsdatum darstellt.",
	"assets/variables.json.CMAKE_VISIBILITY_INLINES_HIDDEN": "Standardwert der Zieleigenschaft VISIBILITY_INLINES_HIDDEN, wenn ein Ziel erstellt wird.",
	"assets/variables.json.CMAKE_VS_DEBUGGER_COMMAND": "Diese Variable wird verwendet, um die VS_DEBUGGER_COMMAND-Eigenschaft für jedes Ziel zu initialisieren, während sie erstellt wird. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_VS_DEBUGGER_COMMAND_ARGUMENTS": "Diese Variable wird verwendet, um die VS_DEBUGGER_COMMAND_ARGUMENTS-Eigenschaft für jedes Ziel zu initialisieren, während sie erstellt wird. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_VS_DEBUGGER_ENVIRONMENT": "Diese Variable wird verwendet, um die VS_DEBUGGER_ENVIRONMENT-Eigenschaft für jedes Ziel zu initialisieren, während sie erstellt wird. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_VS_DEBUGGER_WORKING_DIRECTORY": "Diese Variable wird verwendet, um die VS_DEBUGGER_WORKING_DIRECTORY-Eigenschaft für jedes Ziel zu initialisieren, während sie erstellt wird. Schlagen Sie unter dieser Zieleigenschaft nach, um weitere Informationen zu erhalten.",
	"assets/variables.json.CMAKE_VS_DEVENV_COMMAND": "Die Generatoren für Visual Studio 12 2013 und höher setzen diese Variable auf den Befehl \"devenv.com\", der mit der entsprechenden Version von Visual Studio installiert ist. Bei Editionen von Visual Studio Express ist diese Variable möglicherweise leer, weil dieses Tool nicht bereitgestellt wird.",
	"assets/variables.json.CMAKE_VS_GLOBALS": "Liste mit Key=Value-Datensätzen, die pro Ziel als Zieleigenschaften VS_GLOBAL_ mit \"variable=Key\" und dem Wert \"Value\" gesetzt werden.",
	"assets/variables.json.CMAKE_VS_INCLUDE_INSTALL_TO_DEFAULT_BUILD": "Schließen Sie das INSTALL-Ziel in den Standardbuild mit ein.",
	"assets/variables.json.CMAKE_VS_INCLUDE_PACKAGE_TO_DEFAULT_BUILD": "Schließen Sie das PACKAGE-Ziel in den Standardbuild mit ein.",
	"assets/variables.json.CMAKE_VS_INTEL_Fortran_PROJECT_VERSION": "Beim Generieren für Visual Studio 12 2013 oder höher mit installiertem Intel Fortran-Plug-In wird hierüber die Dateiformatversion des .vfproj-Projekts angegeben. Dies ist für die interne Verwendung durch CMake vorgesehen und darf nicht vom Projektcode verwendet werden.",
	"assets/variables.json.CMAKE_VS_JUST_MY_CODE_DEBUGGING": "Hiermit wird nur eigener Code mit dem Visual Studio-Debugger aktiviert.",
	"assets/variables.json.CMAKE_VS_MSBUILD_COMMAND": "Die Generatoren für Visual Studio 12 2013 und höher setzen diese Variable auf den Befehl „MSBuild.exe“, der mit der entsprechenden Version von Visual Studio installiert wird.",
	"assets/variables.json.CMAKE_VS_NO_COMPILE_BATCHING": "Deaktivieren Sie die Batchverarbeitung für das Kompilieren, wenn Sie Visual Studio-Generatoren verwenden.",
	"assets/variables.json.CMAKE_VS_NsightTegra_VERSION": "Wenn beim Verwenden eines Visual Studio-Generators die Variable CMAKE_SYSTEM_NAME auf Android festgelegt ist, enthält diese Variable die Versionsnummer der installierten NVIDIA Nsight Tegra Visual Studio Edition.",
	"assets/variables.json.CMAKE_VS_NUGET_PACKAGE_RESTORE": "Bei Verwendung eines Visual Studio-Generators steuert diese Cache-Variable, ob msbuild automatisch versuchen soll, NuGet-Pakete vor einem Build wiederherzustellen. NuGet-Pakete können mithilfe der VS_PACKAGE_REFERENCES-Eigenschaft auf einem Ziel definiert werden. Wenn keine Paketreferenzen definiert sind, hat diese Einstellung keine Auswirkung.",
	"assets/variables.json.CMAKE_VS_PLATFORM_NAME": "Der Name der Visual Studio-Zielplattform, die vom aktuellen Generator verwendet wird.",
	"assets/variables.json.CMAKE_VS_PLATFORM_NAME_DEFAULT": "Standardwert für den Namen der Visual Studio-Zielplattform, die vom aktuellen Generator verwendet wird. Der Wert der Variablen CMAKE_GENERATOR_PLATFORM wird nicht berücksichtigt. Für Visual Studio-Generatoren für VS 2017 und niedriger ist dies immer Win32. Für VS 2019 und höher basiert dieser Wert auf der Hostplattform.",
	"assets/variables.json.CMAKE_VS_PLATFORM_TOOLSET": "Name des Toolsets für Visual Studio.",
	"assets/variables.json.CMAKE_VS_PLATFORM_TOOLSET_CUDA": "Die Version des NVIDIA CUDA-Toolkits, deren Visual Studio-Toolset zu verwenden ist.",
	"assets/variables.json.CMAKE_VS_PLATFORM_TOOLSET_CUDA_CUSTOM_DIR": "Der Pfad zum eigenständigen NVIDIA CUDA-Toolkit (z. B. extrahiert aus dem Installer).",
	"assets/variables.json.CMAKE_VS_PLATFORM_TOOLSET_FORTRAN": "Der Fortrancompiler, der von Visual Studio Projekten verwendet werden soll.",
	"assets/variables.json.CMAKE_VS_PLATFORM_TOOLSET_HOST_ARCHITECTURE": "Die für Visual Studio bevorzugte Toolarchitektur.",
	"assets/variables.json.CMAKE_VS_PLATFORM_TOOLSET_VERSION": "Version des Toolsets für die Visual Studio-Plattform.",
	"assets/variables.json.CMAKE_VS_SDK_EXCLUDE_DIRECTORIES": "Diese Variable ermöglicht das Überschreiben von Exclude-Standardverzeichnissen von Visual Studio.",
	"assets/variables.json.CMAKE_VS_SDK_EXECUTABLE_DIRECTORIES": "Diese Variable ermöglicht das Überschreiben von Executable-Standardverzeichnissen von Visual Studio.",
	"assets/variables.json.CMAKE_VS_SDK_INCLUDE_DIRECTORIES": "Diese Variable ermöglicht Überschreiben von Include-Standardverzeichnissen von Visual Studio.",
	"assets/variables.json.CMAKE_VS_SDK_LIBRARY_DIRECTORIES": "Diese Variable ermöglicht das Überschreiben von Standardbibliotheksverzeichnissen von Visual Studio.",
	"assets/variables.json.CMAKE_VS_SDK_LIBRARY_WINRT_DIRECTORIES": "Diese Variable ermöglicht das Überschreiben von WinRT-Standardbibliotheksverzeichnissen von Visual Studio.",
	"assets/variables.json.CMAKE_VS_SDK_REFERENCE_DIRECTORIES": "Diese Variable ermöglicht das Überschreiben von Standardverweisverzeichnissen von Visual Studio.",
	"assets/variables.json.CMAKE_VS_SDK_SOURCE_DIRECTORIES": "Diese Variable ermöglicht das Überschreiben von Standardquellverzeichnissen von Visual Studio.",
	"assets/variables.json.CMAKE_VS_TARGET_FRAMEWORK_IDENTIFIER": "Visual Studio Zielframeworkbezeichner.",
	"assets/variables.json.CMAKE_VS_TARGET_FRAMEWORK_TARGETS_VERSION": "Visual Studio Zielframework-Zielversion.",
	"assets/variables.json.CMAKE_VS_TARGET_FRAMEWORK_VERSION": "Visual Studio Zielframeworkversion.",
	"assets/variables.json.CMAKE_VS_USE_DEBUG_LIBRARIES": "Geben Sie für Visual Studio-Generatoren an, welche Konfigurationen als Debugkonfigurationen betrachtet werden. Hiermit wird die Einstellung \"UseDebugLibraries\" in jeder Konfiguration einer .vcxproj Datei gesteuert.",
	"assets/variables.json.CMAKE_VS_VERSION_BUILD_NUMBER": "Visual Studio-Version.",
	"assets/variables.json.CMAKE_VS_WINDOWS_TARGET_PLATFORM_MIN_VERSION": "Weisen Sie Visual Studio-Generatoren an, die angegebene Mindestversion der Windows-Zielplattform zu verwenden.",
	"assets/variables.json.CMAKE_VS_WINDOWS_TARGET_PLATFORM_VERSION": "Visual Studio: Windows-Zielplattformversion",
	"assets/variables.json.CMAKE_VS_WINDOWS_TARGET_PLATFORM_VERSION_MAXIMUM": "Hiermit wird die maximal zulässige Windows 10 SDK-Version für VS 2015 und höher überschrieben.",
	"assets/variables.json.CMAKE_VS_WINRT_BY_DEFAULT": "Hiermit werden Visual Studio-Generatoren für VS 2010 und höher darüber informiert, dass die Zielplattform standardmäßig eine WinRT-Kompilierung aktiviert und diese explizit deaktiviert werden muss, wenn /ZW oder VS_WINRT_COMPONENT ausgelassen wird (im Gegensatz zur Aktivierung, wenn eine dieser Optionen vorhanden ist).",
	"assets/variables.json.CMAKE_WARN_DEPRECATED": "Legt fest, ob aufgrund veralteter Funktionen Warnmeldungen angezeigt werden.",
	"assets/variables.json.CMAKE_WARN_ON_ABSOLUTE_INSTALL_DESTINATION": "Das Skript \"cmake_install.cmake\" veranlassen, einen Warnhinweis anzuzeigen, wenn eine Datei mit einem absoluten Wert für INSTALL DESTINATION gefunden wird.",
	"assets/variables.json.CMAKE_WATCOM_RUNTIME_LIBRARY": "Wählen Sie die Watcom-Laufzeitbibliothek für die Verwendung durch Compiler aus, welche die Watcom-ABI als Ziel verwenden. Mit dieser Variablen wird die WATCOM_RUNTIME_LIBRARY-Eigenschaft für alle Ziele bei deren Erstellung initialisiert. Sie wird auch durch Aufrufe des Befehls „try_compile“ im Testprojekt weitergegeben.",
	"assets/variables.json.CMAKE_WIN32_EXECUTABLE": "Standardwert für WIN32_EXECUTABLE von Zielen.",
	"assets/variables.json.CMAKE_WINDOWS_EXPORT_ALL_SYMBOLS": "Standardwert der Zieleigenschaft WINDOWS_EXPORT_ALL_SYMBOLS. Mit dieser Variable wird die Eigenschaft während des Erstellens auf allen Zielen initialisiert.",
	"assets/variables.json.CMAKE_XCODE_ATTRIBUTE_an-attribute": "Legen Sie die Attribute eines Xcode-Ziels direkt fest.",
	"assets/variables.json.CMAKE_XCODE_BUILD_SYSTEM": "Auswahl des Xcode-Buildsystems.",
	"assets/variables.json.CMAKE_XCODE_GENERATE_SCHEME": "Wenn diese Variable aktiviert ist, generiert der Xcode-Generator Schemadateien. Diese sind nützlich, um Aktionen über die Befehlszeile aufzurufen, zu analysieren, zu archivieren, zu Testzwecken zu erstellen und zu testen.",
	"assets/variables.json.CMAKE_XCODE_GENERATE_TOP_LEVEL_PROJECT_ONLY": "Ist diese Einstellung aktiviert, generiert der Xcode-Generator nur eine Xcode-Projektdatei für den obersten project()-Befehl, anstatt für jeden project()-Befehl eine solche Datei zu generieren.",
	"assets/variables.json.CMAKE_XCODE_LINK_BUILD_PHASE_MODE": "Mit dieser Variablen wird die XCODE_LINK_BUILD_PHASE_MODE-Eigenschaft für Ziele initialisiert. Sie wirkt sich auf die Methoden aus, die vom Xcode-Generator zum Verknüpfen verschiedener Arten von Bibliotheken verwendet werden. Der Standardwert lautet NONE.",
	"assets/variables.json.CMAKE_XCODE_PLATFORM_TOOLSET": "Auswahl des Compilers für Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_ADDRESS_SANITIZER": "Legt fest, ob im Diagnoseabschnitt des generierten Xcode-Schemas \"Address Sanitizer\" aktiviert wird.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_ADDRESS_SANITIZER_USE_AFTER_RETURN": "Legt fest, ob im Diagnoseabschnitt des generierten Xcode-Schemas \"Detect use of stack after return\" aktiviert wird.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_DEBUG_DOCUMENT_VERSIONING": "Gibt an, ob bei Verwendung des Dokumentversionsbrowsers im Abschnitt mit den Optionen des generierten Xcode-Schemas die Einstellung zum Zulassen des Debuggens aktiviert wird.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_DISABLE_MAIN_THREAD_CHECKER": "Legt fest, ob \"Main Thread Checker\" im Abschnitt \"Diagnostics\" des generierten Xcode-Schemas deaktiviert wird.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_DYNAMIC_LIBRARY_LOADS": "Legt fest, ob im Diagnoseabschnitt des generierten Xcode-Schemas \"Dynamic Library Loads\" aktiviert wird.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_DYNAMIC_LINKER_API_USAGE": "Legt fest, ob im Diagnoseabschnitt des generierten Xcode-Schemas \"Dynamic Linker API usage\" aktiviert wird.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_ENABLE_GPU_API_VALIDATION": "Eigenschaftswert für Metal: API-Validierung im Abschnitt „Optionen“ des generierten Xcode-Schemas.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_ENABLE_GPU_FRAME_CAPTURE_MODE": "Eigenschaftswert für die GPU-Frame-Erfassung im Abschnitt „Optionen“ des generierten Xcode-Schemas. Beispielwerte sind Metal und Disabled.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_ENABLE_GPU_SHADER_VALIDATION": "Eigenschaftswert für Metal: Shader-Validierung im Abschnitt „Optionen“ des generierten Xcode-Schemas.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_ENVIRONMENT": "Geben Sie Umgebungsvariablen an, die dem Argumentenabschnitt des generierten Xcode-Schemas hinzugefügt werden.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_GUARD_MALLOC": "Legt fest, ob im Diagnoseabschnitt des generierten Xcode-Schemas \"Guard Malloc\" aktiviert wird.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_LAUNCH_CONFIGURATION": "Legen Sie die Buildkonfiguration fest, um das Ziel auszuführen.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_LAUNCH_MODE": "Eigenschaftswert für Start im Abschnitt „Info“ des generierten Xcode-Schemas.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_MAIN_THREAD_CHECKER_STOP": "Legt fest, ob im Abschnitt \"Diagnostics\" des generierten Xcode-Schemas bei Problemen die Main Thread Checker-Option \"Pause\" aktiviert wird.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_MALLOC_GUARD_EDGES": "Legt fest, ob im Diagnoseabschnitt des generierten Xcode-Schemas \"Malloc Guard Edges\" aktiviert wird.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_MALLOC_SCRIBBLE": "Legt fest, ob im Diagnoseabschnitt des generierten Xcode-Schemas \"Malloc Scribble\" aktiviert wird.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_MALLOC_STACK": "Legt fest, ob im Diagnoseabschnitt des generierten Xcode-Schemas \"Malloc Stack\" aktiviert wird.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_THREAD_SANITIZER": "Legt fest, ob im Diagnoseabschnitt des generierten Xcode-Schemas \"Thread Sanitizer\" aktiviert wird.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_THREAD_SANITIZER_STOP": "Legt fest, ob im Abschnitt \"Diagnostics\" des generierten Xcode-Schemas bei Problemen die Option \"Thread Sanitizer – Pause\" aktiviert wird.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_UNDEFINED_BEHAVIOUR_SANITIZER": "Legt fest, ob im Abschnitt \"Diagnostics\" des generierten Xcode-Schemas \"Undefined Behavior Sanitizer\" aktiviert wird.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_UNDEFINED_BEHAVIOUR_SANITIZER_STOP": "Legt fest, ob im Abschnitt \"Diagnostics\" des generierten Xcode-Schemas bei Problemen die Undefined Behavior Sanitizer-Option \"Pause\" aktiviert wird.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_WORKING_DIRECTORY": "Hiermit wird das Arbeitsverzeichnis der Ausführungs- und Profilaktionen im generierten Xcode-Schema angegeben.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_ZOMBIE_OBJECTS": "Legt fest, ob im Diagnoseabschnitt des generierten Xcode-Schemas \"Zombie Objects\" aktiviert wird.",
	"assets/variables.json.CMAKE_XCODE_XCCONFIG": "Wenn diese Einstellung festgelegt ist, registriert der Xcode-Generator die angegebene Datei als globale XCConfig-Datei. Für weitere Informationen über XCConfig-Dateien auf Zielebene siehe „XCODE_XCCONFIG-Zieleigenschaft“.",
	"assets/variables.json.CPACK_ABSOLUTE_DESTINATION_FILES": "Liste der Dateien, die mithilfe eines ABSOLUTE DESTINATION-Pfads installiert wurden.",
	"assets/variables.json.CPACK_COMPONENT_INCLUDE_TOPLEVEL_DIRECTORY": "Boolesche Umschaltung, um das Verzeichnis der obersten Ebene ein-/auszuschließen (bei Komponenten).",
	"assets/variables.json.CPACK_CUSTOM_INSTALL_VARIABLES": "CPack-Variablen (festgelegt über z. B. cpack -D, CPackConfig.cmake oder CPACK_PROJECT_CONFIG_FILE Skripte) sind nicht direkt sichtbar in Installationsskripts. Stattdessen kann eine Liste von varName=value-Paaren in der variablen CPACK_CUSTOM_INSTALL_VARIABLES übergeben werden. Bei der Installation führt jedes Listenelement dazu, dass eine Variable des angegebenen Namens (varName) auf den angegebenen Wert festgelegt wird. Das „=“-Zeichen kann für einen leeren Wert ausgelassen werden.",
	"assets/variables.json.CPACK_ERROR_ON_ABSOLUTE_INSTALL_DESTINATION": "CPack veranlassen, eine Fehlermeldung anzuzeigen, wenn eine Datei mit einem absoluten Wert von INSTALL DESTINATION gefunden wird.",
	"assets/variables.json.CPACK_INCLUDE_TOPLEVEL_DIRECTORY": "Boolesche Umschaltung, um Verzeichnis der obersten Ebene ein-/auszuschließen.",
	"assets/variables.json.CPACK_INSTALL_DEFAULT_DIRECTORY_PERMISSIONS": "Standardberechtigungen für Verzeichnisse, die beim Verpacken implizit erstellt werden.",
	"assets/variables.json.CPACK_PACKAGING_INSTALL_PREFIX": "Das im Buildpaket verwendete Präfix.",
	"assets/variables.json.CPACK_SET_DESTDIR": "Boolesche Umschaltung, durch die CPack beim Verpacken den Mechanismus DESTDIR verwendet.",
	"assets/variables.json.CPACK_WARN_ON_ABSOLUTE_INSTALL_DESTINATION": "CPack veranlassen, einen Warnhinweis anzuzeigen, wenn eine Datei mit einem absoluten Wert von INSTALL DESTINATION gefunden wird.",
	"assets/variables.json.CTEST_BINARY_DIRECTORY": "Geben Sie die CTest-BuildDirectory-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_BUILD_COMMAND": "Geben Sie die CTest-MakeCommand-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_BUILD_NAME": "Geben Sie die CTest-BuildName-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_BZR_COMMAND": "Geben Sie die CTest-BZRCommand-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_BZR_UPDATE_OPTIONS": "Geben Sie die CTest-BZRUpdateOptions-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_CHANGE_ID": "Geben Sie die CTest-ChangeId-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_CHECKOUT_COMMAND": "Geben Sie an, wie der Befehl \"ctest_start\" das Quellverzeichnis in einem ctest-Dashboard-Clientskript auscheckt oder initialisiert.",
	"assets/variables.json.CTEST_CONFIGURATION_TYPE": "Geben Sie die CTest-DefaultCTestConfigurationType-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_CONFIGURE_COMMAND": "Geben Sie die CTest-ConfigureCommand-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_COVERAGE_COMMAND": "Geben Sie die CTest-CoverageCommand-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_COVERAGE_EXTRA_FLAGS": "Geben Sie die CTest-CoverageExtraFlags-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_CURL_OPTIONS": "Geben Sie die CTest-CurlOptions-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_CUSTOM_COVERAGE_EXCLUDE": "Eine Liste mit regulären Ausdrücken, die verwendet werden, um Dateien nach ihrem Pfad von der durch den Befehl \"ctest_coverage\" ausgegebenen Abdeckung auszuschließen.",
	"assets/variables.json.CTEST_CUSTOM_ERROR_EXCEPTION": "Eine Liste mit regulären Ausdrücken, die zum Ausschließen verwendet wird, wenn durch den Befehl „ctest_build“ Fehlermeldungen in Buildausgaben erkannt werden.",
	"assets/variables.json.CTEST_CUSTOM_ERROR_MATCH": "Eine Liste mit regulären Ausdrücken, die verwendet werden, um mit dem Befehl „ctest_build“ Fehlermeldungen in Buildausgaben zu erkennen.",
	"assets/variables.json.CTEST_CUSTOM_ERROR_POST_CONTEXT": "Die Anzahl an Zeilen, die als Kontext einer Fehlermeldung folgen, die durch den Befehl „ctest_build“ ausgelöst wird. Der Standard ist 10.",
	"assets/variables.json.CTEST_CUSTOM_ERROR_PRE_CONTEXT": "Die Anzahl an Zeilen, die als Kontext einer Fehlermeldung vorausgehen, die durch den Befehl „ctest_build“ ausgelöst wird. Der Standard ist 10.",
	"assets/variables.json.CTEST_CUSTOM_MAXIMUM_FAILED_TEST_OUTPUT_SIZE": "Beim Speichern der Ausgabe eines fehlerhaften Tests ist dies die maximale Größe in Bytes, die vom Befehl „ctest_test“ erfasst wird. Der Standardwert ist 307 200 (300 KiB). Informationen zu möglichen Abschneidemodi finden Sie unter CTEST_CUSTOM_TEST_OUTPUT_TRUNCATION.",
	"assets/variables.json.CTEST_CUSTOM_MAXIMUM_NUMBER_OF_ERRORS": "Die maximale Anzahl an Fehlern, die in einem einzelnen Buildschritt erkannt werden. Danach wird die Ausgabe vom Befehl \"ctest_test\" gekürzt. Der Standard ist 50.",
	"assets/variables.json.CTEST_CUSTOM_MAXIMUM_NUMBER_OF_WARNINGS": "Die maximale Anzahl an Warnmeldungen, die in einem einzelnen Buildschritt erkannt werden. Danach wird die Ausgabe vom Befehl \"ctest_test\" gekürzt. Der Standard ist 50.",
	"assets/variables.json.CTEST_CUSTOM_MAXIMUM_PASSED_TEST_OUTPUT_SIZE": "Beim Speichern der Ausgabe eines bestandenen Tests ist dies die maximale Größe in Bytes, die vom Befehl „ctest_test“ erfasst wird. Der Standardwert ist 1024 (1 KiB). Informationen zu möglichen Abschneidemodi finden Sie unter CTEST_CUSTOM_TEST_OUTPUT_TRUNCATION.",
	"assets/variables.json.CTEST_CUSTOM_MEMCHECK_IGNORE": "Eine Liste mit regulären Ausdrücken, um Tests während des Befehls \"ctest_memcheck\" auszuschließen.",
	"assets/variables.json.CTEST_CUSTOM_POST_MEMCHECK": "Eine Liste mit Befehlen, die am Ende des Befehls \"ctest_memcheck\" ausgeführt werden.",
	"assets/variables.json.CTEST_CUSTOM_POST_TEST": "Eine Liste mit Befehlen, die am Ende des Befehls \"ctest_test\" ausgeführt werden.",
	"assets/variables.json.CTEST_CUSTOM_PRE_MEMCHECK": "Eine Liste mit Befehlen, die zu Beginn des Befehls \"ctest_memcheck\" ausgeführt werden.",
	"assets/variables.json.CTEST_CUSTOM_PRE_TEST": "Eine Liste mit Befehlen, die zu Beginn des Befehls \"ctest_test\" ausgeführt werden.",
	"assets/variables.json.CTEST_CUSTOM_TESTS_IGNORE": "Eine Liste von Testnamen, die aus der Gruppe von Tests ausgeschlossen werden sollen, die vom Befehl ctest_test ausgeführt werden.",
	"assets/variables.json.CTEST_CUSTOM_TEST_OUTPUT_TRUNCATION": "Legen Sie den Testausgabekürzungsmodus für den Fall fest, dass eine maximale Größe über die Variablen CTEST_CUSTOM_MAXIMUM_PASSED_TEST_OUTPUT_SIZE oder CTEST_CUSTOM_MAXIMUM_FAILED_TEST_OUTPUT_SIZE konfiguriert wird. Standardmäßig wird das Ende der Ausgabe abgeschnitten. Andere mögliche Werte sind „Mitte“ und „Kopf“.",
	"assets/variables.json.CTEST_CUSTOM_WARNING_EXCEPTION": "Eine Liste der regulären Ausdrücke, die bei der Erkennung von Warnmeldungen in Buildausgaben durch den Befehl \"ctest_build\" ausgeschlossen werden sollen.",
	"assets/variables.json.CTEST_CUSTOM_WARNING_MATCH": "Eine Liste der regulären Ausdrücke, die zur Erkennung von Warnmeldungen in Buildausgaben durch den Befehl \"ctest_build\" verwendet werden sollen.",
	"assets/variables.json.CTEST_CVS_CHECKOUT": "Veraltet. Verwenden Sie stattdessen CTEST_CHECKOUT_COMMAND.",
	"assets/variables.json.CTEST_CVS_COMMAND": "Geben Sie die CTest-CVSCommand-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_CVS_UPDATE_OPTIONS": "Geben Sie die CTest-CVSUpdateOptions-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_DROP_LOCATION": "Geben Sie die CTest-DropLocation-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_DROP_METHOD": "Geben Sie die CTest-DropMethod-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_DROP_SITE": "Geben Sie die CTest-DropSite-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_DROP_SITE_CDASH": "Geben Sie die CTest-IsCDash-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_DROP_SITE_PASSWORD": "Geben Sie die CTest-DropSitePassword-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_DROP_SITE_USER": "Geben Sie die CTest-DropSiteUser-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_EXTRA_COVERAGE_GLOB": "Eine Liste mit regulären Ausdrücken zum Finden von Dateien, die durch den Befehl \"ctest_coverage\" abzudecken sind.",
	"assets/variables.json.CTEST_GIT_COMMAND": "Geben Sie die CTest-GITCommand-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_GIT_INIT_SUBMODULES": "Geben Sie die CTest-GITInitSubmodules-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_GIT_UPDATE_CUSTOM": "Geben Sie die CTest-GITUpdateCustom-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_GIT_UPDATE_OPTIONS": "Geben Sie die CTest-GITUpdateOptions-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_HG_COMMAND": "Geben Sie die CTest-HGCommand-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_HG_UPDATE_OPTIONS": "Geben Sie die CTest-HGUpdateOptions-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_LABELS_FOR_SUBPROJECTS": "Geben Sie die CTest-LabelsForSubprojects-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_MEMORYCHECK_COMMAND": "Geben Sie die CTest-MemoryCheckCommand-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_MEMORYCHECK_COMMAND_OPTIONS": "Geben Sie die CTest-MemoryCheckCommandOptions-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_MEMORYCHECK_SANITIZER_OPTIONS": "Geben Sie die CTest-MemoryCheckSanitizerOptions-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_MEMORYCHECK_SUPPRESSIONS_FILE": "Geben Sie die CTest-MemoryCheckSuppressionFile-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_MEMORYCHECK_TYPE": "Hiermit wird die Einstellung \"CTest MemoryCheckType\" in einem ctest-Dashboardclientskript angegeben. Folgende Werte sind gültig: Valgrind, Purify, BoundsChecker, DrMemory, CudaSanitizer, ThreadSanitizer, AddressSanitizer, LeakSanitizer, MemorySanitizer, UndefinedBehaviorSanitizer.",
	"assets/variables.json.CTEST_NIGHTLY_START_TIME": "Geben Sie die CTest-NightlyStartTime-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_P4_CLIENT": "Geben Sie die CTest-P4Client-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_P4_COMMAND": "Geben Sie die CTest-P4Command-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_P4_OPTIONS": "Geben Sie die CTest-P4Options-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_P4_UPDATE_OPTIONS": "Geben Sie die CTest-P4UpdateOptions-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_RESOURCE_SPEC_FILE": "Hiermit wird die Einstellung \"CTest ResourceSpecFile\" in einem ctest-Dashboardclientskript angegeben.",
	"assets/variables.json.CTEST_RUN_CURRENT_SCRIPT": "Wird diese Einstellung auf \"0\" gesetzt, wird ctest nicht erneut ausgeführt, wenn durch das Aufrufen von \"ctest -S\" das Ende eines Skripts erreicht wird.",
	"assets/variables.json.CTEST_SCP_COMMAND": "Dies ist eine veraltete Option (wird nicht verwendet).",
	"assets/variables.json.CTEST_SCRIPT_DIRECTORY": "Das Verzeichnis, welches das CTest-Skript der obersten Ebene enthält. Das Konzept ähnelt CMAKE_SOURCE_DIR.",
	"assets/variables.json.CTEST_SITE": "Geben Sie die CTest-Site-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_SOURCE_DIRECTORY": "Geben Sie die CTest-SourceDirectory-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_SUBMIT_INACTIVITY_TIMEOUT": "Geben Sie die CTest SubmitInactivityTimeout-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_SUBMIT_URL": "Hiermit wird die Einstellung \"CTest SubmitURL\" in einem ctest-Dashboardclientskript angegeben.",
	"assets/variables.json.CTEST_SVN_COMMAND": "Geben Sie die CTest-SVNCommand-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_SVN_OPTIONS": "Geben Sie die CTest-SVNOptions-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_SVN_UPDATE_OPTIONS": "Geben Sie die CTest-SVNUpdateOptions-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_TEST_LOAD": "Geben Sie die Einstellung \"TestLoad\" im CTest-Test-Schritt eines ctest-Dashboard-Clientskripts an. Dies legt den Standardwert für die Option TEST_LOAD des Befehls \"ctest_test\" fest.",
	"assets/variables.json.CTEST_TEST_TIMEOUT": "Geben Sie die CTest-TimeOut-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_TLS_VERIFY": "Geben Sie die CTest-TLSVerify-Einstellung in einem ctest-Dashboardclientskript oder im Projekt-CMakeLists.txt-Code an, bevor Sie das CTest-Modul einschließen. Der Wert ist ein boolescher Wert, der angibt, ob das Serverzertifikat bei der Übermittlung an ein Dashboard über https:// URLs überprüft werden soll.",
	"assets/variables.json.CTEST_TLS_VERSION": "Geben Sie die CTest-TLSVersion-Einstellung in einem ctest-Dashboardclientskript oder im Projekt-CMakeLists.txt-Code an, bevor Sie das CTest-Modul einschließen. Der Wert ist eine tls-Mindestversion, die beim Übermitteln an eine Dashboard über https:// URLs zulässig ist.",
	"assets/variables.json.CTEST_TRIGGER_SITE": "Dies ist eine veraltete Option (wird nicht verwendet).",
	"assets/variables.json.CTEST_UPDATE_COMMAND": "Geben Sie die CTest-UpdateCommand-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_UPDATE_OPTIONS": "Geben Sie die CTest-UpdateOptions-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CTEST_UPDATE_VERSION_ONLY": "Hiermit wird die Einstellung \"CTest UpdateVersionOnly\" in einem ctest-Dashboardclientskript angegeben.",
	"assets/variables.json.CTEST_UPDATE_VERSION_OVERRIDE": "Hiermit wird die Einstellung \"CTest UpdateVersionOverride\" in einem ctest-Dashboardclientskript angegeben.",
	"assets/variables.json.CTEST_USE_LAUNCHERS": "Geben Sie die CTest-UseLaunchers-Einstellung in einem ctest-Dashboard-Clientskript an.",
	"assets/variables.json.CYGWIN": "WAHR für Cygwin.",
	"assets/variables.json.ENV": "Der Operator zum Lesen von Umgebungsvariablen.",
	"assets/variables.json.EXECUTABLE_OUTPUT_PATH": "Variable für alten Speicherort einer ausführbaren Datei.",
	"assets/variables.json.GHSMULTI": "1 bei Verwendung des Green Hills MULTI-Generators.",
	"assets/variables.json.IOS": "Legen Sie diese Variable auf 1 fest, wenn das Zielsystem (CMAKE_SYSTEM_NAME) iOS ist.",
	"assets/variables.json.LIBRARY_OUTPUT_PATH": "Variable für alten Speicherort der Bibliothek.",
	"assets/variables.json.LINUX": "Wird auf WAHR festgelegt, wenn das Zielsystem Linux ist.",
	"assets/variables.json.MINGW": "Legen Sie diesen Wert auf TRUE fest, wenn mindestens eine Sprache mit einem Compiler aktiviert ist, der auf GNU ABI unter Windows (MinGW) ausgerichtet ist.",
	"assets/variables.json.MSVC": "Legen Sie diesen Wert auf TRUE fest, wenn es sich beim Compiler um eine Version von Microsoft Visual C++ oder einen anderen Compiler handelt, der die cl-Befehlszeilensyntax von Visual C++ simuliert.",
	"assets/variables.json.MSVC10": "Nicht empfohlen. Verwenden Sie stattdessen die Variable MSVC_VERSION.",
	"assets/variables.json.MSVC11": "Nicht empfohlen. Verwenden Sie stattdessen die Variable MSVC_VERSION.",
	"assets/variables.json.MSVC12": "Nicht empfohlen. Verwenden Sie stattdessen die Variable MSVC_VERSION.",
	"assets/variables.json.MSVC14": "Nicht empfohlen. Verwenden Sie stattdessen die Variable MSVC_VERSION.",
	"assets/variables.json.MSVC60": "Nicht empfohlen. Verwenden Sie stattdessen die Variable MSVC_VERSION.",
	"assets/variables.json.MSVC70": "Nicht empfohlen. Verwenden Sie stattdessen die Variable MSVC_VERSION.",
	"assets/variables.json.MSVC71": "Nicht empfohlen. Verwenden Sie stattdessen die Variable MSVC_VERSION.",
	"assets/variables.json.MSVC80": "Nicht empfohlen. Verwenden Sie stattdessen die Variable MSVC_VERSION.",
	"assets/variables.json.MSVC90": "Nicht empfohlen. Verwenden Sie stattdessen die Variable MSVC_VERSION.",
	"assets/variables.json.MSVC_IDE": "\"True\", wenn die Microsoft Visual C++-IDE verwendet wird.",
	"assets/variables.json.MSVC_TOOLSET_VERSION": "Die verwendete Toolsetversion von Microsoft Visual C/C++ (falls zutreffend). Werden MSVC-ähnliche Varianten verwendet, wird die Variable basierend auf der Compilerversion festgelegt, die durch die Variable MSVC_VERSION angegeben ist.",
	"assets/variables.json.MSVC_VERSION": "Die verwendete Version von Microsoft Visual C/C++ (falls zutreffend). Falls ein Visual C++ simulierender Compiler verwendet wird, wird diese Variable auf die Toolsetversion festgelegt, die durch die Präprozessordefinition _MSC_VER bestimmt ist.",
	"assets/variables.json.MSYS": "Lautet TRUE, wenn der MSYS Makefiles-Generator verwendet wird.",
	"assets/variables.json.PackageName_ROOT": "Aufrufe an find_package(<PackageName>) suchen in Präfixen, die durch die CMake-Variable <PackageName>_ROOT angegeben sind. Hierbei ist <PackageName> der Name (Groß-/Kleinschreibung beibehalten) des Aufrufs „find_package“, und _ROOT ist ein Literal. Beispielsweise sucht „find_package(Foo)“ nach Präfixen, die in der CMake-Variable „Foo_ROOT“ (sofern gesetzt) angegeben sind. Siehe Richtlinie CMP0074.",
	"assets/variables.json.PROJECT-NAME_BINARY_DIR": "Binärverzeichnis der obersten Ebene des benannten Projekts.",
	"assets/variables.json.PROJECT-NAME_DESCRIPTION": "Wert, der an die DESCRIPTION-Option des neuesten Aufrufs an den Befehl \"project\" mit dem Projektnamen <PROJECT-NAME> übergeben wurde (falls zutreffend).",
	"assets/variables.json.PROJECT-NAME_HOMEPAGE_URL": "Wert, der an die HOMEPAGE_URL-Option des neuesten Aufrufs an den Befehl \"project\" mit dem Projektnamen <PROJECT-NAME> übergeben wurde (falls zutreffend).",
	"assets/variables.json.PROJECT-NAME_IS_TOP_LEVEL": "Eine boolesche Variable, die angibt, ob das benannte Projekt in einer CMakeLists.txt-Datei der obersten Ebene aufgerufen wurde.",
	"assets/variables.json.PROJECT-NAME_SOURCE_DIR": "Quellverzeichnis der obersten Ebene des benannten Projekts.",
	"assets/variables.json.PROJECT-NAME_VERSION": "Wert, der an die VERSION-Option des neuesten Aufrufs an den Befehl \"project\" mit dem Projektnamen <PROJECT-NAME> übergeben wurde (falls zutreffend).",
	"assets/variables.json.PROJECT-NAME_VERSION_MAJOR": "Erste Versionsnummernkomponente der Variable <PROJECT-NAME>_VERSION, wie sie vom Befehl \"project\" festgelegt wurde.",
	"assets/variables.json.PROJECT-NAME_VERSION_MINOR": "Zweite Versionsnummernkomponente der Variable <PROJECT-NAME>_VERSION, wie sie vom Befehl \"project\" festgelegt wurde.",
	"assets/variables.json.PROJECT-NAME_VERSION_PATCH": "Dritte Versionsnummernkomponente der Variable <PROJECT-NAME>_VERSION, wie sie vom Befehl \"project\" festgelegt wurde.",
	"assets/variables.json.PROJECT-NAME_VERSION_TWEAK": "Vierte Versionsnummernkomponente der Variable <PROJECT-NAME>_VERSION, wie sie vom Befehl \"project\" festgelegt wurde.",
	"assets/variables.json.PROJECT_BINARY_DIR": "Der vollständige Pfad zum Buildverzeichnis für das Projekt.",
	"assets/variables.json.PROJECT_DESCRIPTION": "Kurze Projektbeschreibung, die an den Befehl \"project\" übergeben wird.",
	"assets/variables.json.PROJECT_HOMEPAGE_URL": "Die URL der Homepage des Projekts.",
	"assets/variables.json.PROJECT_IS_TOP_LEVEL": "Eine boolesche Variable, die angibt, ob der zuletzt aufgerufene Projektbefehl, im aktuellen Bereich oder darüber, sich in der obersten Ebene CMakeLists.txt Datei befand.",
	"assets/variables.json.PROJECT_NAME": "An den Projektbefehl übergebener Name des Projekts.",
	"assets/variables.json.PROJECT_SOURCE_DIR": "Dies ist das Quellverzeichnis des letzten Aufrufs des Befehls \"project\", der im aktuellen Verzeichnisbereich oder einem seiner übergeordneten Elemente ausgeführt wurde. Hinweis: Aufrufe von \"project\" innerhalb des Bereichs eines untergeordneten Verzeichnisses (z. B. aus einem add_subdirectory-Aufruf aus dem aktuellen Bereich) bleiben hierbei unberücksichtigt.",
	"assets/variables.json.PROJECT_VERSION": "Wert, der an die VERSION-Option des neuesten Aufrufs an den Befehl \"project\" übergeben wurde (falls zutreffend).",
	"assets/variables.json.PROJECT_VERSION_MAJOR": "Erste Versionsnummernkomponente der Variable PROJECT_VERSION, wie sie vom Befehl \"project\" festgelegt wurde.",
	"assets/variables.json.PROJECT_VERSION_MINOR": "Zweite Versionsnummernkomponente der Variable PROJECT_VERSION, wie sie vom Befehl \"project\" festgelegt wurde.",
	"assets/variables.json.PROJECT_VERSION_PATCH": "Dritte Versionsnummernkomponente der Variable PROJECT_VERSION, wie sie vom Befehl \"project\" festgelegt wurde.",
	"assets/variables.json.PROJECT_VERSION_TWEAK": "Vierte Versionsnummernkomponente der Variable PROJECT_VERSION, wie sie vom Befehl \"project\" festgelegt wurde.",
	"assets/variables.json.UNIX": "Setzen Sie diese Einstellung auf \"true\", wenn das Zielsystem UNIX oder UNIX-ähnlich ist (z. B. APPLE und CYGWIN). Fragen Sie die Variable CMAKE_SYSTEM_NAME ab, wenn ein spezifischeres Verständnis des Zielsystems erforderlich ist.",
	"assets/variables.json.WIN32": "Auf \"true\" festlegen, wenn das Zielsystem Windows ist (einschließlich Win64).",
	"assets/variables.json.WINCE": "\"True\", wenn die Variable CMAKE_SYSTEM_NAME auf \"WindowsCE\" gesetzt ist.",
	"assets/variables.json.WINDOWS_PHONE": "\"True\", wenn die Variable CMAKE_SYSTEM_NAME auf \"WindowsPhone\" gesetzt ist.",
	"assets/variables.json.WINDOWS_STORE": "\"True\", wenn die Variable CMAKE_SYSTEM_NAME auf \"WindowsStore\" gesetzt ist.",
	"assets/variables.json.XCODE": "\"True\", wenn der Xcode-Generator verwendet wird.",
	"assets/variables.json.XCODE_VERSION": "Version von Xcode (nur Xcode-Generator).",
	"assets/variables.json.ADVANCED": "\"True\", wenn der Eintrag auf grafischen Benutzeroberflächen standardmäßig auszublenden ist.",
	"assets/variables.json.HELPSTRING": "Hilfe, die in Zusammenhang mit Eintrag auf grafischen Benutzeroberflächen steht.",
	"assets/variables.json.MODIFIED": "Interne Verwaltungseigenschaft. Nicht setzen oder abrufen.",
	"assets/variables.json.STRINGS": "Zählen Sie mögliche STRING-Eingabewerte für die Auswahl der grafischen Benutzeroberfläche auf.",
	"assets/variables.json.TYPE": "Der Widgettyp für die Eingabe in grafischen Benutzeroberflächen.",
	"assets/variables.json.VALUE": "Wert eines Cacheeintrags.",
	"assets/variables.json.ADDITIONAL_CLEAN_FILES": "Eine durch Semikolon getrennte Liste der Dateien oder Verzeichnisse, die im Rahmen des globalen Bereinigungsziels entfernt werden. Diese Eigenschaft ist nützlich, um generierte Dateien oder Verzeichnisse anzugeben, die von mehreren Zielen oder von CMake selbst verwendet oder die in einer Weise generiert werden, die eine Erfassung der Ausgaben oder Nebenprodukte benutzerdefinierter Befehle nicht zulässt.",
	"assets/variables.json.ADDITIONAL_MAKE_CLEAN_FILES": "Zusätzliche Dateien, die während der Bereinigungsphase entfernt werden.",
	"assets/variables.json.BINARY_DIR": "Diese schreibgeschützte Verzeichniseigenschaft meldet den absoluten Pfad zum Binärverzeichnis. Dieses Verzeichnis entspricht der Quelle, für die Daten gelesen werden.",
	"assets/variables.json.BUILDSYSTEM_TARGETS": "Diese schreibgeschützte Verzeichniseigenschaft enthält eine durch Semikolon getrennte Liste der Buildsystemziele, die dem Verzeichnis durch Aufrufe der Befehle \"add_library\", \"add_executable\" und \"add_custom_target\" hinzugefügt wurden. Die Liste enthält keine importierten oder Aliasziele, dafür jedoch Schnittstellenbibliotheken. Jeder Eintrag in der Liste ist der logische Name eines Ziels, das an die Option TARGET des Befehls \"get_property\" übergeben werden kann.",
	"assets/variables.json.CACHE_VARIABLES": "Liste der im aktuellen Verzeichnis verfügbaren Cachevariablen.",
	"assets/variables.json.CLEAN_NO_CUSTOM": "Auf \"true\" setzen, damit Makefile-Generatoren die Ausgaben benutzerdefinierter Befehle während des Bereinigungsvorgangs für dieses Verzeichnis nicht entfernen. Bei anderen Generatoren wird diese Einstellung ignoriert, da keine Implementierung möglich ist.",
	"assets/variables.json.CMAKE_CONFIGURE_DEPENDS": "Informieren Sie CMake über zusätzliche Eingabedateien für den Konfigurationsprozess. Wird eine benannte Datei modifiziert, führt das Buildsystem CMake erneut aus, um die Datei erneut zu konfigurieren und das Buildsystem nochmals zu generieren.",
	"assets/variables.json.COMPILE_DEFINITIONS": "Präprozessordefinitionen zum Kompilieren der Quellen eines Ziels.",
	"assets/variables.json.COMPILE_DEFINITIONS_CONFIG": "Ignoriert. Siehe CMake-Richtlinie CMP0043.",
	"assets/variables.json.COMPILE_OPTIONS": "Liste mit Optionen, die an den Compiler zu übergeben sind.",
	"assets/variables.json.DEFINITIONS": "Nur für Kompatibilität mit CMake 2.4. Verwenden Sie stattdessen COMPILE_DEFINITIONS.",
	"assets/variables.json.EXCLUDE_FROM_ALL": "Wenn Sie diese Verzeichniseigenschaft für ein Unterverzeichnis auf TRUE festlegen, werden die zugehörigen Ziele aus dem Ziel \"all\" der entsprechenden Vorgängerelemente ausgeschlossen. Bei einem Ausschluss führt beispielsweise \"make\" im übergeordneten Verzeichnis nicht dazu, dass standardmäßig Ziele im Unterverzeichnis erstellt werden. Diese Eigenschaft hat keine Auswirkung auf das Ziel \"all\" des Unterverzeichnisses selbst. Beispielsweise werden bei Ausführung von \"make\" im Unterverzeichnis weiterhin die zugehörigen Ziele erstellt.",
	"assets/variables.json.IMPLICIT_DEPENDS_INCLUDE_TRANSFORM": "Hiermit werden #include-Zeilentransformationen für Abhängigkeiten in einem Verzeichnis angegeben.",
	"assets/variables.json.IMPORTED_TARGETS": "Diese schreibgeschützte Verzeichniseigenschaft enthält eine durch Semikolons getrennte Liste importierter Ziele, die dem Verzeichnis durch Aufrufe der Befehle add_library und add_executable hinzugefügt wurden. Jeder Eintrag in der Liste ist der logische Name eines Ziels, der für die Übergabe an die Option get_property Befehl TARGET geeignet ist, wenn er im selben Verzeichnis aufgerufen wird.",
	"assets/variables.json.INCLUDE_DIRECTORIES": "Liste mit Präprozessor-Includedatei-Suchverzeichnissen.",
	"assets/variables.json.INCLUDE_REGULAR_EXPRESSION": "Includedatei, die einen regulären Ausdruck scannt.",
	"assets/variables.json.INTERPROCEDURAL_OPTIMIZATION": "Diese Verzeichniseigenschaft ist nicht mehr vorhanden.",
	"assets/variables.json.INTERPROCEDURAL_OPTIMIZATION_CONFIG": "Diese Verzeichniseigenschaft ist nicht mehr vorhanden.",
	"assets/variables.json.LABELS": "Hiermit wird eine Liste der Textbezeichnungen angegeben, die einem Verzeichnis und allen zugehörigen Unterverzeichnissen zugeordnet sind. Dies entspricht dem Festlegen der LABELS-Eigenschaft für das Ziel und der Testeigenschaft LABELS für alle Ziele und Tests im aktuellen Verzeichnis und in den Unterverzeichnissen. Hinweis: Es müssen Launcher aktiviert sein, um Bezeichnungen an Ziele weiterzugeben.",
	"assets/variables.json.LINK_DIRECTORIES": "Eine Liste der Suchverzeichnisse für den Linker.",
	"assets/variables.json.LINK_OPTIONS": "Eine Liste der Optionen, die für den Schritt zum Verknüpfen von als Zielen verwendeten freigegebenen Bibliotheken, Modulen und ausführbaren Dateien sowie im Schritt zur Geräteverknüpfung verwendet werden.",
	"assets/variables.json.LISTFILE_STACK": "Der aktuelle Stapel mit Listendateien, der verarbeitet wird.",
	"assets/variables.json.MACROS": "Liste mit Makrobefehlen, die im aktuellen Verzeichnis verfügbar sind.",
	"assets/variables.json.PARENT_DIRECTORY": "Quellverzeichnis, das das aktuelle Unterverzeichnis hinzugefügt hat.",
	"assets/variables.json.RULE_LAUNCH_COMPILE": "Geben Sie ein Startprogramm für Kompilierungsregeln an.",
	"assets/variables.json.RULE_LAUNCH_CUSTOM": "Geben Sie ein Startprogramm für benutzerdefinierte Regeln an.",
	"assets/variables.json.RULE_LAUNCH_LINK": "Geben Sie ein Startprogramm für Verknüpfungsregeln an.",
	"assets/variables.json.SOURCE_DIR": "Diese schreibgeschützte Verzeichniseigenschaft meldet den absoluten Pfad zu dem Quellverzeichnis, das gelesen wird.",
	"assets/variables.json.SUBDIRECTORIES": "Diese schreibgeschützte Verzeichniseigenschaft enthält eine durch Semikolon getrennte Liste der Unterverzeichnisse, die bisher von den Befehlen \"add_subdirectory\" und \"subdirs\" verarbeitet wurden. Jeder Eintrag ist der absolute Pfad zum Quellverzeichnis (in der die Datei \"CMakeLists.txt\" enthalten ist). Eine Übergabe an die DIRECTORY-Option des Befehls \"get_property\" ist möglich.",
	"assets/variables.json.SYSTEM": "Diese Verzeichniseigenschaft wird verwendet, um die SYSTEM-Zieleigenschaft für nicht importierte Ziele zu initialisieren, die in diesem Verzeichnis erstellt wurden. Sie wird durch „add_subdirectory“ und „FetchContent_Declare“ auf WAHR festgelegt, wenn die Option SYSTEM als Argument für diese Befehle angegeben wird.",
	"assets/variables.json.TESTS": "Eine Liste mit Tests.",
	"assets/variables.json.TEST_INCLUDE_FILE": "Veraltet. Verwenden Sie stattdessen TEST_INCLUDE_FILES.",
	"assets/variables.json.TEST_INCLUDE_FILES": "Eine Liste mit CMake-Dateien, die beim Ausführen von ctest berücksichtigt werden.",
	"assets/variables.json.VARIABLES": "Liste mit im aktuellen Verzeichnis definierten Variablen.",
	"assets/variables.json.VS_GLOBAL_SECTION_POST_section": "Geben Sie in Visual Studio einen globalen Abschnitt \"postSolution\" an.",
	"assets/variables.json.VS_GLOBAL_SECTION_PRE_section": "Geben Sie in Visual Studio einen globalen Abschnitt \"preSolution\" an.",
	"assets/variables.json.VS_STARTUP_PROJECT": "Geben Sie die Standard-Startprojekt einer Visual Studio-Lösung an.",
	"assets/variables.json.ALLOW_DUPLICATE_CUSTOM_TARGETS": "Zulassen, dass doppelte benutzerdefinierte Ziele erstellt werden.",
	"assets/variables.json.AUTOGEN_SOURCE_GROUP": "Name der source_group für AUTOMOC-, AUTORCC- und AUTOUIC-generierten Dateien.",
	"assets/variables.json.AUTOGEN_TARGETS_FOLDER": "Name von FOLDER für *_autogen-Ziele, die von CMake automatisch bei Zielen hinzugefügt werden, für die AUTOMOC deaktiviert ist.",
	"assets/variables.json.AUTOMOC_SOURCE_GROUP": "Name der source_group für durch AUTOMOC generierte Dateien.",
	"assets/variables.json.AUTOMOC_TARGETS_FOLDER": "Name von FOLDER für *_autogen-Ziele, die von CMake automatisch bei Zielen hinzugefügt werden, für die AUTOMOC deaktiviert ist.",
	"assets/variables.json.AUTORCC_SOURCE_GROUP": "Name der source_group für durch AUTORCC generierte Dateien.",
	"assets/variables.json.AUTOUIC_SOURCE_GROUP": "Name der source_group für durch AUTOMOC-generierte Dateien.",
	"assets/variables.json.CMAKE_CUDA_KNOWN_FEATURES": "Eine Liste der CUDA-Features, die in dieser Version von CMake bekannt sind.",
	"assets/variables.json.CMAKE_CXX_KNOWN_FEATURES": "Liste mit C++-Features, die dieser Version von CMake bekannt sind.",
	"assets/variables.json.CMAKE_C_KNOWN_FEATURES": "Liste mit C-Features, die dieser Version von CMake bekannt sind.",
	"assets/variables.json.CMAKE_HIP_KNOWN_FEATURES": "Liste mit HIP-Features, die dieser Version von CMake bekannt sind.",
	"assets/variables.json.CMAKE_ROLE": "Hiermit wird angegeben, in welchem Modus sich das aktuell ausgeführte Skript befindet. Es kann einer der folgenden Werte verwendet werden:",
	"assets/variables.json.DEBUG_CONFIGURATIONS": "Geben Sie die Konfigurationen für das Debuggen an.",
	"assets/variables.json.DISABLED_FEATURES": "Liste mit Features, die während der Ausführung von CMake deaktiviert sind.",
	"assets/variables.json.ECLIPSE_EXTRA_CPROJECT_CONTENTS": "Zusätzliche Inhalte, die in die generierte Eclipse-cproject-Datei von Eclipse eingefügt werden.",
	"assets/variables.json.ECLIPSE_EXTRA_NATURES": "Liste mit Features, die der generierten Eclipse-cproject-Datei hinzugefügt werden.",
	"assets/variables.json.ENABLED_FEATURES": "Liste mit Features, die während der Ausführung von CMake aktiviert sind.",
	"assets/variables.json.ENABLED_LANGUAGES": "Schreibgeschützte Eigenschaft, die die Liste der aktuell aktivierten Sprachen enthält",
	"assets/variables.json.FIND_LIBRARY_USE_LIB32_PATHS": "Legt fest, ob der Befehl \"find_library\" lib32-Verzeichnisse automatisch durchsucht.",
	"assets/variables.json.FIND_LIBRARY_USE_LIB64_PATHS": "Legt fest, ob der Befehl \"find_library\" lib64-Verzeichnisse automatisch durchsucht.",
	"assets/variables.json.FIND_LIBRARY_USE_LIBX32_PATHS": "Legt fest, ob der Befehl \"find_library\" libx32-Verzeichnisse automatisch durchsucht.",
	"assets/variables.json.FIND_LIBRARY_USE_OPENBSD_VERSIONING": "Gibt an, ob \"find_library\" freigegebene OpenBSD-ähnliche Bibliotheken findet.",
	"assets/variables.json.GENERATOR_IS_MULTI_CONFIG": "Schreibgeschützte Eigenschaft, die bei Generatoren mit mehreren Konfigurationen \"true\" ist.",
	"assets/variables.json.GLOBAL_DEPENDS_DEBUG_MODE": "Aktivieren Sie den globalen Debugmodus für Zielabhängigkeitsdiagramme.",
	"assets/variables.json.GLOBAL_DEPENDS_NO_CYCLES": "Verweigern Sie globale Zielabhängigkeitsdiagrammzyklen.",
	"assets/variables.json.INSTALL_PARALLEL": "Aktiviert die Parallelinstallationsoption für den Ninja-Generator.",
	"assets/variables.json.IN_TRY_COMPILE": "Schreibgeschützte Eigenschaft, die während einer \"Kompilieren versuchen\"-Konfiguration \"true\" ist.",
	"assets/variables.json.JOB_POOLS": "Nur Ninja: Liste der verfügbaren Pools.",
	"assets/variables.json.PACKAGES_FOUND": "Liste mit Paketen, die während der CMake-Ausführung gefunden wurden.",
	"assets/variables.json.PACKAGES_NOT_FOUND": "Liste mit Paketen, die während der CMake-Ausführung nicht gefunden wurden.",
	"assets/variables.json.PREDEFINED_TARGETS_FOLDER": "Name von FOLDER für Ziele, die von CMake automatisch hinzugefügt werden.",
	"assets/variables.json.PROPAGATE_TOP_LEVEL_INCLUDES_TO_TRY_COMPILE": "Wenn diese globale Eigenschaft auf TRUE festgelegt ist, wird die Variable CMAKE_PROJECT_TOP_LEVEL_INCLUDES in try_compile-Aufrufen weitergegeben, die die Signatur des ganzen Projekts verwenden. Aufrufe der Quelldateisignatur sind von dieser Eigenschaft nicht betroffen. PROPAGATE_TOP_LEVEL_INCLUDES_TO_TRY_COMPILE ist standardmäßig nicht festgelegt.",
	"assets/variables.json.REPORT_UNDEFINED_PROPERTIES": "Durch das Festlegen dieser Einstellung werden alle undefinierten Eigenschaften an diese Datei gemeldet.",
	"assets/variables.json.RULE_MESSAGES": "Geben Sie an, ob für jede make-Regel eine Meldung gemeldet werden soll.",
	"assets/variables.json.TARGET_ARCHIVES_MAY_BE_SHARED_LIBS": "Legen Sie fest, ob freigegebene Bibliotheken wie Archive benannt werden können.",
	"assets/variables.json.TARGET_MESSAGES": "Geben Sie an, ob die Vervollständigung der einzelnen Ziele gemeldet werden soll.",
	"assets/variables.json.TARGET_SUPPORTS_SHARED_LIBS": "Unterstützt die Zielplattform freigegebene Bibliotheken?",
	"assets/variables.json.USE_FOLDERS": "Steuert, ob die FOLDER-Zieleigenschaft verwendet werden soll, um Ziele in Ordnern zu organisieren. Der Wert von USE_FOLDERS am Ende der Datei „CMakeLists.txt“ der obersten Ebene bestimmt das Verhalten.",
	"assets/variables.json.XCODE_EMIT_EFFECTIVE_PLATFORM_NAME": "Kontrollieren Sie die Ausgabe von EFFECTIVE_PLATFORM_NAME durch den Xcode-Generator.",
	"assets/variables.json.CPACK_DESKTOP_SHORTCUTS": "Gibt eine Liste mit Verknüpfungsnamen an, die für diese Datei auf dem Desktop erstellt werden.",
	"assets/variables.json.CPACK_NEVER_OVERWRITE": "Fordern Sie an, dass diese Datei bei \"install\" oder \"reinstall\" nicht überschrieben wird.",
	"assets/variables.json.CPACK_PERMANENT": "Fordern Sie an dass diese Datei bei \"uninstall\" nicht entfernt wird.",
	"assets/variables.json.CPACK_STARTUP_SHORTCUTS": "Gibt eine Liste mit Verknüpfungsnamen an, die im Startordner für diese Datei erstellt werden.",
	"assets/variables.json.CPACK_START_MENU_SHORTCUTS": "Gibt eine Liste mit Verknüpfungsnamen an, die im Startmenü für diese Datei erstellt werden.",
	"assets/variables.json.CPACK_WIX_ACL": "Gibt Zugriffsberechtigungen für Dateien oder Verzeichnisse an, die durch einen WiX-Installer installiert wurden.",
	"assets/variables.json.ABSTRACT": "Ist diese Quelldatei eine abstrakte Klasse?",
	"assets/variables.json.AUTORCC_OPTIONS": "Zusätzliche Optionen für rcc beim Verwenden von AUTORCC",
	"assets/variables.json.AUTOUIC_OPTIONS": "Zusätzliche Optionen für uic beim Verwenden von AUTOUIC",
	"assets/variables.json.COMPILE_FLAGS": "Zusätzliche Flags, die beim Kompilieren dieser Quelldatei hinzugefügt werden sollen.",
	"assets/variables.json.CXX_SCAN_FOR_MODULES": "CXX_SCAN_FOR_MODULES ist ein boolescher Wert, der angibt, ob CMake die Quelle auf C++-Modulabhängigkeiten überprüft. Zielweite Einstellungen finden Sie auch im CXX_SCAN_FOR_MODULES.",
	"assets/variables.json.EXTERNAL_OBJECT": "Ist die Einstellung auf \"true\" gesetzt, handelt es sich um eine Objektdatei.",
	"assets/variables.json.Fortran_FORMAT": "Auf FIXED oder FREE setzen, um das Fortran-Quelllayout anzugeben.",
	"assets/variables.json.Fortran_PREPROCESS": "Hiermit wird gesteuert, ob die Fortran-Quelldatei ohne Bedingungen vorverarbeitet werden soll.",
	"assets/variables.json.GENERATED": "Wird diese Quelldatei als Teil des build- oder CMake-Prozesses generiert?",
	"assets/variables.json.HEADER_FILE_ONLY": "Ist diese Quelldatei nur eine Headerdatei?",
	"assets/variables.json.KEEP_EXTENSION": "Die Ausgabedatei soll die gleiche Erweiterung wie die Quelldatei haben.",
	"assets/variables.json.LANGUAGE": "Hiermit geben Sie die Programmiersprache an, in der eine Quelldatei geschrieben ist.",
	"assets/variables.json.LOCATION": "Der vollständige Pfad zu einer Quelldatei.",
	"assets/variables.json.MACOSX_PACKAGE_LOCATION": "Platzieren Sie eine Quelldatei in einem Anwendungsbundle (MACOSX_BUNDLE), Core Foundation-Paket (BUNDLE) oder Frameworkpaket (FRAMEWORK). Dies ist auf macOS oder iOS anwendbar.",
	"assets/variables.json.OBJECT_DEPENDS": "Zusätzliche Dateien, von denen eine kompilierte Objektdatei abhängig ist.",
	"assets/variables.json.OBJECT_OUTPUTS": "Zusätzliche Ausgaben für eine Ninja- oder Makefile-Generatorregel.",
	"assets/variables.json.SKIP_AUTOGEN": "Schließen Sie die Quelldatei aus der Verarbeitung mit AUTOMOC, AUTOUIC und AUTORCC aus (bei Qt-Projekten).",
	"assets/variables.json.SKIP_AUTOMOC": "Schließen Sie die Quelldatei aus der Verarbeitung mit AUTOMOC aus (bei Qt-Projekten).",
	"assets/variables.json.SKIP_AUTORCC": "Schließen Sie die Quelldatei aus der Verarbeitung mit AUTORCC aus (bei Qt-Projekten).",
	"assets/variables.json.SKIP_AUTOUIC": "Schließen Sie die Quelldatei aus der Verarbeitung mit AUTOUIC aus (bei Qt-Projekten).",
	"assets/variables.json.SKIP_LINTING": "Mit dieser Eigenschaft können Sie eine bestimmte Quelldatei aus dem Lintenprozess ausschließen. Der Lintenprozess umfasst das Ausführen von Tools wie <LANG>_CPPLINT, <LANG>_CLANG_TIDY, <LANG>_CPPCHECK und <LANG>_INCLUDE_WHAT_YOU_USE in den Quelldateien sowie das Kompilieren von Headerdateien als Teil von VERIFY_INTERFACE_HEADER_SETS. Wenn Sie SKIP_LINTING für eine Quelldatei festlegen, werden die erwähnten Lintentools für diese bestimmte Datei nicht ausgeführt.",
	"assets/variables.json.SKIP_PRECOMPILE_HEADERS": "Gibt an, ob diese Quelldatei vom PRECOMPILE_HEADERS-Feature übersprungen wird.",
	"assets/variables.json.SKIP_UNITY_BUILD_INCLUSION": "Durch eine Festlegung dieser Eigenschaft auf TRUE wird sichergestellt, dass die Quelldatei von Unity-Builds übersprungen wird, wenn die UNITY_BUILD-Eigenschaft des zugeordneten Ziels TRUE lautet. Die Quelldatei wird stattdessen separat und auf die gleiche Weise kompiliert wie bei deaktivierten Unity-Builds.",
	"assets/variables.json.Swift_DEPENDENCIES_FILE": "Diese Eigenschaft legt den Pfad der Swift-Abhängigkeitsdatei (swiftdeps) für die Quelle fest. Ist kein Pfad angegeben, wird standardmäßig \"<OBJECT>.swiftdeps\" verwendet.",
	"assets/variables.json.Swift_DIAGNOSTICS_FILE": "Diese Eigenschaft steuert, wo die Swift-Diagnose serialisiert wird.",
	"assets/variables.json.SYMBOLIC": "Ist dies nur ein Name für eine Regel?",
	"assets/variables.json.UNITY_GROUP": "Diese Eigenschaft steuert, welchem Bucket die Quelle zugeordnet wird, wenn UNITY_BUILD_MODE auf GROUP festgelegt ist.",
	"assets/variables.json.VS_COPY_TO_OUT_DIR": "Legt das <CopyToOutputDirectory>-Tag für eine Quelldatei in einer Visual Studio-Projektdatei fest. Gültige Werte sind Never, Always und PreserveNewest.",
	"assets/variables.json.VS_CSHARP_tagname": "Quelldateispezifische Konfiguration für Visual Studio und CSharp.",
	"assets/variables.json.VS_DEPLOYMENT_CONTENT": "Hiermit wird eine Quelldatei als Inhalt markiert, der über eine Windows Phone- oder Windows Store-Anwendung bereitgestellt wird, wenn für die Erstellung ein Visual Studio-Generator (<cmake-generators(7)>) verwendet wurde. Der Wert muss entweder auf 1 oder 0 festgelegt werden, und es können Generatorausdrücke (<cmake-generator-expressions(7)>) verwendet werden, damit die Auswahl auf der Buildkonfiguration basiert. Der .vcxproj-Dateieintrag für die Quelldatei wird für die Werte 1 bzw. 0 entweder als DeploymentContent oder ExcludedFromBuild gekennzeichnet.",
	"assets/variables.json.VS_DEPLOYMENT_LOCATION": "Hiermit wird der Bereitstellungsort für eine Inhaltsquelldatei bei einer Windows Phone- oder Windows Store-Anwendung angegeben, wenn für die Erstellung ein Visual Studio-Generator (<cmake-generators(7)>) verwendet wurde. Diese Eigenschaft ist nur bei Verwendung von VS_DEPLOYMENT_CONTENT anwendbar. Der Wert repräsentiert den relativen Pfad zum App-Paket und gilt für alle Konfigurationen.",
	"assets/variables.json.VS_INCLUDE_IN_VSIX": "Mit dieser booleschen Eigenschaft kann angegeben werden, ob die Datei in ein VSIX-Erweiterungspaket (Visual Studio Integration Extension) einbezogen wird. Dies ist für die Entwicklung von Visual Studio-Erweiterungen erforderlich.",
	"assets/variables.json.VS_RESOURCE_GENERATOR": "Diese Eigenschaft gibt den Ressourcengenerator an, der bei dieser Datei verwendet werden soll. Die Standardeinstellung ist PublicResXFileCodeGenerator.",
	"assets/variables.json.VS_SETTINGS": "Legen Sie alle Elementmetadaten für eine Datei fest.",
	"assets/variables.json.VS_SHADER_DISABLE_OPTIMIZATIONS": "Deaktivieren Sie Compileroptimierungen für eine .hlsl-Quelldatei. Dies fügt der Befehlszeile des FxCompiler-Tools das -Od-Flag hinzu. Geben Sie für diese Eigenschaft den Wert \"true\" an, um die Compileroptimierungen zu deaktivieren.",
	"assets/variables.json.VS_SHADER_ENABLE_DEBUG": "Aktivieren Sie Debuginformationen für eine .hlsl-Quelldatei. Dies fügt der Befehlszeile des FxCompiler-Tools das -Zi-Flag hinzu. Geben Sie den Wert \"true\" an, um Debuginformationen für den kompilierten Shader zu generieren.",
	"assets/variables.json.VS_SHADER_ENTRYPOINT": "Gibt den Namen des Einstiegspunkts für den Shader einer .hlsl-Quelldatei an.",
	"assets/variables.json.VS_SHADER_FLAGS": "Hiermit werden zusätzliche Visual Studio-Shaderflags einer HLSL-Quelldatei festgelegt.",
	"assets/variables.json.VS_SHADER_MODEL": "Gibt das Shadermodell einer .hlsl-Quelldatei an. Einige Shadertypen können nur mit aktuellen Shadermodellen verwendet werden.",
	"assets/variables.json.VS_SHADER_OBJECT_FILE_NAME": "Gibt einen Dateinamen für die kompilierte Shader-Objektdatei einer .hlsl-Quelldatei an. Dies fügt der Befehlszeile des FxCompiler-Tools das -Fo-Flag hinzu.",
	"assets/variables.json.VS_SHADER_OUTPUT_HEADER_FILE": "Legen Sie den Dateinamen der Ausgabeheaderdatei fest, die den Objektcode einer .hlsl-Quelldatei enthält.",
	"assets/variables.json.VS_SHADER_TYPE": "Hiermit wird der Visual Studio-Shadertyp einer HLSL-Quelldatei festgelegt.",
	"assets/variables.json.VS_SHADER_VARIABLE_NAME": "Legen Sie den Namen der Variable in der Headerdatei fest, die den Objektcode einer .hlsl-Quelldatei enthält.",
	"assets/variables.json.VS_TOOL_OVERRIDE": "Überschreiben Sie das Visual Studio-Standardtool, das auf die Quelldatei angewendet wird, mit einem neuen Tool, das nicht auf der Dateierweiterung basiert.",
	"assets/variables.json.VS_XAML_TYPE": "Hiermit wird eine XAML-Quelldatei mit einem anderen Typ als dem Standardwert \"Page\" gekennzeichnet. Die gängigste Verwendung ist eine Festlegung der Standarddatei \"App.xaml\" als \"ApplicationDefinition\".",
	"assets/variables.json.WRAP_EXCLUDE": "Schließen Sie diese Quelldatei von allen Code-Wrapping-Techniken aus.",
	"assets/variables.json.XCODE_EXPLICIT_FILE_TYPE": "Hiermit wird das Xcode-Attribut \"explicitFileType\" für dessen Verweis auf eine Quelldatei festgelegt. CMake berechnet basierend auf der Dateierweiterung einen Standardwert, der Wert kann jedoch mit dieser Eigenschaft explizit angegeben werden.",
	"assets/variables.json.XCODE_FILE_ATTRIBUTES": "Hiermit werden der Xcode-Einstellung ATTRIBUTES für dessen Verweis auf eine Quelldatei Werte hinzugefügt. Diese Eigenschaft kann unter anderem dazu genutzt werden, die Rolle für eine MIG-Datei festzulegen:",
	"assets/variables.json.XCODE_LAST_KNOWN_FILE_TYPE": "Legen Sie das Xcode-lastKnownFileType-Attribut für dessen Verweis auf eine Quelldatei fest. CMake berechnet basierend auf der Dateierweiterung einen Standardwert, kann jedoch auch explizit mit dieser Eigenschaft Berechnungen durchführen.",
	"assets/variables.json.ATTACHED_FILES": "Fügen Sie einer Dashboardübermittlung eine Dateiliste an.",
	"assets/variables.json.ATTACHED_FILES_ON_FAIL": "Fügen Sie einer Dashboardübermittlung eine Dateiliste an, falls der Test fehlschlägt.",
	"assets/variables.json.COST": "Diese Eigenschaft beschreibt die Kosten eines Tests. Wenn parallele Tests aktiviert sind, werden Tests im Testsatz in absteigender Reihenfolge der Kosten ausgeführt. Projekte können die Kosten eines Tests explizit definieren, indem diese Eigenschaft auf einen Gleitkommawert festgelegt wird.",
	"assets/variables.json.DEPENDS": "Gibt an, dass dieser Test erst nach allen in der Liste aufgeführten Tests ausgeführt wird.",
	"assets/variables.json.DISABLED": "Wird diese Eigenschaft auf TRUE festgelegt, wird der Test übersprungen und der Status auf \"Not Run\" festgelegt. Ein Test mit dem Status DISABLED wird in der Gesamtzahl der Tests nicht berücksichtigt, und sein Abschlussstatus wird als \"Disabled\" an CDash gemeldet.",
	"assets/variables.json.ENVIRONMENT": "Geben Sie Umgebungsvariablen an, die zum Ausführen eines Tests zu definieren sind.",
	"assets/variables.json.ENVIRONMENT_MODIFICATION": "Geben Sie Umgebungsvariablen an, die zum Ausführen eines Tests geändert werden sollen. Beachten Sie, dass die von dieser Eigenschaft ausgeführten Vorgänge ausgeführt werden, nachdem die ENVIRONMENT-Eigenschaft bereits angewendet wurde.",
	"assets/variables.json.FAIL_REGULAR_EXPRESSION": "Wenn die Testausgabe (stdout oder stderr) diesem regulären Ausdruck entspricht, tritt unabhängig vom Beendigungscode des Prozesses ein Testfehler auf. Tests, die das durch TIMEOUT angegebene Timeout überschreiten, schlagen unabhängig von FAIL_REGULAR_EXPRESSION fehl. Alle Testfehler ungleich Null für Rückgabecode oder Systemebene, einschließlich Segmentierungsfehlern, Signalabbrüchen oder Heapfehlern, führen auch dann zu einem Testfehler, wenn der reguläre Ausdruck nicht übereinstimmt.",
	"assets/variables.json.FIXTURES_CLEANUP": "Gibt eine Liste mit Fixtures an, für die der Test als Bereinigungstest zu verstehen ist. Diese Fixturenamen unterscheiden sich von den Testfallnamen und müssen keine Ähnlichkeit mit den Namen von Tests aufweisen, die mit ihnen in Zusammenhang stehen.",
	"assets/variables.json.FIXTURES_REQUIRED": "Gibt eine Liste mit Fixtures an, die für den Test vorausgesetzt wird. Bei Fixturenamen muss die Groß- und Kleinschreibung beachtet werden, und sie müssen keine Ähnlichkeit mit den Namen von Tests haben.",
	"assets/variables.json.FIXTURES_SETUP": "Gibt eine Liste mit Fixtures an, für die der Test als Einrichtungstest zu verstehen ist. Diese Fixturenamen unterscheiden sich von den Testfallnamen und müssen keine Ähnlichkeit mit den Namen von Tests aufweisen, die mit ihnen in Zusammenhang stehen.",
	"assets/variables.json.GENERATED_RESOURCE_SPEC_FILE": "Pfad zu der von diesem Test generierten dynamischen Ressourcenspezifikationsdatei <ctest-resource-dynamically-generated-spec-file>.",
	"assets/variables.json.MEASUREMENT": "Geben Sie eine CDASH-Maßeinheit und einen CDASH-Wert an, der für einen Test gemeldet werden soll.",
	"assets/variables.json.PASS_REGULAR_EXPRESSION": "Die Testausgabe (stdout oder stderr) muss mit diesem regulären Ausdruck übereinstimmen, damit der Test erfolgreich ausgeführt werden kann. Der Beendigungscode des Prozesses wird ignoriert. Tests, die das durch TIMEOUT angegebene Timeout überschreiten, können unabhängig von PASS_REGULAR_EXPRESSION weiterhin fehlschlagen. Testfehler auf Systemebene, einschließlich Segmentierungsfehlern, Signalabbrüchen oder Heapfehlern, können den Test auch dann nicht bestehen, wenn PASS_REGULAR_EXPRESSION übereinstimmen.",
	"assets/variables.json.PROCESSORS": "Mit dieser Einstellung legen Sie fest, wie viele Prozessslots für den Test erforderlich sind. Die Standardeinstellung ist 1 Prozessor.",
	"assets/variables.json.PROCESSOR_AFFINITY": "Setzen Sie diese Einstellung auf einen \"true\"-Wert, damit CTest den Testvorgang mit CPU-Affinität für einen festen Satz an Prozessoren startet. Wenn CTest aktiviert ist und für die aktuelle Plattform unterstützt wird, platziert CTest beim Starten des Testprozesses einen Satz Prozessoren in der CPU-Affinitätsmaske. Die Anzahl an Prozessoren im Satz wird durch die Testeigenschaft PROCESSORS oder die Anzahl an Prozessoren festgelegt, die CTest zur Verfügung stehen (je nachdem, welcher Wert kleiner ist). Der Satz der ausgewählten Prozessoren wird von den Prozessoren getrennt, die anderen parallel ausgeführten Tests zugeordnet sind, bei denen die Eigenschaft PROCESSOR_AFFINITY ebenfalls aktiviert ist.",
	"assets/variables.json.REQUIRED_FILES": "Eine Liste der Dateien, die zum Ausführen des Tests erforderlich sind. Die Dateinamen sind relativ zum Test WORKING_DIRECTORY, sofern kein absoluter Pfad angegeben wurde.",
	"assets/variables.json.RESOURCE_GROUPS": "Hiermit werden die für einen Test erforderlichen Ressourcen in einer für den Test sinnvollen Gruppierung angegeben. Weitere Informationen zur Integration dieser Eigenschaft in das CTest-Feature für die Ressourcenzuweisung finden Sie unter <ctest-resource-allocation>.",
	"assets/variables.json.RESOURCE_LOCK": "Geben Sie eine Liste mit Ressourcen an, die durch diesen Test gesperrt werden.",
	"assets/variables.json.RUN_SERIAL": "Führen Sie diesen Test nicht gleichzeitig mit anderen Tests aus.",
	"assets/variables.json.SKIP_REGULAR_EXPRESSION": "Wenn die Testausgabe (stderr oder stdout) diesem regulären Ausdruck entspricht, wird der Test unabhängig vom Beendigungscode des Prozesses als übersprungen markiert. Tests, die das durch TIMEOUT angegebene Timeout überschreiten, können unabhängig von SKIP_REGULAR_EXPRESSION weiterhin fehlschlagen. Testfehler auf Systemebene, einschließlich Segmentierungsfehlern, Signalabbrüchen oder Heapfehlern, können den Test auch dann als fehlerhaft kennzeichnen, wenn der reguläre Ausdruck übereinstimmt.",
	"assets/variables.json.SKIP_RETURN_CODE": "Rückgabecode, der einen Test als \"übersprungen\" kennzeichnet.",
	"assets/variables.json.TIMEOUT": "Gibt an, wie viele Sekunden dieser Test dauert.",
	"assets/variables.json.TIMEOUT_AFTER_MATCH": "Ändern Sie die Timeoutdauer eines Tests, nachdem in der Ausgabe eine übereinstimmende Zeile gefunden wurde.",
	"assets/variables.json.TIMEOUT_SIGNAL_GRACE_PERIOD": "Wenn die TIMEOUT_SIGNAL_NAME-Testeigenschaft festgelegt ist, gibt diese Eigenschaft die Anzahl der Sekunden an, die nach dem Senden des benutzerdefinierten Signals auf das Beenden eines Testprozesses gewartet werden soll. Andernfalls hat diese Eigenschaft keine Bedeutung.",
	"assets/variables.json.TIMEOUT_SIGNAL_NAME": "Geben Sie ein benutzerdefiniertes Signal an, das an einen Testprozess gesendet werden soll, wenn das Timeout erreicht ist. Dies ist nur auf Plattformen verfügbar, die POSIX-Signale unterstützen. Es ist unter Windows nicht verfügbar.",
	"assets/variables.json.WILL_FAIL": "Bei \"true\" werden die Erfolg-/Fehlertestkriterien invertiert. Tests, für die WILL_FAIL true ist, schlagen mit Rückgabecode 0 fehl, und bestehen mit Rückgabecode ungleich 0. Tests, die das durch TIMEOUT angegebene Timeout überschreiten, können unabhängig von WILL_FAIL weiterhin fehlschlagen. Testfehler auf Systemebene, einschließlich Segmentierungsfehlern, Signalabbrüchen oder Heapfehlern, können den Test auch dann als fehlerhaft kennzeichnen, wenn WILL_FAIL true ist.",
	"assets/variables.json.WORKING_DIRECTORY": "Das Verzeichnis, von dem die zu testende ausführbare Datei aufgerufen wird.",
	"assets/variables.json.AIX_EXPORT_ALL_SYMBOLS": "In AIX exportiert CMake automatisch alle Symbole aus freigegebenen Bibliotheken und ausführbaren Dateien, bei denen die ENABLE_EXPORTS-Zieleigenschaft aktiviert ist. Deaktivieren Sie diese boolesche Eigenschaft explizit, um dieses Verhalten zu unterdrücken und standardmäßig keine Symbole zu exportieren. In diesem Fall wird vorausgesetzt, dass das Projekt andere Methoden zum Exportieren von Symbolen verwendet.",
	"assets/variables.json.ALIASED_TARGET": "Name des Ziels, das durch dieses Ziel repräsentiert wird.",
	"assets/variables.json.ALIAS_GLOBAL": "Eine schreibgeschützte Eigenschaft, die angibt, ob ein ALIAS-Ziel global sichtbar ist.",
	"assets/variables.json.ANDROID_ANT_ADDITIONAL_OPTIONS": "Legen Sie die zusätzlichen Optionen für das Buildsystem Android Ant fest. Dies ist ein Zeichenfolgenwert, der alle Befehlszeilenoptionen für den Ant-Build enthält. Diese Eigenschaft wird durch den Wert der Variable CMAKE_ANDROID_ANT_ADDITIONAL_OPTIONS initialisiert, wenn sie beim Erstellen eines Ziels gesetzt wird.",
	"assets/variables.json.ANDROID_API": "Bei der Crosskompilierung für Android mit NVIDIA Nsight Tegra Visual Studio Edition legt diese Eigenschaft die Version der Android-Ziel-API fest (z. B. 15). Die Versionsnummer muss eine positive dezimale Ganzzahl sein. Diese Eigenschaft wird durch den Wert der Variable CMAKE_ANDROID_API initialisiert, wenn sie beim Erstellen eines Ziels festgelegt wird.",
	"assets/variables.json.ANDROID_API_MIN": "Legen Sie die Mindest-API-Version von Android fest (z. B. 9). Die Versionsnummer muss eine positive dezimale Ganzzahl sein. Diese Eigenschaft wird durch den Wert der Variable CMAKE_ANDROID_API_MIN initialisiert, wenn sie beim Erstellen eines Ziels festgelegt wird. Nativer Code wird mit dieser API-Version erstellt.",
	"assets/variables.json.ANDROID_ARCH": "Bei der Crosskompilierung für Android mit NVIDIA Nsight Tegra Visual Studio Edition legt diese Eigenschaft die Android-Zielarchitektur fest.",
	"assets/variables.json.ANDROID_ASSETS_DIRECTORIES": "Legen Sie fest, dass die Android-Ressourcenverzeichnisse vor dem Buildvorgang in den Ordner mit den Hauptressourcen kopiert werden. Dies ist eine Zeichenfolgeneigenschaft, die die mittels Semikolon getrennten Verzeichnispfade enthält. Diese Eigenschaft wird durch den Wert der Variable CMAKE_ANDROID_ASSETS_DIRECTORIES initialisiert, wenn sie beim Erstellen eines Ziels festgelegt wird.",
	"assets/variables.json.ANDROID_GUI": "Bei der Crosskompilierung für Android mit NVIDIA Nsight Tegra Visual Studio Edition gibt diese Eigenschaft an, ob unter Android eine ausführbare Datei als Anwendungspaket erstellt wird.",
	"assets/variables.json.ANDROID_JAR_DEPENDENCIES": "Legen Sie die Android-Eigenschaft fest, die JAR-Abhängigkeiten angibt. Dies ist eine Eigenschaft mit Zeichenfolgenwert. Diese Eigenschaft wird durch den Wert der Variable CMAKE_ANDROID_JAR_DEPENDENCIES initialisiert, wenn sie beim Erstellen eines Ziels festgelegt wird.",
	"assets/variables.json.ANDROID_JAR_DIRECTORIES": "Legen Sie die Android-Eigenschaft fest, die Verzeichnisse für die Suche von JAR-Bibliotheken angibt.",
	"assets/variables.json.ANDROID_JAVA_SOURCE_DIR": "Legen Sie die Android-Eigenschaft fest, die die Stammverzeichnisse des Java-Quellcodes definiert. Dies ist eine Zeichenfolgeneigenschaft, die die mittels Semikolon getrennten Verzeichnispfade enthält. Diese Eigenschaft wird durch den Wert der Variable CMAKE_ANDROID_JAVA_SOURCE_DIR initialisiert, wenn sie beim Erstellen eines Ziels festgelegt wird.",
	"assets/variables.json.ANDROID_NATIVE_LIB_DEPENDENCIES": "Legen Sie die Android-Eigenschaft fest, die die .so-Abhängigkeiten angibt. Dies ist eine Zeichenfolgeneigenschaft.",
	"assets/variables.json.ANDROID_NATIVE_LIB_DIRECTORIES": "Legen Sie die Android-Eigenschaft fest, die Verzeichnisse für die Suche von .so-Bibliotheken angibt.",
	"assets/variables.json.ANDROID_PROCESS_MAX": "Legen Sie die Android-Eigenschaft fest, die die maximale Anzahl paralleler Compilerprozesse des Android-NDK definiert (z. B. 4). Diese Eigenschaft wird durch den Wert der Variable CMAKE_ANDROID_PROCESS_MAX initialisiert, wenn sie beim Erstellen eines Ziels festgelegt wird.",
	"assets/variables.json.ANDROID_PROGUARD": "Wird diese Eigenschaft auf \"true\" gesetzt, wird der Code durch das ProGuard-Tool verkleinert, optimiert und verschleiert, indem ungenutzter Code entfernt wird und die Namen von Klassen, Feldern und Methoden durch semantisch unklare Namen ersetzt werden. Diese Eigenschaft wird durch den Wert der Variable CMAKE_ANDROID_PROGUARD initialisiert, wenn sie beim Erstellen eines Ziels festgelegt wird.",
	"assets/variables.json.ANDROID_PROGUARD_CONFIG_PATH": "Legen Sie die Android-Eigenschaft fest, die den Speicherort der ProGuard-Konfigurationsdatei enthält. Lassen Sie sie leer, um den Standard zu verwenden. Dies ist eine Zeichenfolgeneigenschaft, die den Pfad der ProGuard-Konfigurationsdatei enthält. Diese Eigenschaft wird durch den Wert der Variable CMAKE_ANDROID_PROGUARD_CONFIG_PATH initialisiert, wenn sie beim Erstellen eines Ziels festgelegt wird.",
	"assets/variables.json.ANDROID_SECURE_PROPS_PATH": "Legen Sie die Android-Eigenschaft fest, die den Speicherort der Datei der sicheren Eigenschaften angibt. Dies ist eine Zeichenfolgeneigenschaft, die den Dateipfad enthält. Diese Eigenschaft wird durch den Wert der Variable CMAKE_ANDROID_SECURE_PROPS_PATH initialisiert, wenn sie beim Erstellen eines Ziels festgelegt wird.",
	"assets/variables.json.ANDROID_SKIP_ANT_STEP": "Legen Sie die Android-Eigenschaft fest, die definiert, ob der Ant-Buildschritt übersprungen wird. Dies ist eine boolesche Eigenschaft, deren Initialisierung durch den Wert der Variable CMAKE_ANDROID_SKIP_ANT_STEP erfolgt, wenn sie beim Erstellen eines Ziels festgelegt wird.",
	"assets/variables.json.ANDROID_STL_TYPE": "Bei der Crosskompilierung für Android mit NVIDIA Nsight Tegra Visual Studio Edition gibt diese Eigenschaft die Art des STL-Supports für das Projekt an. Dies ist eine Zeichenfolgeneigenschaft, die auf einen der folgenden Werte gesetzt werden kann:",
	"assets/variables.json.ARCHIVE_OUTPUT_DIRECTORY": "Das Ausgabeverzeichnis, in dem XXX-Zieldateien erstellt werden.",
	"assets/variables.json.ARCHIVE_OUTPUT_DIRECTORY_CONFIG": "Ausgabeverzeichnis je Konfiguration für ARCHIVE-Zieldateien.",
	"assets/variables.json.ARCHIVE_OUTPUT_NAME": "Ausgabename für XXX-Zieldateien.",
	"assets/variables.json.ARCHIVE_OUTPUT_NAME_CONFIG": "Ausgabename je Konfiguration für ARCHIVE-Zieldateien.",
	"assets/variables.json.AUTOGEN_BETTER_GRAPH_MULTI_CONFIG": "AUTOGEN_BETTER_GRAPH_MULTI_CONFIG ist eine boolesche Eigenschaft, die auf einem Ziel festgelegt werden kann, um bessere Abhängigkeitsdiagramm für Generatoren mit mehreren Konfigurationen zu erhalten. Wenn diese Eigenschaft aktiviert ist, generiert CMake mehr Konfigurationsziele. Daher ist die Abhängigkeitsdiagramm für Generatoren mit mehreren Konfigurationen genauer, und einige Neukompilierungen werden vermieden.",
	"assets/variables.json.AUTOGEN_BUILD_DIR": "Das Verzeichnis, in dem AUTOMOC, AUTOUIC und AUTORCC Dateien für das Ziel generieren.",
	"assets/variables.json.AUTOGEN_COMMAND_LINE_LENGTH_MAX": "Grenzwert für die Befehlszeilenlänge für autogen-Ziele, d. h. „moc“ oder „uic“, der die Verwendung von Antwortdateien unter Windows auslöst, anstatt alle Argumente an die Befehlszeile zu übergeben.",
	"assets/variables.json.AUTOGEN_ORIGIN_DEPENDS": "Wechseln Sie zum Weiterleiten von Ursprungszielabhängigkeiten an das entsprechende <ORIGIN>_autogen-Ziel.",
	"assets/variables.json.AUTOGEN_PARALLEL": "Die Anzahl paralleler moc- oder uic-Prozesse, die bei Verwendung von AUTOMOC und AUTOUIC gestartet werden.",
	"assets/variables.json.AUTOGEN_TARGET_DEPENDS": "Zusätzliche Zielabhängigkeiten des entsprechenden <ORIGIN>_autogen-Ziels.",
	"assets/variables.json.AUTOGEN_USE_SYSTEM_INCLUDE": "AUTOGEN_USE_SYSTEM_INCLUDE ist eine boolesche Eigenschaft, die für ein Ziel festgelegt werden kann, um anzugeben, dass das Includeverzeichnis des autogen-Ziels als System-Includeverzeichnis oder normales Includeverzeichnis zum Ziel hinzugefügt werden soll.",
	"assets/variables.json.AUTOMOC": "Hiermit wird angegeben, ob das Ziel mit AUTOMOC verarbeitet werden soll (für Qt-Projekte).",
	"assets/variables.json.AUTOMOC_COMPILER_PREDEFINES": "Von AUTOMOC verwendeter boolescher Wert, der bestimmt, ob die Vordefinitionsdatei \"moc_predefs.h\" des Compilers generiert wird.",
	"assets/variables.json.AUTOMOC_DEPEND_FILTERS": "Von AUTOMOC verwendete Filterdefinitionen zur Extraktion von Dateinamen aus einer Quelldatei, die als zusätzliche Abhängigkeiten der MOC-Datei der Quelldatei registriert sind.",
	"assets/variables.json.AUTOMOC_EXECUTABLE": "AUTOMOC_EXECUTABLE ist ein Dateipfad, der für Dateien mit AUTOMOC-Aktivierung auf die ausführbare moc-Datei verweist. Durch das Festlegen dieser Eigenschaft überspringt CMake die automatische Erkennung der moc-Binärdatei sowie die üblicherweise ausgeführten Integritätsprüfungen, mit denen die Verfügbarkeit und ordnungsgemäße Funktion der Binärdatei sichergestellt wird.",
	"assets/variables.json.AUTOMOC_MACRO_NAMES": "Eine durch Semikolon getrennte Liste mit Makronamen. Sie wird von AUTOMOC verwendet, um zu bestimmen, ob eine C++-Datei von „moc“ verarbeitet werden muss.",
	"assets/variables.json.AUTOMOC_MOC_OPTIONS": "Zusätzliche Optionen für moc beim Verwenden von AUTOMOC",
	"assets/variables.json.AUTOMOC_PATH_PREFIX": "Wenn diese Eigenschaft auf ON festgelegt ist, generiert CMake für Qt-Ziele mit AUTOMOC-Aktivierung die Pfadpräfixoption \"-p\" für \"moc\".",
	"assets/variables.json.AUTORCC": "Hiermit wird angegeben, ob das Ziel mit AUTORCC verarbeitet werden soll (für Qt-Projekte).",
	"assets/variables.json.AUTORCC_EXECUTABLE": "AUTORCC_EXECUTABLE ist ein Dateipfad, der für Dateien mit AUTORCC-Aktivierung auf die ausführbare rcc-Datei verweist. Durch das Festlegen dieser Eigenschaft überspringt CMake die automatische Erkennung der rcc-Binärdatei sowie die üblicherweise ausgeführten Integritätsprüfungen, mit denen die Verfügbarkeit und ordnungsgemäße Funktion der Binärdatei sichergestellt wird.",
	"assets/variables.json.AUTOUIC": "Hiermit wird angegeben, ob das Ziel mit AUTOUIC verarbeitet werden soll (für Qt-Projekte).",
	"assets/variables.json.AUTOUIC_EXECUTABLE": "AUTOUIC_EXECUTABLE ist ein Dateipfad, der für Dateien mit AUTOUIC-Aktivierung auf die ausführbare uic-Datei verweist. Durch das Festlegen dieser Eigenschaft überspringt CMake die automatische Erkennung der uic-Binärdatei sowie die üblicherweise ausgeführten Integritätsprüfungen, mit denen die Verfügbarkeit und ordnungsgemäße Funktion der Binärdatei sichergestellt wird.",
	"assets/variables.json.AUTOUIC_SEARCH_PATHS": "Suchpfadliste, die von AUTOUIC verwendet wird, um enthaltene .ui-Dateien zu finden.",
	"assets/variables.json.BUILD_RPATH": "Eine durch Semikolons getrennte Liste mit RPATH-Einträgen (Runtime Path), die binären Dateien hinzugefügt werden sollen, die in der Buildstruktur verknüpft sind (für Plattformen, die dies unterstützen). Standardmäßig legt CMake den Laufzeitpfad von Binärdateien in der Buildstruktur so fest, dass er Suchpfade enthält, von denen es weiß, dass sie erforderlich sind, um die freigegebenen Bibliotheken zu finden, die sie verknüpfen. Projekte können BUILD_RPATH festlegen, um zusätzliche Suchpfade anzugeben.",
	"assets/variables.json.BUILD_RPATH_USE_ORIGIN": "Gibt an, ob relative Pfade für den RPATH-Wert des Builds verwendet werden sollen.",
	"assets/variables.json.BUILD_WITH_INSTALL_NAME_DIR": "BUILD_WITH_INSTALL_NAME_DIR ist ein boolescher Wert, der angibt, ob die macOS-Variable install_name eines Ziels im Buildbaum das von INSTALL_NAME_DIR bereitgestellte Verzeichnis verwendet. Diese Einstellung gilt nur für Ziele unter macOS.",
	"assets/variables.json.BUILD_WITH_INSTALL_RPATH": "BUILD_WITH_INSTALL_RPATH ist ein boolescher Wert, der angibt, ob das Ziel im Buildbaum mit INSTALL_RPATH verknüpft wird. Dies hat Vorrang gegenüber SKIP_BUILD_RPATH und macht eine erneute Verknüpfung vor der Installation überflüssig.",
	"assets/variables.json.BUNDLE": "Dieses Ziel ist ein CFBundle unter macOS.",
	"assets/variables.json.BUNDLE_EXTENSION": "Die Dateierweiterung, die unter macOS und iOS zum Benennen eines BUNDLE-, FRAMEWORK- oder MACOSX_BUNDLE-Ziels verwendet wird.",
	"assets/variables.json.COMMON_LANGUAGE_RUNTIME": "Durch das Festlegen dieser Zieleigenschaft wird das Ziel für einen Buildvorgang mit C++/CLI-Unterstützung konfiguriert.",
	"assets/variables.json.COMPATIBLE_INTERFACE_BOOL": "Eigenschaften, die mit ihrer Verknüpfungsschnittstelle kompatibel sein müssen",
	"assets/variables.json.COMPATIBLE_INTERFACE_NUMBER_MAX": "Eigenschaften, deren Maximalwert der Verknüpfungsschnittstelle verwendet wird.",
	"assets/variables.json.COMPATIBLE_INTERFACE_NUMBER_MIN": "Eigenschaften, deren Minimalwert der Verknüpfungsschnittstelle verwendet wird.",
	"assets/variables.json.COMPATIBLE_INTERFACE_STRING": "Eigenschaften, die mit ihrer Verknüpfungsschnittstelle zeichenfolgenkompatibel sein müssen",
	"assets/variables.json.COMPILE_FEATURES": "Für dieses Ziel aktivierte Compilerfeatures.",
	"assets/variables.json.COMPILE_PDB_NAME": "Ausgabename für die MS-Debugsymbol-.pdb-Datei, die der Compiler beim Erstellen von Quelldateien generiert.",
	"assets/variables.json.COMPILE_PDB_NAME_CONFIG": "Ausgabename (pro Konfiguration) für die MS-Debugsymbol-.pdb-Datei, die der Compiler beim Erstellen von Quelldateien generiert.",
	"assets/variables.json.COMPILE_PDB_OUTPUT_DIRECTORY": "Ausgabeverzeichnis für die MS-Debugsymbol-.pdb-Datei, die der Compiler beim Erstellen von Quelldateien generiert.",
	"assets/variables.json.COMPILE_PDB_OUTPUT_DIRECTORY_CONFIG": "Ausgabeverzeichnis (pro Konfiguration) für die MS-Debugsymbol-.pdb-Datei, die der Compiler beim Erstellen von Quelldateien generiert.",
	"assets/variables.json.COMPILE_WARNING_AS_ERROR": "Geben Sie an, ob Warnungen bei der Kompilierung als Fehler behandelt werden sollen. Wenn diese Option aktiviert ist, wird eine Kennzeichnung hinzugefügt, um Warnungen bei der Kompilierung als Fehler zu behandeln. Wenn die Option „cmake --compile-no-warning-as-error“ in der Befehlszeile von cmake angegeben ist, wird diese Eigenschaft ignoriert.",
	"assets/variables.json.CONFIG_OUTPUT_NAME": "Alter Zieldateibasisname (pro Konfiguration). Verwenden Sie stattdessen OUTPUT_NAME_.",
	"assets/variables.json.CONFIG_POSTFIX": "Postfix, das für Konfiguration <CONFIG> dem Namen der Zieldatei angehängt wird.",
	"assets/variables.json.CROSSCOMPILING_EMULATOR": "Führen Sie mit dem gegebenen Emulator bei der Crosskompilierung erstellte ausführbare Dateien aus. Für ausführbare Zielsystemdateien wird dieser Befehl den Befehlen \"add_test\", \"add_custom_command\" und \"add_custom_target\" als Präfix hinzugefügt.",
	"assets/variables.json.CUDA_ARCHITECTURES": "Eine Liste der Architekturen, für die der Gerätecode generiert werden soll.",
	"assets/variables.json.CUDA_CUBIN_COMPILATION": "Kompilieren Sie in Objektbibliotheken CUDA-Quellen zu CUBIN-Dateien (anstatt in OBJ-Dateien).",
	"assets/variables.json.CUDA_EXTENSIONS": "Ein boolescher Wert, der angibt, ob compilerspezifische Erweiterungen angefordert werden.",
	"assets/variables.json.CUDA_FATBIN_COMPILATION": "Kompilieren Sie in Objektbibliotheken CUDA-Quellen zu FATBIN-Dateien (anstatt in OBJ-Dateien).",
	"assets/variables.json.CUDA_OPTIX_COMPILATION": "Kompilieren Sie in Objektbibliotheken CUDA-Quellen zu OPTIXIR-Dateien (anstatt in OBJ-Dateien).",
	"assets/variables.json.CUDA_PTX_COMPILATION": "Kompilieren Sie in Objektbibliotheken CUDA-Quellen zu .ptx-Dateien (anstatt in .obj-Dateien).",
	"assets/variables.json.CUDA_RESOLVE_DEVICE_SYMBOLS": "Nur CUDA: Aktiviert bei Bedarf eine Geräteverknüpfung für das spezifische Bibliotheksziel.",
	"assets/variables.json.CUDA_RUNTIME_LIBRARY": "Hiermit wird die CUDA-Laufzeitbibliothek für Compiler ausgewählt, die CUDA als Zielsprache verwenden.",
	"assets/variables.json.CUDA_SEPARABLE_COMPILATION": "Nur CUDA: aktiviert das separate Kompilieren von Gerätecode.",
	"assets/variables.json.CUDA_STANDARD": "Der Cuda/C++-Standard, dessen Features zum Erstellen dieses Ziels angefordert werden.",
	"assets/variables.json.CUDA_STANDARD_REQUIRED": "Ein boolescher Wert, der beschreibt, ob der Wert von CUDA_STANDARD eine Anforderung darstellt.",
	"assets/variables.json.CXX_EXTENSIONS": "Ein boolescher Wert, der angibt, ob compilerspezifische Erweiterungen angefordert werden.",
	"assets/variables.json.CXX_MODULE_DIRS": "Semikolon-getrennte Liste der Basisverzeichnisse des Standard-C++-Modulsatzes des Ziels (d. h. des Dateisatzes mit Name und Typ CXX_MODULES). Die Eigenschaft unterstützt Generatorausdrücke <cmake-generator-expressions(7)>.",
	"assets/variables.json.CXX_MODULE_DIRS_NAME": "Semikolon-getrennte Liste der Basisverzeichnisse des <NAME> C++-Modulsatzes des Ziels, das den Satztyp CXX_MODULES hat. Die Eigenschaft unterstützt Generatorausdrücke <cmake-generator-expressions(7)>.",
	"assets/variables.json.CXX_MODULE_SET": "Semikolon-getrennte Liste von Dateien im Standard-C++-Modulsatz des Ziels (d. h. der Dateisatz mit Name und Typ CXX_MODULES). Wenn einer der Pfade relativ ist, werden sie relativ zum Quellverzeichnis des Ziels berechnet. Die Eigenschaft unterstützt Generatorausdrücke <cmake-generator-expressions(7)>.",
	"assets/variables.json.CXX_MODULE_SETS": "Schreibgeschützte Liste der PRIVATE- und PUBLIC C++-Modulsätze des Ziels (d. h. alle Dateisätze mit dem Typ CXX_MODULES). Dateien, die in diesen Dateisätzen aufgeführt sind, werden zum Zweck der IDE-Integration als Quelldateien behandelt.",
	"assets/variables.json.CXX_MODULE_SET_NAME": "Semikolon-getrennte Liste von Dateien im <NAME> C++-Modulsatz des Ziels, das den Satztyp CXX_MODULES hat. Wenn einer der Pfade relativ ist, werden sie relativ zum Quellverzeichnis des Ziels berechnet. Die Eigenschaft unterstützt Generatorausdrücke <cmake-generator-expressions(7)>.",
	"assets/variables.json.CXX_MODULE_STD": "CXX_MODULE_STD ist ein boolescher Wert, der angibt, ob das Ziel \"std import\", seine C++-Quellen verwenden darf oder nicht.",
	"assets/variables.json.CXX_STANDARD": "Der C++-Standard, dessen Features zum Erstellen dieses Ziels angefordert werden.",
	"assets/variables.json.CXX_STANDARD_REQUIRED": "Ein boolescher Wert, der beschreibt, ob der Wert von CXX_STANDARD eine Anforderung darstellt.",
	"assets/variables.json.C_EXTENSIONS": "Ein boolescher Wert, der angibt, ob compilerspezifische Erweiterungen angefordert werden.",
	"assets/variables.json.C_STANDARD": "Der C-Standard, dessen Features zum Erstellen dieses Ziels angefordert werden.",
	"assets/variables.json.C_STANDARD_REQUIRED": "Ein boolescher Wert, der beschreibt, ob der Wert von C_STANDARD eine Anforderung ist.",
	"assets/variables.json.DEBUG_POSTFIX": "Siehe Zieleigenschaft <CONFIG>_POSTFIX.",
	"assets/variables.json.DEFINE_SYMBOL": "Definieren Sie ein Symbol, wenn Sie die Quellen dieses Ziels kompilieren.",
	"assets/variables.json.DEPLOYMENT_ADDITIONAL_FILES": "Legen Sie AdditionalFiles des WinCE-Projekts in DeploymentTool in den .vcproj-Dateien fest, die durch Visual Studio-Generatoren erstellt wurden. Dies ist beim Debuggen auf einem Remote-WinCE-Gerät nützlich. Geben Sie zusätzliche Dateien an, die auf das Gerät kopiert werden, z. Beispiel:",
	"assets/variables.json.DEPLOYMENT_REMOTE_DIRECTORY": "Legen Sie RemoteDirectory des WinCE-Projekts in DeploymentTool und RemoteExecutable in DebuggerTool in den .vcproj-Dateien fest, die durch den Generator von Visual Studio-Generatoren erstellt wurden. Dies ist beim Debuggen auf einem Remote-WinCE-Gerät nützlich. Beispiel:",
	"assets/variables.json.DEPRECATION": "Meldung zu veralteten Features vom Entwickler des importierten Ziels.",
	"assets/variables.json.DISABLE_PRECOMPILE_HEADERS": "Hiermit wird die Vorkompilierung der Headerdateien deaktiviert, die durch die Eigenschaft PRECOMPILE_HEADERS angegeben werden.",
	"assets/variables.json.DLL_NAME_WITH_SOVERSION": "Diese Eigenschaft steuert, ob die SOVERSION-Zieleigenschaft dem Dateinamen der generierten DLL-Dateinamen für die Windows-Plattform hinzugefügt wird, die ausgewählt wird, wenn die WIN32-Variable festgelegt wird.",
	"assets/variables.json.DOTNET_SDK": "Geben Sie das .NET SDK für C#-Projekte an. Beispiel: Microsoft.NET.Sdk.",
	"assets/variables.json.DOTNET_TARGET_FRAMEWORK": "Hiermit wird die Version des .NET-Zielframeworks angegeben.",
	"assets/variables.json.DOTNET_TARGET_FRAMEWORK_VERSION": "Geben Sie die Version des .NET-Zielframeworks an.",
	"assets/variables.json.EchoString": "Eine Meldung, die beim Erstellen des Ziels angezeigt wird.",
	"assets/variables.json.ENABLE_EXPORTS": "Geben Sie an, ob eine ausführbare Datei oder eine freigegebene Bibliothek Symbole exportiert.",
	"assets/variables.json.EXCLUDE_FROM_DEFAULT_BUILD": "Hiermit wird das Ziel von \"Build Solution\" ausgeschlossen.",
	"assets/variables.json.EXCLUDE_FROM_DEFAULT_BUILD_CONFIG": "Die konfigurationsspezifische Version des Zielausschlusses von \"Build Solution\".",
	"assets/variables.json.EXPORT_COMPILE_COMMANDS": "Hiermit aktivieren/deaktivieren Sie die Ausgabe von Kompilierungsbefehlen für ein Ziel während der Erstellung.",
	"assets/variables.json.EXPORT_FIND_PACKAGE_NAME": "Steuern Sie den Paketnamen, der einem Abhängigkeitsziel zugeordnet ist, wenn Sie einen find_dependency Aufruf in der Installation oder im Export exportieren. Dies kann verwendet werden, um einem Paket, das von CMake erstellt und exportiert wird, einen Paketnamen zuzuweisen oder das Paket im find_package Aufruf außer Kraft zu setzen, der das Ziel erstellt hat.",
	"assets/variables.json.EXPORT_NAME": "Der exportierte Name für Zieldateien.",
	"assets/variables.json.EXPORT_NO_SYSTEM": "Diese Eigenschaft wirkt sich auf das Verhalten der Installations- und Exportbefehle aus, wenn das Ziel installiert bzw. exportiert wird. Wenn EXPORT_NO_SYSTEM auf WAHR festgelegt ist, generieren diese Befehle ein importiertes Ziel, wobei die SYSTEM-Eigenschaft auf FALSCH festgelegt ist.",
	"assets/variables.json.EXPORT_PROPERTIES": "Listen Sie zusätzliche Eigenschaften zum Export für ein Ziel auf.",
	"assets/variables.json.FOLDER": "Für IDEs, die Ziele mithilfe einer Ordnerhierarchie präsentieren, gibt diese Eigenschaft den Namen des Ordners an, unter dem das Ziel platziert werden soll. Um Ordner zu verschachteln, verwenden Sie FOLDER-Werte, z. B. GUI/Dialogfelder, mit /-Zeichen, die Ordnerebenen trennen. Ziele ohne FOLDER-Eigenschaft werden als Entitäten der obersten Ebene angezeigt. Ziele mit demselben FOLDER-Eigenschaftswert werden im selben Ordner wie gleichgeordnete Elemente angezeigt.",
	"assets/variables.json.Fortran_BUILDING_INSTRINSIC_MODULES": "Weist den CMake Fortran-Präprozessor an, dass das Ziel systeminterne Fortran-Funktionen zum Erstellen eines Fortran-Compilers erstellt.",
	"assets/variables.json.Fortran_MODULE_DIRECTORY": "Geben Sie das Ausgabeverzeichnis für Fortran-Module an, die vom Ziel bereitgestellt werden.",
	"assets/variables.json.FRAMEWORK": "Erstellen Sie unter macOS und iOS eine SHARED- oder STATIC-Bibliothek als Frameworkpaket.",
	"assets/variables.json.FRAMEWORK_MULTI_CONFIG_POSTFIX_CONFIG": "Ein Postfix, das an den Frameworkdateinamen für die Konfiguration <CONFIG> angehängt werden soll, wenn ein Generator mit Unterstützung für mehrere Konfigurationen (beispielsweise Xcode und Ninja Multi-Config) verwendet wird.",
	"assets/variables.json.FRAMEWORK_VERSION": "Version eines Frameworks, das mithilfe der Zieleigenschaft FRAMEWORK erstellt wurde (z. B. A).",
	"assets/variables.json.GENERATOR_FILE_NAME": "Die Datei des Generators für dieses Ziel.",
	"assets/variables.json.GHS_INTEGRITY_APP": "Ein boolescher Wert, der auf ON oder OFF festgelegt werden kann. Dieser Wert bestimmt, ob eine ausführbare Zieldatei als Integritätsanwendung betrachtet werden sollte.",
	"assets/variables.json.GHS_NO_SOURCE_GROUP_FILE": "Ein boolescher Wert, der auf ON oder OFF festgelegt werden kann. Dieser Wert steuert, ob die Projektdatei für ein Ziel eine einzelne Datei ist oder aus mehreren Dateien bestehen soll.",
	"assets/variables.json.GNUtoMS": "Konvertieren Sie eine GNU-Importbibliothek (.dll.a) in das MS-Format (.lib).",
	"assets/variables.json.HAS_CXX": "Stellen Sie mit dem C++-Linkertool eine Verknüpfung mit dem Ziel her (veraltet).",
	"assets/variables.json.HEADER_DIRS": "Semikolon-getrennte Liste der Basisverzeichnisse des Standard-Header-Sets des Ziels (d. h. des Dateisets mit Name und Typ HEADERS). Die Eigenschaft unterstützt Generatorausdrücke <cmake-generator-expressions(7)>.",
	"assets/variables.json.HEADER_DIRS_NAME": "Semikolon-getrennte Liste der Basisverzeichnisse des Header-Sets <NAME> des Ziels, das den Set-Typ HEADERS hat. Die Eigenschaft unterstützt Generatorausdrücke <cmake-generator-expressions(7)>.",
	"assets/variables.json.HEADER_SET": "Semikolon-getrennte Liste von Dateien im Standard-Header-Set des Ziels (d. h. das Datei-Set mit Name und Typ HEADERS). Wenn einer der Pfade relativ ist, werden sie relativ zum Quellverzeichnis des Ziels berechnet. Die Eigenschaft unterstützt Generatorausdrücke <cmake-generator-expressions(7)>.",
	"assets/variables.json.HEADER_SETS": "Schreibgeschützte Liste der PRIVATE- und PUBLIC-Header-Sets des Ziels (d. h. alle Datei-Sets mit dem Typ HEADERS). Dateien, die in diesen Dateigruppen aufgeführt sind, werden zum Zweck der IDE-Integration als Quelldateien behandelt. Die HEADER_FILE_ONLY-Eigenschaft der Dateien ist außerdem auf TRUE gesetzt.",
	"assets/variables.json.HEADER_SET_NAME": "Semikolon-getrennte Liste von Dateien im Header-Set <NAME> des Ziels, das den Set-Typ HEADERS hat. Wenn einer der Pfade relativ ist, werden sie relativ zum Quellverzeichnis des Ziels berechnet. Die Eigenschaft unterstützt Generatorausdrücke <cmake-generator-expressions(7)>.",
	"assets/variables.json.HIP_ARCHITECTURES": "Eine Liste der GPU-Architekturen, für die ein Gerätecode generiert werden soll. Architekturnamen werden auf der Grundlage von CMAKE_HIP_PLATFORM interpretiert.",
	"assets/variables.json.HIP_EXTENSIONS": "Ein boolescher Wert, der angibt, ob compilerspezifische Erweiterungen angefordert werden.",
	"assets/variables.json.HIP_STANDARD": "Der HIP/C++-Standard, der zum Erstellen dieses Ziels angefordert wurde.",
	"assets/variables.json.HIP_STANDARD_REQUIRED": "Boolescher Wert, der beschreibt, ob der Wert von HIP_STANDARD eine Anforderung ist.",
	"assets/variables.json.IMPORTED": "Schreibgeschützter Hinweis darauf, ob ein Ziel als IMPORTED gekennzeichnet ist.",
	"assets/variables.json.IMPORTED_COMMON_LANGUAGE_RUNTIME": "Zu definierende Eigenschaft, wenn das Ziel C++/CLI verwendet.",
	"assets/variables.json.IMPORTED_CONFIGURATIONS": "Bereitgestellte Konfigurationen für ein importiertes Ziel.",
	"assets/variables.json.IMPORTED_CXX_MODULES_COMPILE_DEFINITIONS": "Präprozessordefinitionen zum Kompilieren der C++-Modulquellen eines IMPORTED-Ziels.",
	"assets/variables.json.IMPORTED_CXX_MODULES_COMPILE_FEATURES": "Compilerfunktionen, die für die C++-Module dieses IMPORTIERTEN Ziels aktiviert sind.",
	"assets/variables.json.IMPORTED_CXX_MODULES_COMPILE_OPTIONS": "Liste der Optionen, die an den Compiler für die C++-Module dieses IMPORTIERTEN Ziels übergeben werden sollen.",
	"assets/variables.json.IMPORTED_CXX_MODULES_INCLUDE_DIRECTORIES": "Liste der Präprozessordateien, die Beim Kompilieren von C++-Modulen für IMPORTIERTE-Ziele Dateisuchverzeichnisse enthalten.",
	"assets/variables.json.IMPORTED_CXX_MODULES_LINK_LIBRARIES": "Liste der direkten Abhängigkeiten, die für Verwendungsanforderungen für C++-Module in den C++-Modulen des Ziels verwendet werden sollen.",
	"assets/variables.json.IMPORTED_GLOBAL": "Hinweis darauf, ob ein als IMPORTED gekennzeichnetes Ziel global sichtbar ist.",
	"assets/variables.json.IMPORTED_IMPLIB": "Vollständiger Pfad zur Importbibliothek für ein als IMPORTED gekennzeichnetes Ziel.",
	"assets/variables.json.IMPORTED_IMPLIB_CONFIG": "<CONFIG>-spezifische Version der Eigenschaft IMPORTED_IMPLIB.",
	"assets/variables.json.IMPORTED_LIBNAME": "Geben Sie den Namen der Verknüpfungsbibliothek für eine importierte Schnittstellenbibliothek an.",
	"assets/variables.json.IMPORTED_LIBNAME_CONFIG": "<CONFIG>-spezifische Version der Eigenschaft IMPORTED_LIBNAME.",
	"assets/variables.json.IMPORTED_LINK_DEPENDENT_LIBRARIES": "Abhängige freigegebene Bibliotheken einer importierten freigegebenen Bibliothek.",
	"assets/variables.json.IMPORTED_LINK_DEPENDENT_LIBRARIES_CONFIG": "<CONFIG>-spezifische Version von IMPORTED_LINK_DEPENDENT_LIBRARIES.",
	"assets/variables.json.IMPORTED_LINK_INTERFACE_LANGUAGES": "Sprachen, die in eine als IMPORTED gekennzeichnete statische Bibliothek kompiliert wurden.",
	"assets/variables.json.IMPORTED_LINK_INTERFACE_LANGUAGES_CONFIG": "<CONFIG>-spezifische Version von IMPORTED_LINK_INTERFACE_LANGUAGES.",
	"assets/variables.json.IMPORTED_LINK_INTERFACE_LIBRARIES": "Transitive Verknüpfungsschnittstelle eines als IMPORTED gekennzeichneten Ziels.",
	"assets/variables.json.IMPORTED_LINK_INTERFACE_LIBRARIES_CONFIG": "<CONFIG>-spezifische Version von IMPORTED_LINK_INTERFACE_LIBRARIES.",
	"assets/variables.json.IMPORTED_LINK_INTERFACE_MULTIPLICITY": "Wiederholungsanzahl für Zyklen von als IMPORTED gekennzeichneten statischen Bibliotheken.",
	"assets/variables.json.IMPORTED_LINK_INTERFACE_MULTIPLICITY_CONFIG": "<CONFIG>-spezifische Version von IMPORTED_LINK_INTERFACE_MULTIPLICITY.",
	"assets/variables.json.IMPORTED_LOCATION": "Vollständiger Pfad zur Hauptdatei auf dem Datenträger für ein als IMPORTED gekennzeichnetes Ziel.",
	"assets/variables.json.IMPORTED_LOCATION_CONFIG": "<CONFIG>-spezifische Version der Eigenschaft IMPORTED_LOCATION.",
	"assets/variables.json.IMPORTED_NO_SONAME": "Hiermit wird angegeben, dass eine als IMPORTED gekennzeichnete freigegebene Zielbibliothek keinen \"soname\" aufweist.",
	"assets/variables.json.IMPORTED_NO_SONAME_CONFIG": "<CONFIG>-spezifische Version der Eigenschaft IMPORTED_NO_SONAME.",
	"assets/variables.json.IMPORTED_NO_SYSTEM": "Wenn IMPORTED_NO_SYSTEM auf einem importierten Ziel auf WAHR festgelegt wird, wird dadurch angegeben, dass es sich nicht um ein Systemziel handelt. Dies hat folgende Auswirkungen:",
	"assets/variables.json.IMPORTED_OBJECTS": "Eine durch Semikolon getrennte Liste mit absoluten Pfaden zu den Objektdateien auf dem Datenträger für eine importierte Objektbibliothek.",
	"assets/variables.json.IMPORTED_OBJECTS_CONFIG": "<CONFIG>-spezifische Version der Eigenschaft IMPORTED_OBJECTS.",
	"assets/variables.json.IMPORTED_SONAME": "Der \"soname\" einer als IMPORTED gekennzeichneten freigegebenen Zielbibliothek.",
	"assets/variables.json.IMPORTED_SONAME_CONFIG": "<CONFIG>-spezifische Version der Eigenschaft IMPORTED_SONAME.",
	"assets/variables.json.IMPORT_PREFIX": "Gibt an, welche Informationen vor dem Namen der Importbibliothek erscheinen.",
	"assets/variables.json.IMPORT_SUFFIX": "Gibt an, welche Informationen nach dem Namen der Importbibliothek erscheinen.",
	"assets/variables.json.INSTALL_NAME_DIR": "Verzeichnisname für installierte Ziele auf Apple-Plattformen.",
	"assets/variables.json.INSTALL_REMOVE_ENVIRONMENT_RPATH": "Hiermit wird gesteuert, ob über die Toolkette definierte rpath-Werte während der Installation entfernt werden sollen.",
	"assets/variables.json.INSTALL_RPATH": "Der rpath zur Verwendung für installierte Ziele.",
	"assets/variables.json.INSTALL_RPATH_USE_LINK_PATH": "Fügen Sie der Linkersuche und dem installierten rpath Pfade hinzu.",
	"assets/variables.json.INTERFACE_AUTOMOC_MACRO_NAMES": "Eine durch Semikolons getrennte Liste von Makronamen für AUTOMOC, die an Consumer weitergegeben werden sollen.",
	"assets/variables.json.INTERFACE_AUTOUIC_OPTIONS": "Liste mit Schnittstellenoptionen, die an uic übergeben werden.",
	"assets/variables.json.INTERFACE_COMPILE_DEFINITIONS": "Liste mit öffentlichen property_name-Anforderungen für eine Bibliothek.",
	"assets/variables.json.INTERFACE_COMPILE_FEATURES": "Liste mit öffentlichen property_name-Anforderungen für eine Bibliothek.",
	"assets/variables.json.INTERFACE_COMPILE_OPTIONS": "Liste mit öffentlichen property_name-Anforderungen für eine Bibliothek.",
	"assets/variables.json.INTERFACE_CXX_MODULE_SETS": "Schreibgeschützte Liste der PUBLIC C++-Modulsätze des Ziels (d. h. alle Dateisätze mit dem Typ CXX_MODULES). Dateien, die in diesen C++-Modulsätzen aufgeführt sind, können mit „install“ installiert und mit „export“ installiert und exportiert werden.",
	"assets/variables.json.INTERFACE_HEADER_SETS": "Nur-Lese-Liste der INTERFACE- und PUBLIC-Header-Sets des Ziels (d. h. alle Datei-Sets mit dem Typ HEADERS). In diesen Header-Sets aufgelistete Dateien können mit install installiert und mit install and export exportiert werden.",
	"assets/variables.json.INTERFACE_HEADER_SETS_TO_VERIFY": "Wird verwendet, um anzugeben, welche ÖFFENTLICHEN und SCHNITTSTELLEN-Headersätze eines Ziels überprüft werden sollen.",
	"assets/variables.json.INTERFACE_INCLUDE_DIRECTORIES": "Liste mit öffentlichen property_name-Anforderungen für eine Bibliothek.",
	"assets/variables.json.INTERFACE_LINK_DEPENDS": "Zusätzliche öffentliche Schnittstellendateien, von denen eine Zielbinärdatei zur Verknüpfung abhängig ist.",
	"assets/variables.json.INTERFACE_LINK_DIRECTORIES": "Liste mit öffentlichen property_name-Anforderungen für eine Bibliothek.",
	"assets/variables.json.INTERFACE_LINK_LIBRARIES": "Listen Sie öffentliche Schnittstellenbibliotheken für eine Bibliothek auf.",
	"assets/variables.json.INTERFACE_LINK_LIBRARIES_DIRECT": "Liste der Bibliotheken, die Consumer dieser Bibliothek als direkte Linkabhängigkeiten behandeln sollten.",
	"assets/variables.json.INTERFACE_LINK_LIBRARIES_DIRECT_EXCLUDE": "Liste der Bibliotheken, die Consumer dieser Bibliothek nicht als direkte Linkabhängigkeiten behandeln sollten.",
	"assets/variables.json.INTERFACE_LINK_OPTIONS": "Liste mit öffentlichen property_name-Anforderungen für eine Bibliothek.",
	"assets/variables.json.INTERFACE_POSITION_INDEPENDENT_CODE": "Gibt an, ob Consumer ein positionsunabhängiges Ziel erstellen müssen",
	"assets/variables.json.INTERFACE_PRECOMPILE_HEADERS": "Eine Liste der Schnittstellen-Headerdateien, die für Consumerziele vorkompiliert werden sollen.",
	"assets/variables.json.INTERFACE_SOURCES": "Liste der Schnittstellenquellen, die in verbrauchende Ziele kompiliert werden.",
	"assets/variables.json.INTERFACE_SYSTEM_INCLUDE_DIRECTORIES": "Liste öffentlicher systembezogener Includeverzeichnisse für eine Bibliothek.",
	"assets/variables.json.IOS_INSTALL_COMBINED": "Erstellen Sie bei der Installation ein kombiniertes (Gerät und Simulator) Ziel.",
	"assets/variables.json.ISPC_HEADER_DIRECTORY": "Hiermit wird das relative Ausgabeverzeichnis für ISPC-Header angegeben, die vom Ziel bereitgestellt werden.",
	"assets/variables.json.ISPC_HEADER_SUFFIX": "Hiermit geben Sie das zu verwendende Ausgabesuffix für Header an, die von ISPC generiert und vom Ziel bereitgestellt werden.",
	"assets/variables.json.ISPC_INSTRUCTION_SETS": "Eine Liste der Befehlssatzarchitekturen, für die Code generiert werden soll.",
	"assets/variables.json.JOB_POOL_COMPILE": "Nur Ninja: Pool, der zum Kompilieren verwendet wird.",
	"assets/variables.json.JOB_POOL_LINK": "Nur Ninja: Pool, der zum Verknüpfen verwendet wird.",
	"assets/variables.json.JOB_POOL_PRECOMPILE_HEADER": "Nur Ninja: Ein Pool, der zum Generieren vorkompilierter Header verwendet wird.",
	"assets/variables.json.LANG_CLANG_TIDY": "Diese Eigenschaft wird nur implementiert, wenn <LANG>einen der folgenden Werte aufweist: C, CXX, OBJC, OBJCXX.",
	"assets/variables.json.LANG_CLANG_TIDY_EXPORT_FIXES_DIR": "Diese Eigenschaft wird nur implementiert, wenn <LANG> „C“, „CXX“, „OBJC“ oder „OBJCXX“ ist und ist nur dann wirksam, wenn <LANG>_CLANG_TIDY festgelegt ist.",
	"assets/variables.json.LANG_COMPILER_LAUNCHER": "Diese Eigenschaft wird nur implementiert, wenn <LANG>einen der folgenden Werte aufweist: C, CXX, Fortran, HIP, ISPC, OBJC, OBJCXX oder CUDA.",
	"assets/variables.json.LANG_CPPCHECK": "Diese Eigenschaft wird nur unterstützt, wenn <LANG> C oder CXX ist.",
	"assets/variables.json.LANG_CPPLINT": "Diese Eigenschaft wird nur unterstützt, wenn <LANG> C oder CXX ist.",
	"assets/variables.json.LANG_EXTENSIONS": "Die Variationen sind:",
	"assets/variables.json.LANG_INCLUDE_WHAT_YOU_USE": "Diese Eigenschaft wird nur implementiert, wenn <LANG> C oder CXX ist.",
	"assets/variables.json.LANG_LINKER_LAUNCHER": "Diese Eigenschaft wird nur implementiert, wenn <LANG> einen der folgenden Werte aufweist: C, CXX, OBJC oder OBJCXX.",
	"assets/variables.json.LANG_STANDARD": "Die Variationen sind:",
	"assets/variables.json.LANG_STANDARD_REQUIRED": "Die Variationen sind:",
	"assets/variables.json.LANG_VISIBILITY_PRESET": "Wert für Kompilierungsflags zur Sichtbarkeit von Symbolen",
	"assets/variables.json.LIBRARY_OUTPUT_DIRECTORY": "Das Ausgabeverzeichnis, in dem XXX-Zieldateien erstellt werden.",
	"assets/variables.json.LIBRARY_OUTPUT_DIRECTORY_CONFIG": "Ausgabeverzeichnis (pro Konfiguration) für LIBRARY-Zieldateien.",
	"assets/variables.json.LIBRARY_OUTPUT_NAME": "Ausgabename für XXX-Zieldateien.",
	"assets/variables.json.LIBRARY_OUTPUT_NAME_CONFIG": "Ausgabename (pro Konfiguration) für LIBRARY-Zieldateien.",
	"assets/variables.json.LINKER_LANGUAGE": "Gibt die Sprache an, deren Compiler den Linker aufruft.",
	"assets/variables.json.LINKER_TYPE": "Geben Sie an, welcher Linker für den Linkschritt verwendet werden soll. Der Eigenschaftswert kann Generatorausdrücke <cmake-generator-expressions(7)> verwenden.",
	"assets/variables.json.LINK_DEPENDS": "Zusätzliche Dateien, von denen eine Zielbinärdatei zur Verknüpfung abhängig ist.",
	"assets/variables.json.LINK_DEPENDS_NO_SHARED": "Abhängigkeit von verknüpften freigegebenen Bibliotheksdateien verhindern.",
	"assets/variables.json.LINK_FLAGS": "Zusätzliche Flags zum Verknüpfen dieses Ziels, falls es sich um eine freigegebene Bibliothek, eine freigegebene Modulbibliothek oder eine freigegebene ausführbare Datei handelt. Für statische Bibliotheken muss die Eigenschaft STATIC_LIBRARY_OPTIONS oder STATIC_LIBRARY_FLAGS verwendet werden.",
	"assets/variables.json.LINK_FLAGS_CONFIG": "Konfigurationsspezifische Linkerflags für ein SHARED LIBRARY-, MODULE- oder EXECUTABLE-Ziel.",
	"assets/variables.json.LINK_INTERFACE_LIBRARIES": "Liste öffentlicher Schnittstellenbibliotheken für eine freigegebene Bibliothek oder freigegebene ausführbare Datei.",
	"assets/variables.json.LINK_INTERFACE_LIBRARIES_CONFIG": "Liste (pro Konfiguration) öffentlicher Schnittstellenbibliotheken für ein Ziel.",
	"assets/variables.json.LINK_INTERFACE_MULTIPLICITY": "Wiederholungsanzahl für STATIC-Bibliotheken mit zyklischen Abhängigkeiten.",
	"assets/variables.json.LINK_INTERFACE_MULTIPLICITY_CONFIG": "Wiederholungsanzahl (pro Konfiguration) von STATIC-Bibliotheken.",
	"assets/variables.json.LINK_LIBRARIES": "Liste mit direkten Verknüpfungsabhängigkeiten.",
	"assets/variables.json.LINK_LIBRARIES_ONLY_TARGETS": "Erzwingen Sie, dass Link-Elemente, die Zielnamen sein können, tatsächlich vorhandene Ziele sind.",
	"assets/variables.json.LINK_LIBRARY_OVERRIDE": "Überschreiben Sie die Bibliotheksfunktionen, die Bibliotheken aus LINK_LIBRARY-Generatorausdrücken zugeordnet sind. Dies kann verwendet werden, um inkompatible Bibliotheksfeatures aufzulösen, die sich aus der Angabe verschiedener Features für dieselbe Bibliothek in verschiedenen LINK_LIBRARY-Generatorausdrücken ergeben.",
	"assets/variables.json.LINK_LIBRARY_OVERRIDE_LIBRARY": "Überschreiben Sie das Bibliotheksfeature, das <LIBRARY> zugeordnet ist, mit LINK_LIBRARY-Generatorausdrücken. Dies kann verwendet werden, um inkompatible Bibliotheksfeatures aufzulösen, die sich aus der Angabe verschiedener Features für <LIBRARY> in verschiedenen LINK_LIBRARY-Generatorausdrücken ergeben.",
	"assets/variables.json.LINK_SEARCH_END_STATIC": "Beenden Sie eine Verknüpfungszeile so, dass statische Systembibliotheken verwendet werden.",
	"assets/variables.json.LINK_SEARCH_START_STATIC": "Nehmen Sie an, dass der Linker standardmäßig nach statischen Bibliotheken sucht.",
	"assets/variables.json.LINK_WHAT_YOU_USE": "Dies ist eine boolesche Option, die bei Festlegung auf TRUE den Inhalt der Variablen CMAKE_LINK_WHAT_YOU_USE_CHECK automatisch auf dem Ziel ausführt, nachdem sie verknüpft wurde. Darüber hinaus wird das von der Variablen CMAKE_<LANG>_LINK_WHAT_YOU_USE_FLAG angegebene Linkerflag mit dem Linkbefehl an das Ziel übergeben, sodass alle in der Befehlszeile angegebenen Bibliotheken mit dem Ziel verknüpft werden. Dies führt dazu, dass der Link eine Liste von Bibliotheken erstellt, die keine Symbole bereitstellen, die von diesem Ziel verwendet werden, aber mit ihm verknüpft sind.",
	"assets/variables.json.LOCATION_CONFIG": "Schreibgeschützte Eigenschaft, die einen Zielspeicherort auf dem Datenträger bereitstellt.",
	"assets/variables.json.MACHO_COMPATIBILITY_VERSION": "Hiermit wird die kompatible Versionsnummer dieses Ziels für Mach-O-Binärdateien angegeben.",
	"assets/variables.json.MACHO_CURRENT_VERSION": "Hiermit wird die aktuelle Versionsnummer dieses Ziels für Mach-O-Binärdateien angegeben.",
	"assets/variables.json.MACOSX_BUNDLE": "Erstellen Sie unter macOS oder iOS eine ausführbare Datei als Anwendungsbundle.",
	"assets/variables.json.MACOSX_BUNDLE_INFO_PLIST": "Geben Sie für ein macOS- oder iOS-Anwendungsbundle eine benutzerdefinierte Info.plist-Vorlage an",
	"assets/variables.json.MACOSX_FRAMEWORK_INFO_PLIST": "Geben Sie für ein macOS- oder iOS-Framework eine benutzerdefinierte Info.plist-Vorlage an",
	"assets/variables.json.MACOSX_RPATH": "Gibt an, ob dieses Ziel mit rpaths unter macOS oder iOS während der Laufzeit gefunden wird.",
	"assets/variables.json.MANUALLY_ADDED_DEPENDENCIES": "Rufen Sie Abhängigkeiten ab, die anderen Zielen der obersten Ebene hinzugefügt wurden.",
	"assets/variables.json.MAP_IMPORTED_CONFIG_CONFIG": "Zuordnung von der Projektkonfiguration zur Konfiguration des importierten Ziels.",
	"assets/variables.json.MSVC_DEBUG_INFORMATION_FORMAT": "Wählen Sie das Format der Debuggen-Informationen, wenn Sie die MSVC-ABI verwenden.",
	"assets/variables.json.MSVC_RUNTIME_LIBRARY": "Hiermit wird die MSVC-Laufzeitbibliothek für Compiler ausgewählt, die MSVC ABI als Ziel verwenden.",
	"assets/variables.json.NAME": "Logischer Name des Ziels.",
	"assets/variables.json.NO_SONAME": "Hiermit wird angegeben, ob beim Verknüpfen einer freigegebenen Bibliothek \"soname\" festgelegt werden soll.",
	"assets/variables.json.NO_SYSTEM_FROM_IMPORTED": "Behandeln Sie Includeverzeichnisse der Schnittstellen genutzter importierter Ziele nicht als Systemverzeichnisse.",
	"assets/variables.json.OBJCXX_EXTENSIONS": "Ein boolescher Wert, der angibt, ob compilerspezifische Erweiterungen angefordert werden.",
	"assets/variables.json.OBJCXX_STANDARD": "Der ObjC++-Standard, dessen Features zum Erstellen dieses Ziels angefordert werden.",
	"assets/variables.json.OBJCXX_STANDARD_REQUIRED": "Ein boolescher Wert, der beschreibt, ob der Wert von OBJCXX_STANDARD eine Anforderung ist.",
	"assets/variables.json.OBJC_EXTENSIONS": "Ein boolescher Wert, der angibt, ob compilerspezifische Erweiterungen angefordert werden.",
	"assets/variables.json.OBJC_STANDARD": "Der OBJC-Standard, dessen Features zum Erstellen dieses Ziels angefordert werden.",
	"assets/variables.json.OBJC_STANDARD_REQUIRED": "Ein boolescher Wert, der beschreibt, ob der Wert von OBJC_STANDARD eine Anforderung ist.",
	"assets/variables.json.OPTIMIZE_DEPENDENCIES": "Hiermit wird die Abhängigkeitsoptimierung von statischen Bibliotheken und Objektbibliotheken aktiviert.",
	"assets/variables.json.OSX_ARCHITECTURES": "Zielspezifische Architekturen für macOS.",
	"assets/variables.json.OSX_ARCHITECTURES_CONFIG": "macOS- und iOS-Binärarchitekturen (pro Konfiguration) für ein Ziel.",
	"assets/variables.json.OUTPUT_NAME": "Ausgabename für Zieldateien.",
	"assets/variables.json.OUTPUT_NAME_CONFIG": "Basisname der Zieldatei (pro Konfiguration).",
	"assets/variables.json.PCH_INSTANTIATE_TEMPLATES": "Wenn diese Eigenschaft auf TRUE festgelegt ist, enthalten die Compileroptionen für vorkompilierte Header ein Flag zum Instanziieren von Vorlagen während der Generierung des PCH, sofern dies unterstützt wird. Dadurch können die Kompilierzeiten erheblich verbessert werden. Diese Option wird in Clang ab Version 11 unterstützt.",
	"assets/variables.json.PCH_WARN_INVALID": "Wenn diese Eigenschaft auf TRUE festgelegt ist, enthalten die Compileroptionen zum Vorkompilieren von Headern ein Compilerflag zum Warnen vor ungültigen vorkompilierten Headern. Beispiel: \"-Winvalid-pch\" für den GNU-Compiler.",
	"assets/variables.json.PDB_NAME": "Ausgabename der MS-Debugsymbol-.pdb-Datei, die vom Linker für das Ziel ausführbare Datei oder freigegebene Bibliothek generiert wurde.",
	"assets/variables.json.PDB_NAME_CONFIG": "Ausgabename (pro Konfiguration) der MS-Debugsymbol-.pdb-Datei, die vom Linker für das Ziel ausführbare Datei oder freigegebene Bibliothek generiert wurde.",
	"assets/variables.json.PDB_OUTPUT_DIRECTORY": "Ausgabeverzeichnis der MS-Debugsymbol-.pdb-Datei, die vom Linker für das Ziel ausführbare Datei oder freigegebene Bibliothek generiert wurde.",
	"assets/variables.json.PDB_OUTPUT_DIRECTORY_CONFIG": "Ausgabeverzeichnis (pro Konfiguration) der MS-Debugsymbol-.pdb-Datei, die vom Linker für das Ziel ausführbare Datei oder freigegebene Bibliothek generiert wurde.",
	"assets/variables.json.POSITION_INDEPENDENT_CODE": "Gibt an, ob ein positionsunabhängiges Ziel erstellt wird",
	"assets/variables.json.POST_INSTALL_SCRIPT": "Veraltete Installationsunterstützung.",
	"assets/variables.json.PRECOMPILE_HEADERS": "Eine Liste der Headerdateien, die vorkompiliert werden sollen.",
	"assets/variables.json.PRECOMPILE_HEADERS_REUSE_FROM": "Das Ziel, aus dem das Buildartefakt für vorkompilierte Header wiederverwendet werden soll.",
	"assets/variables.json.PREFIX": "Gibt an, welche Informationen vor dem Namen der Bibliothek erscheinen.",
	"assets/variables.json.PRE_INSTALL_SCRIPT": "Veraltete Installationsunterstützung.",
	"assets/variables.json.PRIVATE_HEADER": "Geben Sie in einem FRAMEWORK private Headerdateien für ein Ziel freigegebene Bibliothek an.",
	"assets/variables.json.PROJECT_LABEL": "Ändern Sie in einer IDE den Namen eines Ziels.",
	"assets/variables.json.PUBLIC_HEADER": "Geben Sie in einem FRAMEWORK in einem Ziel freigegebene Bibliothek öffentliche Headerdateien an.",
	"assets/variables.json.RESOURCE": "Geben Sie Ressourcendateien in einem FRAMEWORK oder BUNDLE an.",
	"assets/variables.json.RUNTIME_OUTPUT_DIRECTORY": "Das Ausgabeverzeichnis, in dem XXX-Zieldateien erstellt werden.",
	"assets/variables.json.RUNTIME_OUTPUT_DIRECTORY_CONFIG": "Ausgabeverzeichnis (pro Konfiguration) für RUNTIME-Zieldateien.",
	"assets/variables.json.RUNTIME_OUTPUT_NAME": "Ausgabename für XXX-Zieldateien.",
	"assets/variables.json.RUNTIME_OUTPUT_NAME_CONFIG": "Ausgabename (pro Konfiguration) für RUNTIME-Zieldateien.",
	"assets/variables.json.SKIP_BUILD_RPATH": "Soll rpaths für den Buildbaum verwendet werden?",
	"assets/variables.json.SOURCES": "Dies gibt die Liste der Pfade zu Quelldateien für das Ziel an. Die folgenden Befehle setzen oder fügen der Zieleigenschaft SOURCES hinzu und sind die übliche Art, sie zu manipulieren:",
	"assets/variables.json.SOVERSION": "ABI-Versionsnummer eines freigegebenen Bibliotheksziels.",
	"assets/variables.json.STATIC_LIBRARY_FLAGS": "Flags des Archivierungsprogramms (oder MSVC-Bibliotheksprogramms) für eine statische Bibliothek als Ziel. Ziele, bei denen es sich um freigegebene Bibliotheken, freigegebene Module oder freigegebene ausführbare Dateien handelt, erfordern die Verwendung der Zieleigenschaft LINK_OPTIONS oder LINK_FLAGS.",
	"assets/variables.json.STATIC_LIBRARY_FLAGS_CONFIG": "Flags des Archivierungsprogramms (oder MSVC-Bibliotheksprogramms) für eine statische Bibliothek als Ziel (pro Konfiguration).",
	"assets/variables.json.STATIC_LIBRARY_OPTIONS": "Flags des Archivierungsprogramms (oder MSVC-Bibliotheksprogramms) für eine statische Bibliothek als Ziel (pro Konfiguration). Ziele, bei denen es sich um freigegebene Bibliotheken, freigegebene Module oder freigegebene ausführbare Dateien handelt, erfordern die Verwendung der Zieleigenschaft LINK_OPTIONS.",
	"assets/variables.json.SUFFIX": "Gibt an, welche Informationen nach dem Zielnamen angezeigt werden.",
	"assets/variables.json.Swift_COMPILATION_MODE": "Geben Sie an, wie Swift ein Ziel kompiliert.",
	"assets/variables.json.Swift_LANGUAGE_VERSION": "Diese Eigenschaft legt die Sprachversion für die Swift-Quellen im Ziel fest. Ist kein Wert angegeben, wird standardmäßig „CMAKE_Swift_LANGUAGE_VERSION“ verwendet (sofern angegeben). Andernfalls wird die neueste Version verwendet, die vom Compiler unterstützt wird.",
	"assets/variables.json.Swift_MODULE_DIRECTORY": "Hiermit wird das Ausgabeverzeichnis für Swift-Module angegeben, die vom Ziel bereitgestellt werden.",
	"assets/variables.json.Swift_MODULE_NAME": "Diese Eigenschaft gibt den Namen des Swift-Moduls an. Standardmäßig wird der Name des Ziels verwendet.",
	"assets/variables.json.TEST_LAUNCHER": "Verwenden Sie das angegebene Startprogramm, um ausführbare Dateien auszuführen. Dieser Befehl wird add_test Befehlen für ausführbare Buildzielsystembefehle als Präfix hinzugefügt und muss auf dem Hostcomputer ausgeführt werden.",
	"assets/variables.json.TRANSITIVE_COMPILE_PROPERTIES": "Eigenschaften, die der Generatorausdruck TARGET_PROPERTY auf dem Ziel und seinen Abhängigen als Union von Werten auswertet, die beim transitiven Abschluss von Verknüpfungsabhängigkeiten erfasst wurden, ohne von LINK_ONLY überwachte Einträge.",
	"assets/variables.json.TRANSITIVE_LINK_PROPERTIES": "Eigenschaften, die der Generatorausdruck TARGET_PROPERTY auf dem Ziel und seinen Abhängigen als Union von Werten auswertet, die beim transitiven Abschluss von Verknüpfungsabhängigkeiten erfasst wurden, einschließlich von LINK_ONLY überwachter Einträge.",
	"assets/variables.json.UNITY_BUILD": "Wenn diese Eigenschaft auf TRUE festgelegt ist, werden die Zielquelldateien zur schnelleren Kompilierung in Batches zusammengefasst. Dies wird erreicht, indem (ein Satz an) Unity-Quellen erstellt wird, die die ursprünglichen Quellen enthalten (#include). Anschließend werden diese Unity-Quellen anstelle der ursprünglichen Quellen kompiliert. Das Ergebnis wird als Unity- oder Jumbo-Build bezeichnet.",
	"assets/variables.json.UNITY_BUILD_BATCH_SIZE": "Hiermit wird die maximale Anzahl von Quelldateien angegeben, die in einer beliebigen Unity-Quelldatei kombiniert werden können, wenn über die UNITY_BUILD-Zieleigenschaft Unity-Builds aktiviert werden. Die ursprünglichen Quelldateien werden auf so viele Unity-Quelldateien wie erforderlich verteilt, um diesen Grenzwert zu berücksichtigen.",
	"assets/variables.json.UNITY_BUILD_CODE_AFTER_INCLUDE": "Ein Codeschnipsel, der durch die UNITY_BUILD-Funktion unmittelbar nach jeder #include-Anweisung wortgetreu in die generierten Unity-Quelldateien eingefügt wird. Beispiel:",
	"assets/variables.json.UNITY_BUILD_CODE_BEFORE_INCLUDE": "Ein Codeschnipsel, der durch die UNITY_BUILD-Funktion unmittelbar vor jeder #include-Anweisung wortgetreu in die generierten Unity-Quelldateien eingefügt wird. Beispiel:",
	"assets/variables.json.UNITY_BUILD_MODE": "CMake stellt unterschiedliche Algorithmen zur Auswahl der Quellen bereit, die zu einem Bucket zusammengefasst werden. Die Auswahl wird mithilfe dieser Eigenschaft festgelegt, für die folgende Werte zulässig sind:",
	"assets/variables.json.UNITY_BUILD_UNIQUE_ID": "Der Name eines gültigen C-Bezeichners, der bei Unity-Builds für jede Datei auf einen eindeutigen Wert festgelegt ist.",
	"assets/variables.json.VERIFY_INTERFACE_HEADER_SETS": "Wird verwendet, um zu überprüfen, ob alle Header in den ÖFFENTLICHEN und SCHNITTSTELLEN-Headersätzen eines Ziels eigenständig eingeschlossen werden können.",
	"assets/variables.json.VERSION": "Versionsnummer eines freigegebenen Bibliotheksziels.",
	"assets/variables.json.VISIBILITY_INLINES_HIDDEN": "Legt fest, ob ein Kompilierungsflag hinzugefügt wird, um Symbole von Inlinefunktionen auszublenden",
	"assets/variables.json.VS_CONFIGURATION_TYPE": "Typ der Projektkonfiguration für Visual Studio.",
	"assets/variables.json.VS_DEBUGGER_COMMAND": "Legt den lokalen Debuggerbefehl für Visual Studio C++-Ziele fest. Der Eigenschaftswert kann Generatorausdrücke <cmake-generator-expressions(7)> verwenden. Dies wird in <LocalDebuggerCommand> in der Visual Studio-Projektdatei festgelegt. Diese Eigenschaft wird durch den Wert der Variablen CMAKE_VS_DEBUGGER_COMMAND initialisiert, wenn sie beim Erstellen eines Ziels festgelegt wird.",
	"assets/variables.json.VS_DEBUGGER_COMMAND_ARGUMENTS": "Legt die Befehlszeilenargumente des lokalen Debuggers für Visual Studio C++-Ziele fest. Der Eigenschaftswert kann Generatorausdrücke <cmake-generator-expressions(7)> verwenden. Das können Sie in <LocalDebuggerCommandArguments> in der Visual Studio-Projektdatei festlegen. Diese Eigenschaft wird durch den Wert der Variablen CMAKE_VS_DEBUGGER_COMMAND_ARGUMENTS initialisiert, wenn sie beim Erstellen eines Ziels festgelegt wird.",
	"assets/variables.json.VS_DEBUGGER_ENVIRONMENT": "Legt die lokale Debuggerumgebung für Visual Studio C++-Ziele fest. Der Eigenschaftswert kann Generatorausdrücke <cmake-generator-expressions(7)> verwenden. Das können Sie in <LocalDebuggerEnvironment> in der Visual Studio Projektdatei festlegen. Diese Eigenschaft wird durch den Wert der Variablen CMAKE_VS_DEBUGGER_ENVIRONMENT initialisiert, wenn sie beim Erstellen eines Ziels festgelegt wird.",
	"assets/variables.json.VS_DEBUGGER_WORKING_DIRECTORY": "Legt das Arbeitsverzeichnis des lokalen Debuggers für Visual Studio C++-Ziele fest. Der Eigenschaftswert kann Generatorausdrücke <cmake-generator-expressions(7)> verwenden. Das können Sie in <LocalDebuggerWorkingDirectory> in der Visual Studio-Projektdatei festlegen. Diese Eigenschaft wird durch den Wert der Variablen CMAKE_VS_DEBUGGER_WORKING_DIRECTORY initialisiert, wenn sie beim Erstellen eines Ziels festgelegt wird.",
	"assets/variables.json.VS_DESKTOP_EXTENSIONS_VERSION": "Visual Studio Windows 10 Desktop Extensions Version",
	"assets/variables.json.VS_DOTNET_DOCUMENTATION_FILE": "Durch Visual Studio verwaltete Ausgabe der .NET-Projektdokumentation.",
	"assets/variables.json.VS_DOTNET_REFERENCEPROP_refname_TAG_tagname": "Definiert eine XML-Eigenschaft <tagname> für eine .NET-Referenz <refname>.",
	"assets/variables.json.VS_DOTNET_REFERENCES": "Durch Visual Studio verwaltete Projekt-.NET-Verweise",
	"assets/variables.json.VS_DOTNET_REFERENCES_COPY_LOCAL": "Legt die Copy Local-Eigenschaft für alle .NET-Hinweisreferenzen im Ziel fest",
	"assets/variables.json.VS_DOTNET_REFERENCE_refname": "Durch Visual Studio verwalteter Projekt-.NET-Verweis mit dem Namen <refname> und Hinweispfad.",
	"assets/variables.json.VS_DOTNET_STARTUP_OBJECT": "Legt die Startobjekteigenschaft in Microsoft Visual Studio .NET-Zielen fest. Der Eigenschaftswert definiert einen vollqualifizierten Klassennamen (einschließlich Paketname), beispielsweise: MyCompany.Package.MyStarterClass.",
	"assets/variables.json.VS_DOTNET_TARGET_FRAMEWORK_VERSION": "Geben Sie die Version des .NET-Zielframeworks an.",
	"assets/variables.json.VS_DPI_AWARE": "Hiermit können in den Eigenschaften des Visual Studio-Zielprojekts DPI-Werte festgelegt werden: \"Manifesttool\" > \"Eingabe und Ausgabe\" > \"DPI\".",
	"assets/variables.json.VS_FILTER_PROPS": "Legt die Filterpropsdatei fest, die in die Visual Studio C++-Projektfilterdatei eingeschlossen werden soll.",
	"assets/variables.json.VS_GLOBAL_KEYWORD": "Visual Studio-Projektschlüsselwort.",
	"assets/variables.json.VS_GLOBAL_PROJECT_TYPES": "Visual Studio-Projekttyp(en).",
	"assets/variables.json.VS_GLOBAL_ROOTNAMESPACE": "Stammnamespace für Visual Studio-Projekt.",
	"assets/variables.json.VS_GLOBAL_variable": "Globale Variable für ein spezifisches Visual Studio-Projekt.",
	"assets/variables.json.VS_IOT_EXTENSIONS_VERSION": "Visual Studio Windows 10 IoT Extensions Version",
	"assets/variables.json.VS_IOT_STARTUP_TASK": "Visual Studio Windows 10 IoT: kontinuierliche Hintergrundaufgabe",
	"assets/variables.json.VS_JUST_MY_CODE_DEBUGGING": "Hiermit wird nur eigener Code mit dem Visual Studio-Debugger aktiviert.",
	"assets/variables.json.VS_KEYWORD": "Entfernt. Hierdurch wurde einmal das Visual Studio Projekt Schlüsselwort (keyword) für den Generator von Visual Studio 9 2008 und älter angegeben, aber alle diese Generatoren wurden entfernt.",
	"assets/variables.json.VS_MOBILE_EXTENSIONS_VERSION": "Version der mobilen Windows 10-Erweiterungen für Visual Studio",
	"assets/variables.json.VS_NO_COMPILE_BATCHING": "Deaktivieren Sie die Batchverarbeitung für das Kompilieren für das Ziel. In der Regel ruft MSBuild den Compiler mit mehreren c/cpp-Dateien auf, und der Compiler startet Unterprozesse für jede Datei, um den Build parallel zu gestalten. Wenn der Compiler mit jeweils einer Datei aufgerufen werden soll, legen Sie VS_NO_COMPILE_BATCHING auf EIN fest. Wenn dieses Flag festgelegt ist, ruft MSBuild den Compiler mit jeweils einer c/cpp-Datei auf. Nützlich, wenn Sie ein Tool verwenden möchten, das den Compiler ersetzt, beispielsweise ein Tool zur Buildzwischenspeicherung.",
	"assets/variables.json.VS_NO_SOLUTION_DEPLOY": "Hiermit wird angegeben, dass das Ziel in der generierten Visual Studio-Lösung nicht zur Bereitstellung auf einem Windows CE- oder Windows Phone-Gerät gekennzeichnet werden soll.",
	"assets/variables.json.VS_PACKAGE_REFERENCES": "Visual Studio-Paketverweise für NuGet.",
	"assets/variables.json.VS_PLATFORM_TOOLSET": "Hiermit wird das zum Erstellen eines Ziels verwendete Plattformtoolset überschrieben.",
	"assets/variables.json.VS_PROJECT_IMPORT": "Durch Visual Studio verwaltete Projektimporte.",
	"assets/variables.json.VS_SCC_AUXPATH": "Zusatzpfad für die Quellcodeverwaltung in Visual Studio.",
	"assets/variables.json.VS_SCC_LOCALPATH": "Lokaler Pfad zur Quellcodeverwaltung in Visual Studio",
	"assets/variables.json.VS_SCC_PROJECTNAME": "Visual Studio-Quellcodeverwaltungsprojekt.",
	"assets/variables.json.VS_SCC_PROVIDER": "Programm zur Quellcodeverwaltung in Visual Studio.",
	"assets/variables.json.VS_SDK_REFERENCES": "Dies sind SDK-Verweise für das Visual Studio-Projekt. Geben Sie eine durch Semikolon getrennte Liste mit SDK-Verweisen an, die einem generierten Visual Studio-Projekt hinzugefügt werden. Beispiel: Microsoft.AdMediatorWindows81, Version=1.0.",
	"assets/variables.json.VS_SOLUTION_DEPLOY": "Hiermit wird angegeben, dass das Ziel zur Bereitstellung gekennzeichnet werden soll, wenn als Ziel nicht Windows CE, Windows Phone oder eine Windows Store-Anwendung verwendet wird.",
	"assets/variables.json.VS_SOURCE_SETTINGS_tool": "Hiermit werden beliebige Elementmetadaten für alle nicht erstellten Dateien festgelegt, die <tool> verwenden.",
	"assets/variables.json.VS_USER_PROPS": "Legt die Benutzereigenschaftendatei fest, die in die Visual Studio C++-Projektdatei einzubeziehen ist. Der Standardpfad ist $(UserRootDir)\\\\Microsoft.Cpp.$(Platform).user.props. In den meisten Fällen entspricht dies %LOCALAPPDATA%\\\\Microsoft\\\\MSBuild\\\\v4.0\\\\Microsoft.Cpp.Win32.user.props oder %LOCALAPPDATA%\\\\Microsoft\\\\MSBuild\\\\v4.0\\\\Microsoft.Cpp.x64.user.props.",
	"assets/variables.json.VS_USE_DEBUG_LIBRARIES": "Geben Sie für Visual Studio-Generatoren an, welche Konfigurationen als Debugkonfigurationen betrachtet werden. Hiermit wird die Einstellung \"UseDebugLibraries\" in jeder Konfiguration einer .vcxproj Datei gesteuert.",
	"assets/variables.json.VS_WINDOWS_TARGET_PLATFORM_MIN_VERSION": "Visual Studio: Windows-Zielplattform, Mindestversion",
	"assets/variables.json.VS_WINRT_COMPONENT": "Markieren Sie für den Visual Studio-Generator ein Ziel als Windows-Runtime-Komponente. Kompilieren Sie das Ziel mit C++/CX-Spracherweiterungen für Windows-Runtime. Bei SHARED- und MODULE-Bibliotheken definiert dies auch den Präprozessormakro _WINRT_DLL.",
	"assets/variables.json.VS_WINRT_EXTENSIONS": "Veraltet. Verwenden Sie stattdessen VS_WINRT_COMPONENT. Diese Eigenschaft war eine experimentelle Teilimplementierung von VS_WINRT_COMPONENT.",
	"assets/variables.json.VS_WINRT_REFERENCES": "Visual Studio-Projekt: Windows-Runtime-Metadatenverweise",
	"assets/variables.json.WATCOM_RUNTIME_LIBRARY": "Wählen Sie die Watcom-Laufzeitbibliothek für die Verwendung durch Compiler aus, welche die Watcom-ABI als Ziel verwenden.",
	"assets/variables.json.WIN32_EXECUTABLE": "Erstellen Sie unter Windows mit einem WinMain-Einstiegspunkt eine ausführbare Datei.",
	"assets/variables.json.WINDOWS_EXPORT_ALL_SYMBOLS": "Diese Eigenschaft wird nur für MS-kompatible Tools unter Windows implementiert.",
	"assets/variables.json.XCODE_ATTRIBUTE_an-attribute": "Legen Sie die Attribute eines Xcode-Ziels direkt fest.",
	"assets/variables.json.XCODE_EMBED_FRAMEWORKS_CODE_SIGN_ON_COPY": "Hiermit wird der Xcode-Generator angewiesen, die Codesignierung für alle Frameworks und Bibliotheken durchzuführen, die über die Eigenschaft XCODE_EMBED_FRAMEWORKS <XCODE_EMBED_<type>> eingebettet sind.",
	"assets/variables.json.XCODE_EMBED_FRAMEWORKS_REMOVE_HEADERS_ON_COPY": "Hiermit wird der Xcode-Generator angewiesen, die Header aus allen Frameworks zu entfernen, die über die Eigenschaft XCODE_EMBED_FRAMEWORKS <XCODE_EMBED_<type>> eingebettet sind.",
	"assets/variables.json.XCODE_EMBED_type": "Teilen Sie dem Xcode-Generator mit, die angegebene Liste der Elemente in das Zielbündel einzubetten. <type> gibt die zu verwendende Einbettungsphase an. In der Xcode-Dokumentation finden Sie die Basisposition für jeden einzelnen <type>.",
	"assets/variables.json.XCODE_EMBED_type_CODE_SIGN_ON_COPY": "Eine Boolesche Eigenschaft, die nur vom Xcode-Generator verwendet wird. Sie gibt an, ob die Codesignatur für die Elemente ausgeführt werden soll, die mithilfe der XCODE_EMBED_-Eigenschaft eingebettet sind.",
	"assets/variables.json.XCODE_EMBED_type_PATH": "Diese Eigenschaft wird nur vom Xcode-Generator verwendet. Wenn diese Option definiert ist, wird der relative Pfad angegeben, der beim Einbetten der von XCODE_EMBED_ angegebenen Elemente verwendet werden soll. Der Pfad ist relativ zu dem Basisspeicherort der mit <type> verknüpften Buildphase für Embed-xxx. In der Xcode-Dokumentation finden Sie die Basisposition für jeden einzelnen <type>.",
	"assets/variables.json.XCODE_EMBED_type_REMOVE_HEADERS_ON_COPY": "Boolesche Eigenschaft, die nur vom Xcode-Generator verwendet wird. Sie gibt an, ob Header aus allen Frameworks entfernt werden, die mit der XCODE_EMBED_-Eigenschaft eingebettet sind.",
	"assets/variables.json.XCODE_GENERATE_SCHEME": "Wenn diese Variable aktiviert ist, generiert der Xcode-Generator Schemadateien. Diese sind nützlich, um Aktionen über die Befehlszeile aufzurufen, zu analysieren, zu archivieren, zu Testzwecken zu erstellen und zu testen.",
	"assets/variables.json.XCODE_LINK_BUILD_PHASE_MODE": "Bei Verwendung des Xcode-Generators werden die zu verknüpfenden Bibliotheken in der Xcode-Projektdatei entweder über die Buildphase \"Binärdatei mit Bibliotheken verknüpfen\" oder direkt als Linkerflags angegeben. Die erste Option ermöglicht Xcode das Verwalten von Buildpfaden. Dies kann beim Erstellen von Xcode-Archiven erforderlich sein, weil möglicherweise andere Buildpfade als bei einem regulären Build verwendet werden.",
	"assets/variables.json.XCODE_PRODUCT_TYPE": "Legen Sie das Xcode-productType-Attribut für dessen Verweis auf ein Ziel fest. CMake berechnet basierend auf dem Zieltyp einen Standardwert, kann jedoch auch explizit mit dieser Eigenschaft Berechnungen durchführen.",
	"assets/variables.json.XCODE_SCHEME_ADDRESS_SANITIZER": "Legt fest, ob im Diagnoseabschnitt des generierten Xcode-Schemas \"Address Sanitizer\" aktiviert wird.",
	"assets/variables.json.XCODE_SCHEME_ADDRESS_SANITIZER_USE_AFTER_RETURN": "Legt fest, ob im Diagnoseabschnitt des generierten Xcode-Schemas \"Detect use of stack after return\" aktiviert wird.",
	"assets/variables.json.XCODE_SCHEME_ARGUMENTS": "Geben Sie Befehlszeilenargumente an, die dem Argumentenbereich des generierten Xcode-Schemas hinzugefügt werden.",
	"assets/variables.json.XCODE_SCHEME_DEBUG_AS_ROOT": "Hiermit wird angegeben, ob das Ziel als \"root\" gedebuggt wird.",
	"assets/variables.json.XCODE_SCHEME_DEBUG_DOCUMENT_VERSIONING": "Gibt an, ob bei Verwendung des Dokumentversionsbrowsers im Abschnitt mit den Optionen des generierten Xcode-Schemas die Einstellung zum Zulassen des Debuggens aktiviert wird.",
	"assets/variables.json.XCODE_SCHEME_DISABLE_MAIN_THREAD_CHECKER": "Legt fest, ob \"Main Thread Checker\" im Abschnitt \"Diagnostics\" des generierten Xcode-Schemas deaktiviert wird.",
	"assets/variables.json.XCODE_SCHEME_DYNAMIC_LIBRARY_LOADS": "Legt fest, ob im Diagnoseabschnitt des generierten Xcode-Schemas \"Dynamic Library Loads\" aktiviert wird.",
	"assets/variables.json.XCODE_SCHEME_DYNAMIC_LINKER_API_USAGE": "Legt fest, ob im Diagnoseabschnitt des generierten Xcode-Schemas \"Dynamic Linker API usage\" aktiviert wird.",
	"assets/variables.json.XCODE_SCHEME_ENABLE_GPU_API_VALIDATION": "Eigenschaftswert für Metal: API-Validierung im Abschnitt „Optionen“ des generierten Xcode-Schemas.",
	"assets/variables.json.XCODE_SCHEME_ENABLE_GPU_FRAME_CAPTURE_MODE": "Eigenschaftswert für die GPU-Frame-Erfassung im Abschnitt „Optionen“ des generierten Xcode-Schemas. Beispielwerte sind Metal und Disabled.",
	"assets/variables.json.XCODE_SCHEME_ENABLE_GPU_SHADER_VALIDATION": "Eigenschaftswert für Metal: Shader-Validierung im Abschnitt „Optionen“ des generierten Xcode-Schemas.",
	"assets/variables.json.XCODE_SCHEME_ENVIRONMENT": "Geben Sie Umgebungsvariablen an, die dem Argumentenabschnitt des generierten Xcode-Schemas hinzugefügt werden.",
	"assets/variables.json.XCODE_SCHEME_EXECUTABLE": "Geben Sie im Informationsabschnitt des generierten Xcode-Schemas den Pfad zur ausführbaren Datei an. Wird keine Einstellung festgelegt, wählt der Schemagenerator das aktuelle Ziel aus, sofern die ausgeführt werden kann.",
	"assets/variables.json.XCODE_SCHEME_GUARD_MALLOC": "Legt fest, ob im Diagnoseabschnitt des generierten Xcode-Schemas \"Guard Malloc\" aktiviert wird.",
	"assets/variables.json.XCODE_SCHEME_LAUNCH_CONFIGURATION": "Legen Sie die Buildkonfiguration fest, um das Ziel auszuführen.",
	"assets/variables.json.XCODE_SCHEME_LAUNCH_MODE": "Eigenschaftswert für Start im Abschnitt „Info“ des generierten Xcode-Schemas.",
	"assets/variables.json.XCODE_SCHEME_MAIN_THREAD_CHECKER_STOP": "Legt fest, ob im Abschnitt \"Diagnostics\" des generierten Xcode-Schemas bei Problemen die Main Thread Checker-Option \"Pause\" aktiviert wird.",
	"assets/variables.json.XCODE_SCHEME_MALLOC_GUARD_EDGES": "Legt fest, ob im Diagnoseabschnitt des generierten Xcode-Schemas \"Malloc Guard Edges\" aktiviert wird.",
	"assets/variables.json.XCODE_SCHEME_MALLOC_SCRIBBLE": "Legt fest, ob im Diagnoseabschnitt des generierten Xcode-Schemas \"Malloc Scribble\" aktiviert wird.",
	"assets/variables.json.XCODE_SCHEME_MALLOC_STACK": "Legt fest, ob im Diagnoseabschnitt des generierten Xcode-Schemas \"Malloc Stack\" aktiviert wird.",
	"assets/variables.json.XCODE_SCHEME_THREAD_SANITIZER": "Legt fest, ob im Diagnoseabschnitt des generierten Xcode-Schemas \"Thread Sanitizer\" aktiviert wird.",
	"assets/variables.json.XCODE_SCHEME_THREAD_SANITIZER_STOP": "Legt fest, ob im Abschnitt \"Diagnostics\" des generierten Xcode-Schemas bei Problemen die Option \"Thread Sanitizer – Pause\" aktiviert wird.",
	"assets/variables.json.XCODE_SCHEME_UNDEFINED_BEHAVIOUR_SANITIZER": "Legt fest, ob im Abschnitt \"Diagnostics\" des generierten Xcode-Schemas \"Undefined Behavior Sanitizer\" aktiviert wird.",
	"assets/variables.json.XCODE_SCHEME_UNDEFINED_BEHAVIOUR_SANITIZER_STOP": "Legt fest, ob im Abschnitt \"Diagnostics\" des generierten Xcode-Schemas bei Problemen die Undefined Behavior Sanitizer-Option \"Pause\" aktiviert wird.",
	"assets/variables.json.XCODE_SCHEME_WORKING_DIRECTORY": "Hiermit wird das Arbeitsverzeichnis der Ausführungs- und Profilaktionen im generierten Xcode-Schema angegeben. Falls der Wert Generatorausdrücke enthält, werden diese ausgewertet.",
	"assets/variables.json.XCODE_SCHEME_ZOMBIE_OBJECTS": "Legt fest, ob im Diagnoseabschnitt des generierten Xcode-Schemas \"Zombie Objects\" aktiviert wird.",
	"assets/variables.json.XCODE_XCCONFIG": "Wenn diese Einstellung festgelegt ist, registriert der Xcode-Generator die angegebene Datei als XCConfig-Datei auf Zielebene. Für weitere Informationen zu globalen XCConfig-Dateien siehe die Variable CMAKE_XCODE_XCCONFIG.",
	"assets/variables.json.XCTEST": "Auf dem Mac ist dieses Ziel ein XCTest-CFBundle."
}