/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"non.200.response.when.downloading": "Réponse différente de 200 durant le téléchargement du programme d'installation de la nouvelle version de CMake",
	"downloaded.to.path": "Téléchargement effectué de {0} sur {1}",
	"program.need.for.installer": "CMake Tools a besoin du programme {0} pour exécuter le programme d'installation de CMake",
	"downloading.filename": "Téléchargement de {0}",
	"running.cmake.installer": "Exécution du programme d'installation de CMake",
	"failed.to.authorize": "Échec de l'autorisation d'exécution de l'installation de CMake.",
	"permission.request.dismissed": "Vous avez rejeté la demande d'autorisation pour l'installation de CMake.",
	"installer.failed": "Le programme d'installation de CMake a retourné une valeur différente de zéro [{0}] : {1}",
	"installer.failed.check.output": "Le programme d'installation de CMake s'est arrêté avec une valeur différente de zéro. Pour plus d'informations, consultez le panneau de sortie",
	"restart.now.button": "Redémarrer maintenant",
	"installed.reload.to.complete": "La nouvelle version de CMake est correctement installée sur /usr/local/bin/cmake. Rechargez VSCode pour effectuer les changements.",
	"error.comparing.versions": "Erreur durant la comparaison des versions de CMake pour une mise à niveau potentielle",
	"yes.button": "Oui",
	"ask.me.later.button": "Me demander plus tard",
	"dont.ask.me.again.button": "Ne plus me poser la question",
	"new.version.available": "Une nouvelle version de CMake est disponible. Vous exécutez {0} et {1} est disponible. Voulez-vous que CMake Tools télécharge et installe cette mise à jour automatiquement ?"
}