/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"default.build.preset": "[Predeterminada]",
	"default.build.preset.description": "Una compilación preestablecida vacía que no agrega ningún argumento.",
	"default.test.preset": "[Predeterminada]",
	"default.test.preset.description": "Una prueba preestablecida vacía que no agrega ningún argumento.",
	"config.preset.not.found": "No se encontró la configuración preestablecida con el nombre {0}",
	"no.cl.arch": "Configuración preestablecida {0}: no se ha especificado ninguna arquitectura para cl.exe; se usará x86 de forma predeterminada",
	"no.cl.toolset.arch": "Configuración preestablecida {0}: no se ha especificado ninguna arquitectura de conjunto de herramientas para cl.exe; se usará x86 de forma predeterminada",
	"no.cl.toolset.version": "Configuración preestablecida {0}: no se especificó ninguna versión de conjunto de herramientas para cl.exe; se usará la más reciente de forma predeterminada.",
	"specified.cl.not.found": "Configuración preestablecida {0}: no se encuentra el archivo cl.exe especificado con el conjunto de herramientas {1} y la arquitectura {2}; puede que tenga que ejecutar \"CMake: scan for compilers\" si existe en el equipo.",
	"ninja.not.set": "Ninja no está establecido en la ruta de acceso; se está intentando usar {0}.",
	"build.preset.not.found": "No se ha encontrado la compilación preestablecida con el nombre {0}",
	"test.preset.not.found": "No ha encontrado se la prueba preestablecida con el nombre {0}.",
	"clean.not.needed.no.prior.config.preset": "Limpieza no necesaria: no se ha seleccionado ninguna configuración preestablecida previa seleccionada",
	"clean.needed.config.preset.changed": "Es necesario limpiar: configuración preestablecida cambiada"
}