/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"assets/commands.json.add_compile_definitions": "Agregue definiciones del preprocesador a la compilación de archivos de código fuente.",
	"assets/commands.json.add_compile_options": "Agregue opciones a la compilación de archivos de código fuente.",
	"assets/commands.json.add_custom_command": "Agrega una regla de compilación personalizada al sistema de compilación generado.",
	"assets/commands.json.add_custom_target": "Agrega un destino sin salida para que se compile siempre.",
	"assets/commands.json.add_definitions": "Agregue marcas de definición -D a la compilación de archivos de código fuente.",
	"assets/commands.json.add_dependencies": "Agrega una dependencia entre destinos de nivel superior.",
	"assets/commands.json.add_executable": "Agrega un ejecutable al proyecto con los archivos de código fuente especificados.",
	"assets/commands.json.add_library": "Agrega una biblioteca al proyecto con los archivos de código fuente especificados.",
	"assets/commands.json.add_link_options": "Agregue opciones al paso de vinculación de los destinos de biblioteca de módulos, biblioteca compartida o ejecutable en el directorio actual y los siguientes, que se agregan después de invocar este comando.",
	"assets/commands.json.add_subdirectory": "Agrega un subdirectorio a la compilación.",
	"assets/commands.json.add_test": "Agrega una prueba al proyecto para que ctest la ejecute.",
	"assets/commands.json.aux_source_directory": "Busca todos los archivos de código fuente en un directorio.",
	"assets/commands.json.block": "Evalúa un grupo de comandos con una variable dedicada o un ámbito de directiva.",
	"assets/commands.json.break": "Interrupción de un bucle foreach o while envolvente.",
	"assets/commands.json.build_command": "Obtiene una línea de comandos para compilar el proyecto actual. Está pensado principalmente para uso interno del módulo CTest.",
	"assets/commands.json.build_name": "No se permite desde la versión 3.0. Consulte la directiva de CMake CMP0036.",
	"assets/commands.json.cmake_file_api": "Permite interactuar con la API de archivos de CMake <cmake-file-api(7)>.",
	"assets/commands.json.cmake_host_system_information": "Consultar información de varios sistemas de hospedaje.",
	"assets/commands.json.cmake_language": "Llame a las metaoperaciones en los comandos de CMake.",
	"assets/commands.json.cmake_minimum_required": "Requiere una versión mínima de CMake.",
	"assets/commands.json.cmake_parse_arguments": "Analice los argumentos de una función o macro.",
	"assets/commands.json.cmake_path": "Este comando se usa para la manipulación de las rutas de acceso. Solo se controlan los aspectos sintácticos de las rutas de acceso, no hay interacción de ningún tipo con ningún sistema de archivos subyacente. La ruta de acceso puede representar una ruta de acceso no existente o incluso una que no se permite que exista en la plataforma o el sistema de archivos actual. Para las operaciones que interactúan con el sistema de archivos, vea el comando file.",
	"assets/commands.json.cmake_policy": "Administre la configuración de directivas de CMake. Consulte el manual de cmake-policies para ver las directivas definidas.",
	"assets/commands.json.configure_file": "Copie un archivo a otra ubicación y modifique su contenido.",
	"assets/commands.json.continue": "Continúa a la parte superior del bucle foreach o while envolvente.",
	"assets/commands.json.create_test_sourcelist": "Cree un programa de controladores de pruebas que vincule muchas pruebas pequeñas a un solo ejecutable. Esto es útil al compilar ejecutables estáticos con bibliotecas grandes para reducir el tamaño total necesario.",
	"assets/commands.json.ctest_build": "Realiza el paso CTest Build como cliente de escritorio.",
	"assets/commands.json.ctest_configure": "Realiza el paso CTest Configure como cliente de escritorio.",
	"assets/commands.json.ctest_coverage": "Realiza el paso CTest Coverage como cliente de escritorio.",
	"assets/commands.json.ctest_empty_binary_directory": "Vacía el directorio binario.",
	"assets/commands.json.ctest_memcheck": "Realiza el paso CTest MemCheck como cliente de escritorio.",
	"assets/commands.json.ctest_read_custom_files": "Lee los archivos CTestCustom.",
	"assets/commands.json.ctest_run_script": "Ejecuta un script -S de ctest.",
	"assets/commands.json.ctest_sleep": "Se suspende durante cierto tiempo.",
	"assets/commands.json.ctest_start": "Inicia las pruebas de un modelo determinado.",
	"assets/commands.json.ctest_submit": "Realiza el paso CTest Submit como cliente de escritorio.",
	"assets/commands.json.ctest_test": "Realiza el paso CTest Test como cliente de escritorio.",
	"assets/commands.json.ctest_update": "Realiza el paso CTest Update como cliente de escritorio.",
	"assets/commands.json.ctest_upload": "Carga los archivos en un servidor de panel como cliente de panel.",
	"assets/commands.json.define_property": "Define y documenta las propiedades personalizadas.",
	"assets/commands.json.else": "Inicia la parte else de un bloque if.",
	"assets/commands.json.elseif": "Inicia una parte elseif de un bloque if.",
	"assets/commands.json.enable_language": "Habilitar idiomas (CXX/C/OBJC/OBJCXX/Fortran/etc.)",
	"assets/commands.json.enable_testing": "Habilita las pruebas para el directorio actual y los siguientes.",
	"assets/commands.json.endblock": "Finaliza una lista de comandos en un bloque y quita los ámbitos creados por el comando de bloque.",
	"assets/commands.json.endforeach": "Finaliza una lista de comandos en un bloque foreach.",
	"assets/commands.json.endfunction": "Finaliza una lista de comandos en un bloque de funciones.",
	"assets/commands.json.endif": "Finaliza una lista de comandos en un bloque if.",
	"assets/commands.json.endmacro": "Finaliza una lista de comandos en un bloque de macros.",
	"assets/commands.json.endwhile": "Finaliza una lista de comandos en un bloque while.",
	"assets/commands.json.execute_process": "Ejecuta uno o más procesos secundarios.",
	"assets/commands.json.exec_program": "Abra un programa ejecutable durante el procesamiento del archivo CMakeList.txt.",
	"assets/commands.json.export": "Exporte destinos o paquetes para proyectos externos para usarlos directamente desde el árbol de compilación del proyecto actual, sin instalación.",
	"assets/commands.json.export_library_dependencies": "No se permite desde la versión 3.0. Consulte la directiva de CMake CMP0033.",
	"assets/commands.json.file": "Comando de manipulación de archivos.",
	"assets/commands.json.find_file": "Este comando se usa para buscar una ruta de acceso completa a un archivo con nombre.",
	"assets/commands.json.find_library": "Este comando se usa para buscar una biblioteca.",
	"assets/commands.json.find_package": "Busque un paquete (normalmente proporcionado por algo externo al proyecto) y cargue los detalles específicos del paquete. Las llamadas a este comando también pueden ser interceptadas por los proveedores de dependencias.",
	"assets/commands.json.find_path": "Este comando se usa para buscar un directorio que contiene el archivo con nombre.",
	"assets/commands.json.find_program": "Este comando se usa para buscar un programa.",
	"assets/commands.json.fltk_wrap_ui": "Crea contenedores de interfaces de usuario de FLTK.",
	"assets/commands.json.foreach": "Evalúa un grupo de comandos para cada valor de una lista.",
	"assets/commands.json.function": "Comience el registro de una función para su invocación posterior como comando.",
	"assets/commands.json.get_cmake_property": "Obtiene una propiedad global de la instancia de CMake.",
	"assets/commands.json.get_directory_property": "Obtiene una propiedad de ámbito DIRECTORY.",
	"assets/commands.json.get_filename_component": "Obtiene un componente específico de un nombre de archivo completo.",
	"assets/commands.json.get_property": "Obtiene una propiedad.",
	"assets/commands.json.get_source_file_property": "Obtiene una propiedad para un archivo de origen.",
	"assets/commands.json.get_target_property": "Obtiene una propiedad de un destino.",
	"assets/commands.json.get_test_property": "Obtiene una propiedad de la prueba.",
	"assets/commands.json.if": "Ejecuta un grupo de comandos de manera condicional.",
	"assets/commands.json.include": "Carga y ejecuta código de CMake desde un archivo o módulo.",
	"assets/commands.json.include_directories": "Agregue directorios de inclusión a la compilación.",
	"assets/commands.json.include_external_msproject": "Incluye un archivo de proyecto de Microsoft externo en un área de trabajo.",
	"assets/commands.json.include_guard": "Proporciona una restricción de inclusión para el archivo que CMake está procesando.",
	"assets/commands.json.include_regular_expression": "Establece la expresión regular usada para la comprobación de dependencias.",
	"assets/commands.json.install": "Especifica las reglas que se van a ejecutar en el momento de la instalación.",
	"assets/commands.json.install_files": "Este comando se ha reemplazado por el comando de instalación. Se proporciona para ofrecer compatibilidad con código de CMake anterior. El formulario FILES se reemplaza directamente por el formulario FILES del comando de instalación. El formulario regexp puede expresarse de forma más clara con el formulario GLOB del comando de archivo.",
	"assets/commands.json.install_programs": "Este comando se ha reemplazado por el comando de instalación. Se proporciona para ofrecer compatibilidad con código de CMake anterior. El formulario FILES se reemplaza directamente por el formulario PROGRAMS del comando de instalación. El formulario regexp puede expresarse de forma más clara con el formulario GLOB del comando de archivo.",
	"assets/commands.json.install_targets": "Este comando se ha reemplazado por el comando de instalación. Se proporciona para ofrecer compatibilidad con código de CMake anterior.",
	"assets/commands.json.link_directories": "Agregue directorios en los que el enlazador buscará bibliotecas.",
	"assets/commands.json.link_libraries": "Vincular bibliotecas a todos los destinos agregados más tarde.",
	"assets/commands.json.list": "Operaciones en listas separadas por punto y coma.",
	"assets/commands.json.load_cache": "Carga los valores de la memoria caché de CMake de otro proyecto.",
	"assets/commands.json.load_command": "No se permite desde la versión 3.0. Consulte la directiva de CMake CMP0031.",
	"assets/commands.json.macro": "Empezar a registrar una macro para su invocación posterior como comando",
	"assets/commands.json.make_directory": "Crea el directorio especificado. Deben proporcionarse rutas de acceso completas. También se crearán los directorios principales que no existan. Úselo con prudencia.",
	"assets/commands.json.mark_as_advanced": "Marca las variables de CMake en caché como avanzadas.",
	"assets/commands.json.math": "Evalúe una expresión matemática.",
	"assets/commands.json.message": "Registre un mensaje.",
	"assets/commands.json.option": "Proporcionar una opción booleana que el usuario puede seleccionar opcionalmente.",
	"assets/commands.json.output_required_files": "No se permite desde la versión 3.0. Consulte la directiva de CMake CMP0032.",
	"assets/commands.json.project": "Establezca el nombre del proyecto.",
	"assets/commands.json.qt_wrap_cpp": "Cree contenedores Qt de forma manual.",
	"assets/commands.json.qt_wrap_ui": "Cree contenedores de interfaces de usuario de Qt de forma manual.",
	"assets/commands.json.remove": "Quita VALUE de la variable VAR. Se usa normalmente para quitar las entradas de un vector (por ejemplo, una lista de valores separados por punto y coma). VALUE se expande.",
	"assets/commands.json.remove_definitions": "Quite las marcas de definición -D agregadas por add_definitions.",
	"assets/commands.json.return": "Retorno desde un archivo, directorio o función.",
	"assets/commands.json.separate_arguments": "Analice los argumentos de línea de comandos en una lista separada por signos de punto y coma.",
	"assets/commands.json.set": "Establece una variable normal, de caché o de entorno en un valor dado. Consulte la documentación de las variables de cmake-language(7) para ver los ámbitos y la interacción de las variables normales y las entradas de caché.",
	"assets/commands.json.set_directory_properties": "Establece las propiedades del directorio y los subdirectorios actuales.",
	"assets/commands.json.set_property": "Establece una propiedad con nombre en un ámbito especificado.",
	"assets/commands.json.set_source_files_properties": "Los archivos de origen pueden tener propiedades que afectan a la forma en que se compilan.",
	"assets/commands.json.set_target_properties": "Los destinos pueden tener propiedades que afectan a la forma en que se compilan.",
	"assets/commands.json.set_tests_properties": "Establece una propiedad de las pruebas.",
	"assets/commands.json.site_name": "Establece la variable especificada en el nombre del equipo.",
	"assets/commands.json.source_group": "Define una agrupación de archivos de origen en la generación del proyecto IDE. Hay dos signaturas distintas para crear grupos de origen.",
	"assets/commands.json.string": "Operaciones de cadena.",
	"assets/commands.json.subdirs": "Agregue una lista de subdirectorios a la compilación.",
	"assets/commands.json.subdir_depends": "No se permite desde la versión 3.0. Consulte la directiva de CMake CMP0029.",
	"assets/commands.json.target_compile_definitions": "Agrega definiciones de compilación a un destino.",
	"assets/commands.json.target_compile_features": "Agrega a un destino características que se esperan del compilador.",
	"assets/commands.json.target_compile_options": "Agrega opciones de compilación a un destino.",
	"assets/commands.json.target_include_directories": "Agrega directorios de inclusión a un destino.",
	"assets/commands.json.target_link_directories": "Agrega directorios de vínculos a un destino.",
	"assets/commands.json.target_link_libraries": "Especifica las bibliotecas o marcas que se van a usar al vincular un destino dado o sus destinos dependientes. Se propagarán los requisitos de uso de los destinos de biblioteca vinculados. Los requisitos de uso de las dependencias de un destino afectan a la compilación de sus propios orígenes.",
	"assets/commands.json.target_link_options": "Agregue opciones al paso de vinculación de un destino de biblioteca de módulos, biblioteca compartida o ejecutable.",
	"assets/commands.json.target_precompile_headers": "Agregue una lista de archivos de encabezado para precompilar.",
	"assets/commands.json.target_sources": "Agrega orígenes a un destino.",
	"assets/commands.json.try_compile": "Pruebe a compilar código.",
	"assets/commands.json.try_run": "Pruebe a compilar y ejecutar código.",
	"assets/commands.json.unset": "Anula una variable, variable de caché o variable de entorno.",
	"assets/commands.json.use_mangled_mesa": "No se permite desde la versión 3.0. Consulte la directiva de CMake CMP0030.",
	"assets/commands.json.utility_source": "No se permite desde la versión 3.0. Consulte la directiva de CMake CMP0034.",
	"assets/commands.json.variable_requires": "No se permite desde la versión 3.0. Consulte la directiva de CMake CMP0035.",
	"assets/commands.json.variable_watch": "Observa si hay cambios en la variable de CMake.",
	"assets/commands.json.while": "Evalúa un grupo de comandos mientras una condición es True",
	"assets/commands.json.write_file": "El primer argumento es el nombre de archivo y el resto de los argumentos son mensajes para escribir. Si se especifica el argumento APPEND, el mensaje se anexará."
}