/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"non.200.response.when.downloading": "È stata ricevuta una risposta diversa da 200 durante il download del nuovo programma di installazione di CMake",
	"downloaded.to.path": "{0} scaricato in {1}",
	"program.need.for.installer": "Per eseguire il programma di installazione di CMake, CMake Tools richiede il programma {0}",
	"downloading.filename": "Download di {0}",
	"running.cmake.installer": "Esecuzione del programma di installazione di CMake",
	"failed.to.authorize": "Non è stato possibile autorizzare l'esecuzione dell'installazione di CMake.",
	"permission.request.dismissed": "La richiesta di autorizzazione per eseguire l'installazione di CMake è stata ignorata.",
	"installer.failed": "Il programma di installazione di CMake ha restituito un valore diverso da zero [{0}]: {1}",
	"installer.failed.check.output": "Il programma di installazione CMake è stato terminato con un valore diverso da zero. Per altre informazioni, vedere il pannello output",
	"restart.now.button": "Riavvia ora",
	"installed.reload.to.complete": "La nuova versione di CMake è stata installata in /usr/local/bin/cmake. Ricaricare VS Code per completare le modifiche.",
	"error.comparing.versions": "Si è verificato un errore durante il confronto delle versioni di CMake per l'aggiornamento potenziale",
	"yes.button": "Sì",
	"ask.me.later.button": "Chiedi in seguito",
	"dont.ask.me.again.button": "Non visualizzare più questo messaggio",
	"new.version.available": "È disponibile una nuova versione di CMake. La versione in esecuzione è la {0}, mentre quella disponibile è la {1}. Scaricare e installare automaticamente questo aggiornamento con CMake Tools?"
}