/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"default.build.preset": "[Impostazione predefinita]",
	"default.build.preset.description": "Set di impostazioni di compilazione vuoto che non aggiunge argomenti",
	"default.test.preset": "[Impostazione predefinita]",
	"default.test.preset.description": "Set di impostazioni di test vuoto che non aggiunge argomenti",
	"no.cl.arch": "Preset di configurazione {0}: nessuna architettura specificata per cl.exe con x86 per impostazione predefinita",
	"no.cl.toolset.arch": "Preset di configurazione {0}: nessuna architettura del set di strumenti specificata per cl.exe, con host=x86 per impostazione predefinita",
	"invalid.cl.toolset.arch": "Configurare {0}: l'architettura del set di strumenti imprevista ha specificato '{1}', intendi 'host={1}'?",
	"no.cl.toolset.version": "Preset di configurazione {0}: nessuna versione del set di strumenti specificata per cl.exe con l’ultima versione per impostazione predefinita",
	"unknown.toolset.option": "L'opzione del set di strumenti non riconosciuta verrà ignorata: {0}",
	"config.preset.not.found": "Non è stato possibile trovare il set di impostazioni di configurazione denominato {0}",
	"specified.cl.not.found": "Preset di configurazione {0}: il cl.exe con set di strumenti {1} e architettura {2} specificato non è stato trovato, potrebbe essere necessario eseguire \"CMake: ricerca compilatori\" se è presente nel computer.",
	"ninja.not.set": "Ninja non è impostato su PATH, provare a usare {0}",
	"build.preset.not.found": "Non è stato possibile trovare il set di impostazioni di compilazione denominato {0}",
	"test.preset.not.found": "Non è stato possibile trovare il set di impostazioni di test denominato {0}",
	"clean.not.needed.no.prior.config.preset": "Pulizia non necessaria: nessun set di impostazioni di configurazione precedente selezionato",
	"clean.needed.config.preset.changed": "Pulizia necessaria: il set di impostazioni di configurazione è stato modificato"
}