/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"assets/variables.json.ANDROID": "Nastavte na hodnotu 1, pokud je cílovým systémem (CMAKE_SYSTEM_NAME) Android.",
	"assets/variables.json.APPLE": "Nastavte na hodnotu True, pokud je cílovým systémem platforma Apple (macOS, iOS, tvOS, visionOS nebo watchOS).",
	"assets/variables.json.BORLAND": "Zadejte hodnotu True, pokud se používá kompilátor Borland.",
	"assets/variables.json.BSD": "Nastavte na řetězcovou hodnotu, pokud je cílovým systémem BSD. Tato hodnota může být jedna z následujících hodnot: DragonFlyBSD, FreeBSD, OpenBSD nebo NetBSD.",
	"assets/variables.json.BUILD_SHARED_LIBS": "Instruujte add_library, ať při volání bez explicitního typu knihovny použije ve výchozím nastavení knihovny SHARED namísto knihoven STATIC.",
	"assets/variables.json.CACHE": "Operátor pro čtení proměnných mezipaměti",
	"assets/variables.json.CMAKE_ABSOLUTE_DESTINATION_FILES": "Seznam souborů, které se nainstalovaly pomocí cesty ABSOLUTE DESTINATION",
	"assets/variables.json.CMAKE_ADD_CUSTOM_COMMAND_DEPENDS_EXPLICIT_ONLY": "Určuje, jestli se má ve výchozím nastavení v add_custom_command povolit možnost DEPENDS_EXPLICIT_ONLY.",
	"assets/variables.json.CMAKE_ADSP_ROOT": "´Pokud je :ref: `Křížová kompilace pro ADSP SHARC/Blackfin`, obsahuje tato proměnná absolutní cestu k nejnovější instalaci CCES nebo VDSP++. Očekává se, že adresář bude obsahovat kompilátory cc21k.exe a ccblkfn.exe. Tato hodnota se nastaví automaticky, pokud je možné nalézt výchozí instalaci CCES nebo VDSP++.",
	"assets/variables.json.CMAKE_AIX_EXPORT_ALL_SYMBOLS": "Výchozí hodnota cílové vlastnosti AIX_EXPORT_ALL_SYMBOLS. Tato proměnná slouží k inicializaci této vlastnosti u každého cíle v době, kdy se vytváří.",
	"assets/variables.json.CMAKE_ANDROID_ANT_ADDITIONAL_OPTIONS": "Výchozí hodnota pro vlastnost ANDROID_ANT_ADDITIONAL_OPTIONS cílů. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_ANDROID_API": "Když se provádí křížová kompilace pro Android pomocí NVIDIA Nsight Tegra Visual Studio Edition, může se nastavit tato proměnná, která bude určovat výchozí hodnotu pro vlastnost ANDROID_API cílů. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_ANDROID_API_MIN": "Výchozí hodnota pro vlastnost ANDROID_API_MIN cílů. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_ANDROID_ARCH": "Když se provádí křížová kompilace pro Android pomocí NVIDIA Nsight Tegra Visual Studio Edition, může se nastavit tato proměnná, která bude určovat výchozí hodnotu pro vlastnost ANDROID_ARCH cílů. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_ANDROID_ARCH_ABI": "Když se provádí křížová kompilace pro Android, určuje tato proměnná cílovou architekturu a rozhraní ABI, které chcete použít. Platné hodnoty jsou:",
	"assets/variables.json.CMAKE_ANDROID_ARM_MODE": "Když se provádí křížová kompilace pro Android a proměnná CMAKE_ANDROID_ARCH_ABI je nastavená na některou z architektur armeabi, můžete cílit na 32bitové procesory ARM (-marm) nastavením proměnné CMAKE_ANDROID_ARM_MODE na hodnotu ON. Jinak se ve výchozím nastavení cílí na 16bitové procesory Thumb (-mthumb).",
	"assets/variables.json.CMAKE_ANDROID_ARM_NEON": "Když se provádí křížová kompilace pro Android a proměnná CMAKE_ANDROID_ARCH_ABI je nastavená na hodnotu armeabi-v7a, můžete cílit na zařízení ARM NEON nastavením proměnné CMAKE_ANDROID_ARM_NEON na hodnotu ON.",
	"assets/variables.json.CMAKE_ANDROID_ASSETS_DIRECTORIES": "Výchozí hodnota pro vlastnost ANDROID_ASSETS_DIRECTORIES cílů. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_ANDROID_EXCEPTIONS": "Když se provádí křížová kompilace pro Android pomocí sady NDK, dá se nastavením této proměnné určit, jestli se povolují výjimky.",
	"assets/variables.json.CMAKE_ANDROID_GUI": "Výchozí hodnota pro cílovou vlastnost ANDROID_GUI spustitelných souborů. Další informace najdete v popisu této cílové vlastnosti.",
	"assets/variables.json.CMAKE_ANDROID_JAR_DEPENDENCIES": "Výchozí hodnota pro vlastnost ANDROID_JAR_DEPENDENCIES cílů. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_ANDROID_JAR_DIRECTORIES": "Výchozí hodnota pro vlastnost ANDROID_JAR_DIRECTORIES cílů. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_ANDROID_JAVA_SOURCE_DIR": "Výchozí hodnota pro vlastnost ANDROID_JAVA_SOURCE_DIR cílů. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_ANDROID_NATIVE_LIB_DEPENDENCIES": "Výchozí hodnota pro vlastnost ANDROID_NATIVE_LIB_DEPENDENCIES cílů. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_ANDROID_NATIVE_LIB_DIRECTORIES": "Výchozí hodnota pro vlastnost ANDROID_NATIVE_LIB_DIRECTORIES cílů. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_ANDROID_NDK": "Když se provádí křížová kompilace pro Android pomocí sady NDK, uchovává tato proměnná absolutní cestu ke kořenovému adresáři sady NDK. Zadaný adresář musí obsahovat podadresář platforms s adresáři android-<api>.",
	"assets/variables.json.CMAKE_ANDROID_NDK_DEPRECATED_HEADERS": "Když se provádí křížová kompilace pro Android pomocí sady NDK, může se nastavením této proměnné určit, jestli se místo sjednocených hlaviček mají použít zastaralé hlavičky pro jednotlivá rozhraní API.",
	"assets/variables.json.CMAKE_ANDROID_NDK_TOOLCHAIN_HOST_TAG": "Když se provádí křížová kompilace pro Android pomocí sady NDK, poskytuje tato proměnná značku hostitele sady NDK, která se používá k vytvoření cesty k předkompilovaným sadám nástrojům běžícím na hostiteli.",
	"assets/variables.json.CMAKE_ANDROID_NDK_TOOLCHAIN_VERSION": "Když se provádí křížová kompilace pro Android pomocí sady NDK, může se nastavením této proměnné určit verze sady nástrojů, která se má použít jako kompilátor.",
	"assets/variables.json.CMAKE_ANDROID_NDK_VERSION": "Když se provádí křížová kompilace pro Android pomocí sad NDK a Android NDK verze 11 nebo vyšší, prostřednictvím této proměnné CMake hlásí číslo verze sady NDK.",
	"assets/variables.json.CMAKE_ANDROID_PROCESS_MAX": "Výchozí hodnota pro vlastnost ANDROID_PROCESS_MAX cílů. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_ANDROID_PROGUARD": "Výchozí hodnota pro vlastnost ANDROID_PROGUARD cílů. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_ANDROID_PROGUARD_CONFIG_PATH": "Výchozí hodnota pro vlastnost ANDROID_PROGUARD_CONFIG_PATH cílů. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_ANDROID_RTTI": "Když se provádí křížová kompilace pro Android pomocí sady NDK, dá se nastavením této proměnné určit, jestli se povoluje RTTI.",
	"assets/variables.json.CMAKE_ANDROID_SECURE_PROPS_PATH": "Výchozí hodnota pro vlastnost ANDROID_SECURE_PROPS_PATH cílů. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_ANDROID_SKIP_ANT_STEP": "Výchozí hodnota pro vlastnost ANDROID_SKIP_ANT_STEP cílů. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_ANDROID_STANDALONE_TOOLCHAIN": "Když se provádí křížová kompilace pro Android pomocí samostatné sady nástrojů, uchovává tato proměnná absolutní cestu ke kořenovému adresáři sady nástrojů. Zadaný adresář musí obsahovat podadresář sysroot.",
	"assets/variables.json.CMAKE_ANDROID_STL_TYPE": "Když se provádí křížová kompilace pro Android pomocí NVIDIA Nsight Tegra Visual Studio Edition, může se nastavit tato proměnná, která bude určovat výchozí hodnotu pro vlastnost ANDROID_STL_TYPE cílů. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_APPBUNDLE_PATH": "Středníky oddělený seznam adresářů určující cesty pro vyhledávání pro sady prostředků aplikací pro macOS používané příkazy find_program a find_package",
	"assets/variables.json.CMAKE_APPLE_SILICON_PROCESSOR": "Na hostitelích Apple Silicon, kteří používají macOS, nastavte tuto proměnnou tak, aby oznamovala nástroji CMake, jakou architekturu použít pro CMAKE_HOST_SYSTEM_PROCESSOR. Hodnota musí být buď arm64, nebo x86_64.",
	"assets/variables.json.CMAKE_AR": "Název archivačního nástroje pro statické knihovny",
	"assets/variables.json.CMAKE_ARCHIVE_OUTPUT_DIRECTORY": "Určuje umístění všech cílových souborů typu ARCHIVE při sestavování.",
	"assets/variables.json.CMAKE_ARCHIVE_OUTPUT_DIRECTORY_CONFIG": "Určuje umístění všech cílových souborů typu ARCHIVE při sestavování pro konkrétní konfiguraci.",
	"assets/variables.json.CMAKE_ARGC": "Počet argumentů příkazového řádku předaných nástroji CMake v režimu skriptu",
	"assets/variables.json.CMAKE_ARGV0": "Argument příkazového řádku předaný nástroji CMake v režimu skriptu",
	"assets/variables.json.CMAKE_AUTOGEN_BETTER_GRAPH_MULTI_CONFIG": "Tato proměnná slouží k inicializaci vlastnosti AUTOGEN_BETTER_GRAPH_MULTI_CONFIG u všech cílů při jejich vytváření. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_AUTOGEN_COMMAND_LINE_LENGTH_MAX": "Omezení délky příkazového řádku pro cíle autogen, tj. moc nebo uic, které aktivuje použití souborů odpovědí v systému Windows namísto předávání všech argumentů na příkazovém řádku.",
	"assets/variables.json.CMAKE_AUTOGEN_ORIGIN_DEPENDS": "Přepínač pro předávání závislostí cíle původu příslušným cílům <ORIGIN>_autogen",
	"assets/variables.json.CMAKE_AUTOGEN_PARALLEL": "Počet paralelních procesů moc nebo uic, které se mají spustit při použití možností AUTOMOC a AUTOUIC",
	"assets/variables.json.CMAKE_AUTOGEN_USE_SYSTEM_INCLUDE": "Tato proměnná slouží k inicializaci vlastnosti AUTOGEN_USE_SYSTEM_INCLUDE u všech cílů při jejich vytváření. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_AUTOGEN_VERBOSE": "Umožňuje nastavit úroveň podrobností pro AUTOMOC, AUTOUIC a AUTORCC. Kladná celočíselná hodnota nebo logická hodnota true umožní, aby generátory AUTO* vypisovaly další informace o zpracování.",
	"assets/variables.json.CMAKE_AUTOMOC": "Určuje, jestli se má automaticky zpracovat moc pro cíle Qt.",
	"assets/variables.json.CMAKE_AUTOMOC_COMPILER_PREDEFINES": "Tato proměnná slouží k inicializaci vlastnosti AUTOMOC_COMPILER_PREDEFINES na všech cílech. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_AUTOMOC_DEPEND_FILTERS": "Definice filtrů, které CMAKE_AUTOMOC používá k extrahování názvů souborů ze zdrojového kódu jako dalších závislostí pro soubor moc",
	"assets/variables.json.CMAKE_AUTOMOC_EXECUTABLE": "Tato proměnná slouží k inicializaci vlastnosti AUTOMOC_EXECUTABLE ve všech cílech. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_AUTOMOC_MACRO_NAMES": "Středníky oddělený seznam názvů maker, který CMAKE_AUTOMOC používá k určení, jestli moc musí zpracovat soubor C++",
	"assets/variables.json.CMAKE_AUTOMOC_MOC_OPTIONS": "Další možnosti pro moc při použití CMAKE_AUTOMOC",
	"assets/variables.json.CMAKE_AUTOMOC_PATH_PREFIX": "Určuje, jestli se má vygenerovat předponový parametr cesty -p pro funkci moc na cílech Qt s povolenou funkcí AUTOMOC.",
	"assets/variables.json.CMAKE_AUTOMOC_RELAXED_MODE": "Umožňuje přepínat u generátoru automoc mezi režimy strict a relaxed.",
	"assets/variables.json.CMAKE_AUTORCC": "Určuje, jestli se má automaticky zpracovat rcc pro cíle Qt.",
	"assets/variables.json.CMAKE_AUTORCC_EXECUTABLE": "Tato proměnná slouží k inicializaci vlastnosti AUTORCC_EXECUTABLE ve všech cílech. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_AUTORCC_OPTIONS": "Další možnosti pro rcc při použití CMAKE_AUTORCC",
	"assets/variables.json.CMAKE_AUTOUIC": "Určuje, jestli se má automaticky zpracovat uic pro cíle Qt.",
	"assets/variables.json.CMAKE_AUTOUIC_EXECUTABLE": "Tato proměnná slouží k inicializaci vlastnosti AUTOUIC_EXECUTABLE ve všech cílech. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_AUTOUIC_OPTIONS": "Další možnosti pro uic při použití CMAKE_AUTOUIC",
	"assets/variables.json.CMAKE_AUTOUIC_SEARCH_PATHS": "Seznam cest pro vyhledávání, které CMAKE_AUTOUIC používá k hledání zahrnutých souborů .ui",
	"assets/variables.json.CMAKE_BACKWARDS_COMPATIBILITY": "Zastaralé. Podívejte se na dokumentaci k zásadě CMake CMP0001.",
	"assets/variables.json.CMAKE_BINARY_DIR": "Cesta k nejvyšší úrovni stromu sestavení",
	"assets/variables.json.CMAKE_BUILD_RPATH": "Středníky oddělený seznam položek cest runtime (RPATH), které se mají přidat do binárních souborů propojených ve stromu sestavení (na platformách, které to podporují). Položky se nebudou používat pro binární soubory ve stromu instalace. Viz také informace o proměnné CMAKE_INSTALL_RPATH.",
	"assets/variables.json.CMAKE_BUILD_RPATH_USE_ORIGIN": "Určuje, jestli se mají použít relativní cesty pro parametr RPATH sestavení.",
	"assets/variables.json.CMAKE_BUILD_TOOL": "Tato proměnná existuje jenom v zájmu zpětné kompatibility. Obsahuje stejnou hodnotu jako CMAKE_MAKE_PROGRAM. Použijte radši tuto proměnnou.",
	"assets/variables.json.CMAKE_BUILD_TYPE": "Určuje typ sestavení pro generátory s jednou konfigurací (např. generátory Makefile nebo Ninja). Mezi obvyklé hodnoty patří Debug, Release, RelWithDebInfo a MinSizeRel, ale je možné definovat i vlastní typy sestavení.",
	"assets/variables.json.CMAKE_BUILD_WITH_INSTALL_NAME_DIR": "Určuje, jestli se má použít cesta INSTALL_NAME_DIR pro cíle ve stromu sestavení.",
	"assets/variables.json.CMAKE_BUILD_WITH_INSTALL_RPATH": "Umožňuje použít pro RPATH cestu instalace.",
	"assets/variables.json.CMAKE_CACHEFILE_DIR": "Tato proměnná je používána interně nástrojem CMake a nemusí být nastavena během první konfigurace stromu sestavení. Když je nastavena, má stejnou hodnotu jako CMAKE_BINARY_DIR. Použijte místo ní tuto proměnnou.",
	"assets/variables.json.CMAKE_CACHE_MAJOR_VERSION": "Hlavní verze nástroje CMake použitá k vytvoření souboru CMakeCache.txt",
	"assets/variables.json.CMAKE_CACHE_MINOR_VERSION": "Podverze nástroje CMake použitá k vytvoření souboru CMakeCache.txt",
	"assets/variables.json.CMAKE_CACHE_PATCH_VERSION": "Verze opravy nástroje CMake použitá k vytvoření souboru CMakeCache.txt",
	"assets/variables.json.CMAKE_CFG_INTDIR": "Odkaz v čase sestavení na výstupní podadresář pro jednotlivé konfigurace",
	"assets/variables.json.CMAKE_CLANG_VFS_OVERLAY": "Když se provádí křížová kompilace pro Windows pomocí nástroje clang-cl, může být tato proměnná absolutní cestou odkazující na soubor YAML virtuálního souborového systému clang, který umožní nástroji clang-cl překládat názvy hlaviček systému Windows v systému souborů, který rozlišuje velká a malá písmena.",
	"assets/variables.json.CMAKE_CL_64": "Nedoporučuje se. Použijte radši CMAKE_SIZEOF_VOID_P.",
	"assets/variables.json.CMAKE_CODEBLOCKS_COMPILER_ID": "Umožňuje změnit ID kompilátoru v generovaných souborech projektů CodeBlocks.",
	"assets/variables.json.CMAKE_CODEBLOCKS_EXCLUDE_EXTERNAL_FILES": "Umožňuje změnit způsob, jakým generátor CodeBlocks vytváří soubory projektů.",
	"assets/variables.json.CMAKE_CODELITE_USE_TARGETS": "Umožňuje změnit způsob, jakým generátor CodeLite vytváří soubory projektů.",
	"assets/variables.json.CMAKE_COLOR_DIAGNOSTICS": "Povolte v celém prostředí diagnostiku barev.",
	"assets/variables.json.CMAKE_COLOR_MAKEFILE": "Umožňuje barevný výstup při použití generátorů Makefile.",
	"assets/variables.json.CMAKE_COMMAND": "Úplná cesta ke spustitelnému souboru nástroje cmake",
	"assets/variables.json.CMAKE_COMPILER_2005": "Použití kompilátoru Visual Studio 2005 od Microsoftu",
	"assets/variables.json.CMAKE_COMPILER_IS_GNUCC": "True, pokud je kompilátorem C GNU.",
	"assets/variables.json.CMAKE_COMPILER_IS_GNUCXX": "True, pokud je kompilátorem C++ (CXX) GNU.",
	"assets/variables.json.CMAKE_COMPILER_IS_GNUG77": "True, pokud je kompilátorem C++ Fortran.",
	"assets/variables.json.CMAKE_COMPILE_PDB_OUTPUT_DIRECTORY": "Výstupní adresář pro soubory symbolů ladění MS ve formátu .pdb generované kompilátorem při sestavování zdrojových souborů",
	"assets/variables.json.CMAKE_COMPILE_PDB_OUTPUT_DIRECTORY_CONFIG": "Výstupní adresář pro jednotlivé konfigurace pro soubory symbolů ladění MS ve formátu .pdb generované kompilátorem při sestavování zdrojových souborů",
	"assets/variables.json.CMAKE_COMPILE_WARNING_AS_ERROR": "Určete, jestli se mají upozornění při kompilaci zpracovávat jako chyby.",
	"assets/variables.json.CMAKE_CONFIGURATION_TYPES": "Určuje dostupné typy sestavení (konfigurace) pro generátory s více konfiguracemi (např. Visual Studio, Xcode nebo Ninja Multi-Config) jako seznam oddělený středníky. Mezi obvyklé položky patří Debug, Release, RelWithDebInfo a MinSizeRel, ale je možné definovat i vlastní typy sestavení.",
	"assets/variables.json.CMAKE_CONFIG_POSTFIX": "Výchozí přípona názvu souboru pro knihovny v konfiguraci <CONFIG>",
	"assets/variables.json.CMAKE_CPACK_COMMAND": "Úplná cesta k příkazu cpack nainstalovanému pomocí nástroje CMake",
	"assets/variables.json.CMAKE_CROSSCOMPILING": "Tuto proměnnou nastavuje CMake tak, aby označovala, jestli provádí křížovou kompilaci, ale všimněte si níže popsaných omezení.",
	"assets/variables.json.CMAKE_CROSSCOMPILING_EMULATOR": "Tato proměnná se používá, jenom když je zapnutá možnost CMAKE_CROSSCOMPILING. Měla by odkazovat na příkaz v hostitelském systému, který může spustit spustitelný soubor sestavený pro cílový systém.",
	"assets/variables.json.CMAKE_CROSS_CONFIGS": "Určuje středníky oddělený seznam konfigurací, které jsou k dispozici ze všech souborů build-<Config>.ninja v generátoru s více konfiguracemi Ninja. Tato proměnná aktivuje režim křížové konfigurace. Cíle z každé konfigurace určené v této proměnné můžou být sestaveny z libovolného souboru build-<Config>.ninja. Vlastní příkazy budou používat konfiguraci, která je nativní pro build-<Config>.ninja. Pokud je možnost nastavená na hodnotu Vše, všechny konfigurace z CMAKE_CONFIGURATION_TYPES jsou křížové konfigurace. Pokud není nastavená nebo je prázdná, každý soubor build-<Config>.ninja bude obsahovat jenom pravidla sestavení pro svoji vlastní konfiguraci.",
	"assets/variables.json.CMAKE_CTEST_ARGUMENTS": "Nastavte tuto možnost na středníky oddělený seznam argumentů příkazového řádku, které se mají předat funkci ctest při spouštění testů přes cíl test (nebo RUN_TESTS) vygenerovaného systému sestavení.",
	"assets/variables.json.CMAKE_CTEST_COMMAND": "Úplná cesta k příkazu ctest nainstalovanému pomocí nástroje CMake",
	"assets/variables.json.CMAKE_CUDA_ARCHITECTURES": "Výchozí hodnota pro vlastnost CUDA_ARCHITECTURES cílů",
	"assets/variables.json.CMAKE_CUDA_COMPILE_FEATURES": "Seznam funkcí známých v kompilátoru jazyka CUDA",
	"assets/variables.json.CMAKE_CUDA_EXTENSIONS": "Výchozí hodnota pro cílovou vlastnost CUDA_EXTENSIONS, pokud je nastavena při vytvoření cíle",
	"assets/variables.json.CMAKE_CUDA_HOST_COMPILER": "Toto je původní název specifický pro CUDA pro obecnější proměnnou CMAKE_<LANG>_HOST_COMPILER. Podrobnosti najdete v tomdruhém.",
	"assets/variables.json.CMAKE_CUDA_RESOLVE_DEVICE_SYMBOLS": "Výchozí hodnota pro cílovou vlastnost CUDA_RESOLVE_DEVICE_SYMBOLS, pokud je definována. Ve výchozím nastavení není tato proměnná definována.",
	"assets/variables.json.CMAKE_CUDA_RUNTIME_LIBRARY": "Vyberte knihovnu runtime CUDA, která se má použít při kompilaci a propojení CUDA. Tato proměnná slouží k inicializaci vlastnosti CUDA_RUNTIME_LIBRARY u všech cílů v době, kdy se vytvářejí.",
	"assets/variables.json.CMAKE_CUDA_SEPARABLE_COMPILATION": "Výchozí hodnota pro vlastnost CUDA_SEPARABLE_COMPILATION cílů. Tato proměnná slouží k inicializaci vlastnosti u každého cíle při jeho vytvoření.",
	"assets/variables.json.CMAKE_CUDA_STANDARD": "Výchozí hodnota pro cílovou vlastnost CUDA_STANDARD, pokud je nastavena při vytvoření cíle",
	"assets/variables.json.CMAKE_CUDA_STANDARD_REQUIRED": "Výchozí hodnota pro cílovou vlastnost CUDA_REQUIRED, pokud je nastavena při vytvoření cíle",
	"assets/variables.json.CMAKE_CUDA_TOOLKIT_INCLUDE_DIRECTORIES": "Když je povolený jazyk CUDA, toto nastavení poskytuje středníky oddělený seznam zahrnutých adresářů poskytovaných sadou CUDA Toolkit. Hodnota může být užitečná pro zahrnutí hlaviček CUDA do zdrojových souborů v C++.",
	"assets/variables.json.CMAKE_CURRENT_BINARY_DIR": "Cesta k aktuálně zpracovávanému adresáři binárních souborů",
	"assets/variables.json.CMAKE_CURRENT_FUNCTION": "Tato proměnná při spouštění kódu uvnitř funkce obsahuje název aktuální funkce. Může to být užitečné pro diagnostické nebo ladicí zprávy.",
	"assets/variables.json.CMAKE_CURRENT_FUNCTION_LIST_DIR": "Tato proměnná při spouštění kódu uvnitř funkce obsahuje úplný adresář souboru listfile, který definoval aktuální funkci.",
	"assets/variables.json.CMAKE_CURRENT_FUNCTION_LIST_FILE": "Tato proměnná při spouštění kódu uvnitř funkce obsahuje úplnou cestu k souboru listfile, který definoval aktuální funkci.",
	"assets/variables.json.CMAKE_CURRENT_FUNCTION_LIST_LINE": "Tato proměnná při spouštění kódu uvnitř funkce obsahuje číslo řádku v souboru listfile, kde se definovala aktuální funkce.",
	"assets/variables.json.CMAKE_CURRENT_LIST_DIR": "Úplný adresář právě zpracovávaného souboru listfile",
	"assets/variables.json.CMAKE_CURRENT_LIST_FILE": "Úplná cesta k právě zpracovávanému souboru listfile",
	"assets/variables.json.CMAKE_CURRENT_LIST_LINE": "Číslo řádku aktuálně zpracovávaného souboru",
	"assets/variables.json.CMAKE_CURRENT_SOURCE_DIR": "Cesta k aktuálně zpracovávanému zdrojovému adresáři",
	"assets/variables.json.CMAKE_CXX_COMPILER_IMPORT_STD": "Seznam standardních úrovní C++, ke kterým existuje podpora pro import std pro aktuální sadu nástrojů C++. Podpora pro C++<NN> se dá zjistit pomocí predikátu <NN> IN_LIST CMAKE_CXX_COMPILER_IMPORT_STD s příkazem if.",
	"assets/variables.json.CMAKE_CXX_COMPILE_FEATURES": "Seznam funkcí známých v kompilátoru jazyka C++",
	"assets/variables.json.CMAKE_CXX_EXTENSIONS": "Výchozí hodnota pro cílovou vlastnost CXX_EXTENSIONS, pokud je nastavena při vytvoření cíle",
	"assets/variables.json.CMAKE_CXX_MODULE_STD": "Určuje, jestli se mají cíle nástroje přidávat jako závislosti k cílům s alespoň cxx_std_23, nebo ne.",
	"assets/variables.json.CMAKE_CXX_SCAN_FOR_MODULES": "Určuje, jestli se mají vyhledat závislosti modulů ve zdrojových souborech C++.",
	"assets/variables.json.CMAKE_CXX_STANDARD": "Výchozí hodnota pro cílovou vlastnost CXX_STANDARD, pokud je nastavena při vytvoření cíle",
	"assets/variables.json.CMAKE_CXX_STANDARD_REQUIRED": "Výchozí hodnota pro cílovou vlastnost CXX_REQUIRED, pokud je nastavena při vytvoření cíle",
	"assets/variables.json.CMAKE_C_COMPILE_FEATURES": "Seznam funkcí známých v kompilátoru jazyka C",
	"assets/variables.json.CMAKE_C_EXTENSIONS": "Výchozí hodnota pro cílovou vlastnost C_EXTENSIONS, pokud je nastavena při vytvoření cíle",
	"assets/variables.json.CMAKE_C_STANDARD": "Výchozí hodnota pro cílovou vlastnost C_STANDARD, pokud je nastavena při vytvoření cíle",
	"assets/variables.json.CMAKE_C_STANDARD_REQUIRED": "Výchozí hodnota pro cílovou vlastnost C_REQUIRED, pokud je nastavena při vytvoření cíle",
	"assets/variables.json.CMAKE_DEBUG_POSTFIX": "Viz informace o proměnné CMAKE_<CONFIG>_POSTFIX.",
	"assets/variables.json.CMAKE_DEBUG_TARGET_PROPERTIES": "Povolí trasování výstupu vlastností cílů.",
	"assets/variables.json.CMAKE_DEFAULT_BUILD_TYPE": "Určuje konfiguraci, která se má použít ve výchozím nastavení v souboru build.ninja v generátoru s více konfiguracemi Ninja. Pokud je tato proměnná zadána, build.ninja používá ve výchozím nastavení pravidla sestavení ze souboru build-<Config>.ninja. Všechny vlastní příkazy se spouštějí s touto konfigurací. Pokud není proměnná zadána, použije se první položka z CMAKE_CONFIGURATION_TYPES.",
	"assets/variables.json.CMAKE_DEFAULT_CONFIGS": "Určuje středníky oddělený seznam konfigurací, které se mají sestavovat pro cíl v souboru build.ninja, pokud není v generátoru s více konfiguracemi Ninja zadána žádná přípona :<Config>. Pokud je proměnná nastavená na hodnotu Vše, použijí se všechny konfigurace z CMAKE_CROSS_CONFIGS. Pokud není zadaná, použije se jako výchozí hodnota CMAKE_DEFAULT_BUILD_TYPE.",
	"assets/variables.json.CMAKE_DEPENDS_IN_PROJECT_ONLY": "Při nastavení na hodnotu TRUE v adresáři se sestavovací systém vyprodukovaný generátory Makefile nastaví tak, aby bral v úvahu jenom závislosti na zdrojových souborech, které se vyskytují v adresářích zdrojových nebo binárních souborů. Změny zdrojových souborů mimo tyto adresáře nepovedou k opakovanému sestavení.",
	"assets/variables.json.CMAKE_DEPENDS_USE_COMPILER": "Pro generátory Makefile teď zdrojové závislosti pro výběr kompilátorů generuje samotný kompilátor. Když se tato proměnná definuje s hodnotou FALSE, můžete obnovit starší verze chování (tj. zjišťovat závislosti pomocí nástroje CMake).",
	"assets/variables.json.CMAKE_DIRECTORY_LABELS": "Zadejte popisky pro aktuální adresář.",
	"assets/variables.json.CMAKE_DISABLE_FIND_PACKAGE_PackageName": "Proměnná pro zakázání volání find_package",
	"assets/variables.json.CMAKE_DISABLE_PRECOMPILE_HEADERS": "Výchozí hodnota pro vlastnost DISABLE_PRECOMPILE_HEADERS cílů",
	"assets/variables.json.CMAKE_DLL_NAME_WITH_SOVERSION": "Tato proměnná slouží k inicializaci vlastnosti DLL_NAME_WITH_SOVERSION na cílech sdílené knihovny pro platformu Windows, která je vybrána při nastavení proměnné WIN32.",
	"assets/variables.json.CMAKE_DL_LIBS": "Název knihovny obsahující dlopen a dlclose",
	"assets/variables.json.CMAKE_DOTNET_SDK": "Výchozí hodnota pro vlastnost DOTNET_SDK cílů.",
	"assets/variables.json.CMAKE_DOTNET_TARGET_FRAMEWORK": "Výchozí hodnota pro vlastnost DOTNET_TARGET_FRAMEWORK cílů",
	"assets/variables.json.CMAKE_DOTNET_TARGET_FRAMEWORK_VERSION": "Výchozí hodnota vlastnosti DOTNET_TARGET_FRAMEWORK_VERSION pro cíle",
	"assets/variables.json.CMAKE_ECLIPSE_GENERATE_LINKED_RESOURCES": "Tuto proměnnou mezipaměti používá generátor projektů Eclipse. Viz cmake-generators.",
	"assets/variables.json.CMAKE_ECLIPSE_GENERATE_SOURCE_PROJECT": "Tuto proměnnou mezipaměti používá generátor projektů Eclipse. Viz cmake-generators.",
	"assets/variables.json.CMAKE_ECLIPSE_MAKE_ARGUMENTS": "Tuto proměnnou mezipaměti používá generátor projektů Eclipse. Viz cmake-generators.",
	"assets/variables.json.CMAKE_ECLIPSE_RESOURCE_ENCODING": "Tato proměnná mezipaměti sděluje generátoru projektů Eclipse CDT4, aby v generovaných souborech projektu nastavil kódování prostředků na danou hodnotu. Pokud není zadaná žádná hodnota, kódování se nenastaví.",
	"assets/variables.json.CMAKE_ECLIPSE_VERSION": "Tuto proměnnou mezipaměti používá generátor projektů Eclipse. Viz cmake-generators.",
	"assets/variables.json.CMAKE_EDIT_COMMAND": "Úplná cesta k cmake-gui nebo ccmake. Definováno pouze pro generátory souborů pravidel a generátory Ninja, pokud nepoužíváte žádné další generátory.",
	"assets/variables.json.CMAKE_ENABLE_EXPORTS": "Určuje, jestli spustitelné soubory exportují symboly pro načitatelné moduly.",
	"assets/variables.json.CMAKE_ERROR_DEPRECATED": "Určuje, jestli se u zastaralých funkcí mají zobrazovat chyby.",
	"assets/variables.json.CMAKE_ERROR_ON_ABSOLUTE_INSTALL_DESTINATION": "Vyžádat, aby skript cmake_install.cmake skončil chybou, jakmile dojde ke zjištění souboru s absolutní hodnotou INSTALL DESTINATION",
	"assets/variables.json.CMAKE_EXECUTABLE_ENABLE_EXPORTS": "Určuje, jestli spustitelné soubory exportují symboly pro načitatelné moduly.",
	"assets/variables.json.CMAKE_EXECUTABLE_SUFFIX": "Přípona spustitelných souborů na této platformě",
	"assets/variables.json.CMAKE_EXECUTABLE_SUFFIX_LANG": "Přípona, která se má použít pro konec spustitelného názvu souboru cílové architektury kompilátoru <LANG>, pokud existuje.",
	"assets/variables.json.CMAKE_EXECUTE_PROCESS_COMMAND_ECHO": "Pokud je tato proměnná nastavená na STDERR, STDOUT nebo NONE, příkazy ve voláních execute_process budou vytištěny na stderr nebo stdout nebo vůbec.",
	"assets/variables.json.CMAKE_EXE_LINKER_FLAGS": "Příznaky linkeru, které se mají použít pro vytvoření spustitelných souborů",
	"assets/variables.json.CMAKE_EXE_LINKER_FLAGS_CONFIG": "Příznaky, které se mají použít při připojování spustitelného souboru",
	"assets/variables.json.CMAKE_EXE_LINKER_FLAGS_CONFIG_INIT": "Hodnota používaná k inicializaci položky mezipaměti CMAKE_EXE_LINKER_FLAGS_ při první konfiguraci stromu sestavení. Tuto proměnnou by měl nastavit soubor sady nástrojů. CMake může k této hodnotě předřadit nebo připojit obsah na základě prostředí a cílové platformy.",
	"assets/variables.json.CMAKE_EXE_LINKER_FLAGS_INIT": "Hodnota používaná k inicializaci položky mezipaměti CMAKE_EXE_LINKER_FLAGS při první konfiguraci stromu sestavení. Tuto proměnnou by měl nastavit soubor sady nástrojů. CMake může k této hodnotě předřadit nebo připojit obsah na základě prostředí a cílové platformy.",
	"assets/variables.json.CMAKE_EXPORT_COMPILE_COMMANDS": "Povolit nebo zakázat výstup příkazů kompilace během generování",
	"assets/variables.json.CMAKE_EXPORT_FIND_PACKAGE_NAME": "Inicializuje hodnotu EXPORT_FIND_PACKAGE_NAME.",
	"assets/variables.json.CMAKE_EXPORT_NO_PACKAGE_REGISTRY": "Zakáže příkaz Export, když možnost CMP0090 není nastavená na hodnotu NOVÉ.",
	"assets/variables.json.CMAKE_EXPORT_PACKAGE_REGISTRY": "Povolí příkaz Export, když je možnost CMP0090 nastavená na hodnotu NOVÉ.",
	"assets/variables.json.CMAKE_EXTRA_GENERATOR": "Další generátor, který se používá k sestavení projektu. Viz cmake-generators.",
	"assets/variables.json.CMAKE_EXTRA_SHARED_LIBRARY_SUFFIXES": "Další přípony pro sdílené knihovny",
	"assets/variables.json.CMAKE_FIND_APPBUNDLE": "Tato proměnná ovlivňuje, jak příkazy find_* volí mezi balíčky aplikací macOS a komponentami balíčku unix-style.",
	"assets/variables.json.CMAKE_FIND_DEBUG_MODE": "Pro následující příkazy do standardní chyby vytisknout dodatečné informace o vyhledání volání:",
	"assets/variables.json.CMAKE_FIND_FRAMEWORK": "Tato proměnná ovlivňuje, jak příkazy find_* volí mezi rozhraními macOS a komponentami balíčku unix-style.",
	"assets/variables.json.CMAKE_FIND_LIBRARY_CUSTOM_LIB_SUFFIX": "Zadejte <suffix>, abyste příkazu find_library určili, že před každým adresářem lib, který by se normálně prohledával, se má hledat v adresáři lib<suffix>.",
	"assets/variables.json.CMAKE_FIND_LIBRARY_PREFIXES": "Předpony, které se mají předřadit při hledání knihoven",
	"assets/variables.json.CMAKE_FIND_LIBRARY_SUFFIXES": "Přípony, které se mají připojit při hledání knihoven",
	"assets/variables.json.CMAKE_FIND_NO_INSTALL_PREFIX": "Vyloučí hodnoty proměnných CMAKE_INSTALL_PREFIX a CMAKE_STAGING_PREFIX z CMAKE_SYSTEM_PREFIX_PATH. CMake standardně přidává tyto prefixy cíle projektu do CMAKE_SYSTEM_PREFIX_PATH za účelem podpory vytvoření série závislých balíčků a jejich instalace do společného prefixu. Pokud chcete toto chování potlačit, nastavte CMAKE_FIND_NO_INSTALL_PREFIX na hodnotu TRUE.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_NAME": "Definuje se příkazem find_package během načítání modulu find pro záznam názvu balíčku určeného volající funkcí. Podrobnosti najdete v dokumentaci k příkazu.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_NO_PACKAGE_REGISTRY": "Ve výchozím nastavení není tato proměnná nastavena. Pokud není nastavená možnost CMAKE_FIND_USE_PACKAGE_REGISTRY ani CMAKE_FIND_PACKAGE_NO_PACKAGE_REGISTRY, bude příkaz find_package() používat uživatelský registr balíčků, pokud není zadána možnost NO_CMAKE_PACKAGE_REGISTRY.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_NO_SYSTEM_PACKAGE_REGISTRY": "Ve výchozím nastavení není tato proměnná nastavena. Pokud není nastavená možnost CMAKE_FIND_USE_SYSTEM_PACKAGE_REGISTRY ani CMAKE_FIND_PACKAGE_NO_SYSTEM_PACKAGE_REGISTRY, bude příkaz find_package() používat systémový registr balíčků, pokud není zadána možnost NO_CMAKE_SYSTEM_PACKAGE_REGISTRY.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_PREFER_CONFIG": "Oznámí příkazu find_package před režimem Module vyzkoušet režim Config, pokud nebyl zadán žádný režim.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_REDIRECTS_DIR": "Tato proměnná je určena pouze pro čtení a určuje adresář, který příkaz find_package nejprve zkontroluje, než začne hledat soubor modulu nebo konfiguračního balíčku kdekoli jinde. Soubor konfiguračního balíčku v tomto adresáři bude vždy nalezen přednostně před jakýmkoli jiným souborem modulu nebo souborem konfiguračního balíčku.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_RESOLVE_SYMLINKS": "Nastavte možnost na hodnotu TRUE, pokud chcete, aby volání find_package vyřešila symbolické odkazy v hodnotě <PackageName>_DIR.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_SORT_DIRECTION": "Směr řazení, který používá CMAKE_FIND_PACKAGE_SORT_ORDER. Může mít jednu z následujících hodnot:",
	"assets/variables.json.CMAKE_FIND_PACKAGE_SORT_ORDER": "Výchozí pořadí řazení balíčků, které bylo nalezeno při použití příkazu find_package. Může mít jednu z následujících hodnot:",
	"assets/variables.json.CMAKE_FIND_PACKAGE_TARGETS_GLOBAL": "Nastavení na TRUE povýší všechny IMPORTOVANÉ cíle zjištěné pomocí find_package na GLOBALÁLNí obor.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_WARN_NO_MODULE": "Určí, aby příkaz find_package zobrazil upozornění, pokud je volán bez explicitního režimu.",
	"assets/variables.json.CMAKE_FIND_ROOT_PATH": "Seznam kořenových cest oddělených středníky pro hledání v systému souborů",
	"assets/variables.json.CMAKE_FIND_ROOT_PATH_MODE_INCLUDE": "Tato proměnná určuje, jestli FIND_XXX používá cesty CMAKE_FIND_ROOT_PATH a CMAKE_SYSROOT.",
	"assets/variables.json.CMAKE_FIND_ROOT_PATH_MODE_LIBRARY": "Tato proměnná určuje, jestli FIND_XXX používá cesty CMAKE_FIND_ROOT_PATH a CMAKE_SYSROOT.",
	"assets/variables.json.CMAKE_FIND_ROOT_PATH_MODE_PACKAGE": "Tato proměnná určuje, jestli FIND_XXX používá cesty CMAKE_FIND_ROOT_PATH a CMAKE_SYSROOT.",
	"assets/variables.json.CMAKE_FIND_ROOT_PATH_MODE_PROGRAM": "Tato proměnná určuje, jestli FIND_XXX používá cesty CMAKE_FIND_ROOT_PATH a CMAKE_SYSROOT.",
	"assets/variables.json.CMAKE_FIND_USE_CMAKE_ENVIRONMENT_PATH": "Řídí výchozí chování následujících příkazů pro to, jestli se mají prohledávat cesty poskytnuté proměnnými prostředí, které jsou specifické pro cmake:",
	"assets/variables.json.CMAKE_FIND_USE_CMAKE_PATH": "Řídí výchozí chování následujících příkazů pro to, jestli se mají prohledávat cesty poskytnuté proměnnými mezipaměti, které jsou specifické pro cmake:",
	"assets/variables.json.CMAKE_FIND_USE_CMAKE_SYSTEM_PATH": "Řídí výchozí chování následujících příkazů pro to, jestli se mají prohledávat cesty poskytnuté proměnnými cmake, které jsou specifické pro platformu:",
	"assets/variables.json.CMAKE_FIND_USE_INSTALL_PREFIX": "Ovládá výchozí chování následujících příkazů. Konkrétně to, jestli se mají prohledávat umístění v proměnných CMAKE_INSTALL_PREFIX a CMAKE_STAGING_PREFIX.",
	"assets/variables.json.CMAKE_FIND_USE_PACKAGE_REGISTRY": "Řídí výchozí chování příkazu find_package pro to, jestli se mají prohledávat cesty poskytnuté uživatelským registrem balíčků.",
	"assets/variables.json.CMAKE_FIND_USE_PACKAGE_ROOT_PATH": "Řídí výchozí chování následujících příkazů pro to, jestli se mají prohledávat cesty poskytnuté proměnnými <PackageName>_ROOT:",
	"assets/variables.json.CMAKE_FIND_USE_SYSTEM_ENVIRONMENT_PATH": "Řídí výchozí chování následujících příkazů pro to, jestli se mají prohledávat cesty poskytnuté standardními systémovými proměnnými prostředí:",
	"assets/variables.json.CMAKE_FIND_USE_SYSTEM_PACKAGE_REGISTRY": "Řídí prohledávání systémového registru balíčků příkazem find_package.",
	"assets/variables.json.CMAKE_FOLDER": "Umožňuje nastavit název složky. Slouží k uspořádání cílů v integrovaném vývojovém prostředí.",
	"assets/variables.json.CMAKE_Fortran_FORMAT": "Nastavením hodnoty FIXED nebo FREE můžete určit rozložení zdroje v jazyce Fortran.",
	"assets/variables.json.CMAKE_Fortran_MODDIR_DEFAULT": "Výchozí adresář výstupu modulu pro Fortran",
	"assets/variables.json.CMAKE_Fortran_MODDIR_FLAG": "Příznak Fortranu pro adresář výstupu modulu",
	"assets/variables.json.CMAKE_Fortran_MODOUT_FLAG": "Příznak Fortranu pro povolení výstupu modulu",
	"assets/variables.json.CMAKE_Fortran_MODULE_DIRECTORY": "Adresář výstupu modulu pro Fortran",
	"assets/variables.json.CMAKE_Fortran_PREPROCESS": "Výchozí hodnota pro vlastnost Fortran_PREPROCESS cílů",
	"assets/variables.json.CMAKE_FRAMEWORK": "Výchozí hodnota pro vlastnost FRAMEWORK cílů",
	"assets/variables.json.CMAKE_FRAMEWORK_MULTI_CONFIG_POSTFIX_CONFIG": "Výchozí přípona názvu souboru architektury v konfiguraci <CONFIG> při použití generátoru s více konfiguracemi",
	"assets/variables.json.CMAKE_FRAMEWORK_PATH": "Seznam adresářů oddělených středníky, který určuje cestu pro hledání rozhraní macOS používaných příkazy find_library, find_package, find_path a find_file.",
	"assets/variables.json.CMAKE_GENERATOR": "Generátor, který se používá k sestavení projektu. Viz cmake-generators.",
	"assets/variables.json.CMAKE_GENERATOR_INSTANCE": "Specifikace instance pro konkrétní generátor, kterou zadal uživatel",
	"assets/variables.json.CMAKE_GENERATOR_PLATFORM": "Specifikace cílové platformy pro konkrétní generátor, kterou zadal uživatel",
	"assets/variables.json.CMAKE_GENERATOR_TOOLSET": "Specifikace nativní sady nástrojů systému sestavení, kterou zadal uživatel",
	"assets/variables.json.CMAKE_GHS_NO_SOURCE_GROUP_FILE": "Logická hodnota ZAPNOUT/VYPNOUT k řízení toho, jestli soubor projektu pro cíl by měl být jeden jediný soubor nebo více souborů. Další podrobnosti najdete v informacích k vlastnosti GHS_NO_SOURCE_GROUP_FILE.",
	"assets/variables.json.CMAKE_GLOBAL_AUTOGEN_TARGET": "Přepínač k povolení generování globálního cíle autogen",
	"assets/variables.json.CMAKE_GLOBAL_AUTOGEN_TARGET_NAME": "Umožňuje změnit název globálního cíle autogen.",
	"assets/variables.json.CMAKE_GLOBAL_AUTORCC_TARGET": "Přepínač k povolení generování globálního cíle autorcc",
	"assets/variables.json.CMAKE_GLOBAL_AUTORCC_TARGET_NAME": "Umožňuje změnit název globálního cíle autorcc.",
	"assets/variables.json.CMAKE_GNUtoMS": "Převést knihovny importu GNU (.dll.a) na formát MS (.lib)",
	"assets/variables.json.CMAKE_HIP_ARCHITECTURES": "Seznam architektur GPU, pro které se má vygenerovat kód zařízení. Názvy architektury se interpretují na základě CMAKE_HIP_PLATFORM.",
	"assets/variables.json.CMAKE_HIP_COMPILE_FEATURES": "Seznam funkcí známých v kompilátoru HIP",
	"assets/variables.json.CMAKE_HIP_EXTENSIONS": "Výchozí hodnota pro cílovou vlastnost HIP_EXTENSIONS, pokud je nastavena při vytvoření cíle",
	"assets/variables.json.CMAKE_HIP_PLATFORM": "Platforma GPU, pro kterou se mají kompilovat zdroje jazyka HIP.",
	"assets/variables.json.CMAKE_HIP_STANDARD": "Výchozí hodnota pro cílovou vlastnost HIP_STANDARD, pokud je nastavena při vytvoření cíle",
	"assets/variables.json.CMAKE_HIP_STANDARD_REQUIRED": "Výchozí hodnota pro cílovou vlastnost HIP_REQUIRED, pokud je nastavena při vytvoření cíle",
	"assets/variables.json.CMAKE_HOME_DIRECTORY": "Cesta k nejvyšší úrovni zdrojového stromu. Stejné jako CMAKE_SOURCE_DIR.",
	"assets/variables.json.CMAKE_HOST_APPLE": "Hodnota true pro operační systémy Apple macOS",
	"assets/variables.json.CMAKE_HOST_BSD": "Nastavte na řetězcovou hodnotu, pokud je hostitelský systém BSD. Tato hodnota může být jedna z následujících hodnot: DragonFlyBSD, FreeBSD, OpenBSD nebo NetBSD.",
	"assets/variables.json.CMAKE_HOST_LINUX": "Pokud je hostitelským systémem Linux, nastavte hodnotu true.",
	"assets/variables.json.CMAKE_HOST_SOLARIS": "Hodnota true pro operační systémy Oracle Solaris",
	"assets/variables.json.CMAKE_HOST_SYSTEM": "Složený název operačního systému, ve kterém je CMake spuštěný",
	"assets/variables.json.CMAKE_HOST_SYSTEM_NAME": "Název operačního systému, ve kterém CMake běží",
	"assets/variables.json.CMAKE_HOST_SYSTEM_PROCESSOR": "Název procesoru, na kterém CMake běží",
	"assets/variables.json.CMAKE_HOST_SYSTEM_VERSION": "Verze operačního systému, ve které CMake běží",
	"assets/variables.json.CMAKE_HOST_UNIX": "Hodnota true pro operační systémy UNIX a na bázi systému UNIX",
	"assets/variables.json.CMAKE_HOST_WIN32": "Hodnota true, pokud systém hostitele používá Windows, včetně 64bitových systémů Windows a MSYS",
	"assets/variables.json.CMAKE_IGNORE_PATH": "Středníky oddělený seznam adresářů, které mají být ignorovány různými příkazy find...().",
	"assets/variables.json.CMAKE_IGNORE_PREFIX_PATH": "Středníky oddělený seznam předpon vyhledávání, které mají být ignorovány příkazy find_program, find_library, find_file a find_path. Režim konfigurace příkazu find_package také ignoruje předpony (režim modulu není ovlivněný). Pokud místo toho chcete ignorovat konkrétní adresáře, podívejte se na CMAKE_IGNORE_NONPREFIX_VAR.",
	"assets/variables.json.CMAKE_IMPORT_LIBRARY_PREFIX": "Předpona pro knihovny importu, se kterými se propojujete",
	"assets/variables.json.CMAKE_IMPORT_LIBRARY_SUFFIX": "Přípona pro knihovny importu, se kterými se propojujete",
	"assets/variables.json.CMAKE_INCLUDE_CURRENT_DIR": "Automaticky přidat aktuální adresáře zdroje a sestavení do cesty zahrnutí",
	"assets/variables.json.CMAKE_INCLUDE_CURRENT_DIR_IN_INTERFACE": "Automaticky přidat aktuální adresáře zdroje a sestavení do cílové vlastnosti INTERFACE_INCLUDE_DIRECTORIES",
	"assets/variables.json.CMAKE_INCLUDE_DIRECTORIES_BEFORE": "Určuje, jestli se adresáře v include_directories mají ve výchozím nastavení připojit nebo předřadit.",
	"assets/variables.json.CMAKE_INCLUDE_DIRECTORIES_PROJECT_BEFORE": "Určuje, jestli se má vynucovat předřazování adresářů souborů k zahrnutí do projektu.",
	"assets/variables.json.CMAKE_INCLUDE_PATH": "Seznam adresářů oddělených středníky, který určuje cestu hledání pro příkazy find_file a find_path. Ve výchozím nastavení je seznam prázdný, je určen k nastavení podle projektu.",
	"assets/variables.json.CMAKE_INSTALL_DEFAULT_COMPONENT_NAME": "Výchozí komponenta používaná v příkazech instalace",
	"assets/variables.json.CMAKE_INSTALL_DEFAULT_DIRECTORY_PERMISSIONS": "Výchozí oprávnění pro adresáře vytvořené implicitně během instalace souborů pomocí příkazů install a file.",
	"assets/variables.json.CMAKE_INSTALL_MESSAGE": "Určete úroveň podrobností kódu instalačního skriptu, který generuje příkaz install (pomocí příkazu file). U cest, které jsou nově instalované nebo aktualizované, může instalace tisknout řádky, jako jsou například:",
	"assets/variables.json.CMAKE_INSTALL_NAME_DIR": "Název adresáře pro nainstalované cíle na platformách Apple",
	"assets/variables.json.CMAKE_INSTALL_PREFIX": "Instalační adresář, který používá instalace",
	"assets/variables.json.CMAKE_INSTALL_PREFIX_INITIALIZED_TO_DEFAULT": "CMake nastaví tuto proměnnou na hodnotu TRUE, pokud byl CMAKE_INSTALL_PREFIX právě inicializován na svoji výchozí hodnotu, obvykle při prvním spuštění CMake v rámci nového stromu sestavení, když není při prvním spuštění CMake nastavena proměnná prostředí CMAKE_INSTALL_PREFIX. V kódu projektu to lze použít ke změně výchozí hodnoty bez nutnosti přepsání hodnoty zadané uživatelem:",
	"assets/variables.json.CMAKE_INSTALL_REMOVE_ENVIRONMENT_RPATH": "Nastaví výchozí nastavení pro to, jestli by se měly během instalace odebrat cesty rpaths definované sadou nástrojů.",
	"assets/variables.json.CMAKE_INSTALL_RPATH": "Cesta rpath, která se má použít pro instalované cíle",
	"assets/variables.json.CMAKE_INSTALL_RPATH_USE_LINK_PATH": "Přidejte cesty pro vyhledávání linkeru a cestu rpath pro nainstalované cíle.",
	"assets/variables.json.CMAKE_INTERNAL_PLATFORM_ABI": "Interní proměnná, která se může změnit",
	"assets/variables.json.CMAKE_INTERPROCEDURAL_OPTIMIZATION": "Výchozí hodnota INTERPROCEDURAL_OPTIMIZATION pro cíle",
	"assets/variables.json.CMAKE_INTERPROCEDURAL_OPTIMIZATION_CONFIG": "Výchozí hodnota INTERPROCEDURAL_OPTIMIZATION_ pro cíle",
	"assets/variables.json.CMAKE_IOS_INSTALL_COMBINED": "Výchozí hodnota IOS_INSTALL_COMBINED pro cíle",
	"assets/variables.json.CMAKE_ISPC_HEADER_DIRECTORY": "ISPC vygeneroval výstupní adresář hlavičky.",
	"assets/variables.json.CMAKE_ISPC_HEADER_SUFFIX": "Výstupní přípona, která se má použít pro hlavičky vygenerované pomocí ISPC",
	"assets/variables.json.CMAKE_ISPC_INSTRUCTION_SETS": "Výchozí hodnota pro vlastnost ISPC_INSTRUCTION_SETS cílů",
	"assets/variables.json.CMAKE_JOB_POOLS": "Pokud není globální vlastnost JOB_POOLS nastavená, použije se místo ní hodnota této proměnné. Další informace viz JOB_POOLS.",
	"assets/variables.json.CMAKE_JOB_POOL_COMPILE": "Tato proměnná se používá k inicializaci vlastnosti JOB_POOL_COMPILE ve všech cílích. Další informace viz JOB_POOL_COMPILE.",
	"assets/variables.json.CMAKE_JOB_POOL_LINK": "Tato proměnná se používá k inicializaci vlastnosti JOB_POOL_LINK ve všech cílích. Další informace viz JOB_POOL_LINK.",
	"assets/variables.json.CMAKE_JOB_POOL_PRECOMPILE_HEADER": "Tato proměnná se používá k inicializaci vlastnosti JOB_POOL_PRECOMPILE_HEADER ve všech cílech. Další informace viz JOB_POOL_PRECOMPILE_HEADER.",
	"assets/variables.json.CMAKE_KATE_FILES_MODE": "Tuto proměnnou mezipaměti používá generátor projektu Kate a řídí, v jakém režimu se nastaví položka souborů v souboru projektu. Viz cmake-generators.",
	"assets/variables.json.CMAKE_KATE_MAKE_ARGUMENTS": "Tuto proměnnou mezipaměti používá generátor projektu Kate. Viz cmake-generators.",
	"assets/variables.json.CMAKE_LANG_ANDROID_TOOLCHAIN_MACHINE": "Při křížové kompilaci pro Android tato proměnná obsahuje název počítače s kolekcí binutils sady nástrojů (např. gcc -dumpmachine). Nástroje kolekce binutils mají obvykle ve svém názvu předponu <machine>-.",
	"assets/variables.json.CMAKE_LANG_ANDROID_TOOLCHAIN_PREFIX": "Při křížové kompilaci pro Android tato proměnná obsahuje absolutní cestu s předponou pro kompilátor GNU sady nástrojů a jeho kolekci binutils.",
	"assets/variables.json.CMAKE_LANG_ANDROID_TOOLCHAIN_SUFFIX": "Při křížové kompilaci pro Android tato proměnná obsahuje příponu platformy hostitele kompilátoru GNU sady nástrojů a jeho kolekce binutils.",
	"assets/variables.json.CMAKE_LANG_ARCHIVE_APPEND": "Proměnná pravidla pro přidání do statického archivu",
	"assets/variables.json.CMAKE_LANG_ARCHIVE_CREATE": "Proměnná pravidla pro vytvoření nového statického archivu",
	"assets/variables.json.CMAKE_LANG_ARCHIVE_FINISH": "Proměnná pravidla pro dokončení existujícího statického archivu",
	"assets/variables.json.CMAKE_LANG_BYTE_ORDER": "Pořadí bajtů cílové architektury kompilátoru <LANG>, pokud je známé. Pokud je definované a není prázdné, hodnota je jednou z těchto hodnot:",
	"assets/variables.json.CMAKE_LANG_CLANG_TIDY": "Výchozí hodnota cílové vlastnosti <LANG>_CLANG_TIDY, pokud <LANG> je C, CXX, OBJC nebo OBJCXX",
	"assets/variables.json.CMAKE_LANG_CLANG_TIDY_EXPORT_FIXES_DIR": "Výchozí hodnota cílové vlastnosti <LANG>_CLANG_TIDY_EXPORT_FIXES_DIR, pokud <LANG> je C, CXX, OBJC nebo OBJCXX.",
	"assets/variables.json.CMAKE_LANG_COMPILER": "Úplná cesta ke kompilátoru pro LANG",
	"assets/variables.json.CMAKE_LANG_COMPILER_ABI": "Interní proměnná, která se může změnit",
	"assets/variables.json.CMAKE_LANG_COMPILER_AR": "Obálka okolo příkazu ar, která přidává vhodný parametr --plugin pro daný kompilátor.",
	"assets/variables.json.CMAKE_LANG_COMPILER_ARCHITECTURE_ID": "Interní proměnná, která se může změnit",
	"assets/variables.json.CMAKE_LANG_COMPILER_EXTERNAL_TOOLCHAIN": "Externí sada nástrojů pro křížovou kompilaci, pokud je podporována",
	"assets/variables.json.CMAKE_LANG_COMPILER_FRONTEND_VARIANT": "Identifikační řetězec varianty front-endu kompilátoru",
	"assets/variables.json.CMAKE_LANG_COMPILER_ID": "Identifikační řetězec kompilátoru.",
	"assets/variables.json.CMAKE_LANG_COMPILER_LAUNCHER": "Výchozí hodnota cílové vlastnosti <LANG>_COMPILER_LAUNCHER. Tato proměnná slouží k inicializaci této vlastnosti u každého cíle v době, kdy se vytváří. To se provádí jen v případě, že <LANG> je C, CXX, Fortran, HIP, OBJC, OBJCXX nebo CUDA.",
	"assets/variables.json.CMAKE_LANG_COMPILER_LINKER": "Úplná cesta k linkeru pro LANG",
	"assets/variables.json.CMAKE_LANG_COMPILER_LINKER_FRONTEND_VARIANT": "Identifikační řetězec varianty front-endu linkeru",
	"assets/variables.json.CMAKE_LANG_COMPILER_LINKER_ID": "Identifikační řetězec linkeru.",
	"assets/variables.json.CMAKE_LANG_COMPILER_LINKER_VERSION": "Řetězec verze linkeru.",
	"assets/variables.json.CMAKE_LANG_COMPILER_LOADED": "Definuje se jako hodnota true, pokud je jazyk povolený.",
	"assets/variables.json.CMAKE_LANG_COMPILER_PREDEFINES_COMMAND": "Příkaz, jehož výstupy jsou předběžné definice kompilátoru",
	"assets/variables.json.CMAKE_LANG_COMPILER_RANLIB": "Obálka okolo příkazu ranlib, která přidává vhodný parametr --plugin pro daný kompilátor.",
	"assets/variables.json.CMAKE_LANG_COMPILER_TARGET": "Cíl pro křížovou kompilaci, pokud je podporována",
	"assets/variables.json.CMAKE_LANG_COMPILER_VERSION": "Řetězec verze kompilátoru.",
	"assets/variables.json.CMAKE_LANG_COMPILER_VERSION_INTERNAL": "Interní proměnná, která se může změnit",
	"assets/variables.json.CMAKE_LANG_COMPILE_OBJECT": "Proměnná pravidla pro kompilaci jednoho souboru objektu",
	"assets/variables.json.CMAKE_LANG_CPPCHECK": "Výchozí hodnota cílové vlastnosti <LANG>_CPPCHECK. Tato proměnná slouží k inicializaci této vlastnosti u každého cíle v době, kdy se vytváří. To se provádí jenom v případě, že <LANG> je C nebo CXX.",
	"assets/variables.json.CMAKE_LANG_CPPLINT": "Výchozí hodnota cílové vlastnosti <LANG>_CPPLINT. Tato proměnná slouží k inicializaci této vlastnosti u každého cíle v době, kdy se vytváří. To se provádí jenom v případě, že <LANG> je C nebo CXX.",
	"assets/variables.json.CMAKE_LANG_CREATE_SHARED_LIBRARY": "Proměnná pravidla pro vytvoření sdílené knihovny",
	"assets/variables.json.CMAKE_LANG_CREATE_SHARED_MODULE": "Proměnná pravidla pro vytvoření sdíleného modulu",
	"assets/variables.json.CMAKE_LANG_CREATE_STATIC_LIBRARY": "Proměnná pravidla pro vytvoření statické knihovny",
	"assets/variables.json.CMAKE_LANG_EXTENSIONS": "Varianty:",
	"assets/variables.json.CMAKE_LANG_EXTENSIONS_DEFAULT": "Výchozí režim rozšíření kompilátoru. Používá se jako výchozí pro cílovou vlastnost <LANG>_EXTENSIONS, když není nastaveno CMAKE_<LANG>_EXTENSIONS (podle CMP0128).",
	"assets/variables.json.CMAKE_LANG_FLAGS": "Příznaky jazyka pro jazyk <LANG> se používají při sestavování pro všechny konfigurace. Tyto příznaky budou předány všem vyvoláním kompilátoru. To zahrnuje volání, která řídí kompilaci, a volání, která řídí propojení.",
	"assets/variables.json.CMAKE_LANG_FLAGS_CONFIG": "Příznaky jazyka pro jazyk <LANG> používané při sestavování pro konfiguraci <CONFIG>. Tyto příznaky se předají všem vyvoláním kompilátoru v odpovídající konfiguraci. To zahrnuje volání, která řídí kompilaci, a volání, která řídí propojení.",
	"assets/variables.json.CMAKE_LANG_FLAGS_CONFIG_INIT": "Hodnota používaná k inicializaci položky mezipaměti CMAKE_<LANG>_FLAGS_ při první konfiguraci stromu sestavení pro jazyk <LANG>. Tuto proměnnou by měl nastavit soubor sady nástrojů. CMake může k této hodnotě předřadit nebo připojit obsah na základě prostředí a cílové platformy.",
	"assets/variables.json.CMAKE_LANG_FLAGS_DEBUG": "Tato proměnná je varianta Debug proměnné CMAKE_<LANG>_FLAGS_.",
	"assets/variables.json.CMAKE_LANG_FLAGS_DEBUG_INIT": "Tato proměnná je varianta Debug proměnné CMAKE_<LANG>_FLAGS_<CONFIG>_INIT.",
	"assets/variables.json.CMAKE_LANG_FLAGS_INIT": "Hodnota, která se používá k inicializaci položky mezipaměti CMAKE_<LANG>_FLAGS při první konfiguraci stromu sestavení pro jazyk <LANG>. Tuto proměnnou má nastavovat soubor sady nástrojů. CMake může předřazovat (přidat na začátek) nebo připojovat (na konec) obsah k hodnotě podle prostředí a cílové platformy. Například obsah proměnné prostředí xxxFLAGS bude předřazen, kde xxx bude záviset na jazyku, ale nebude nutně stejné jako <LANG> (například CXXFLAGS pro CXX, FFLAGS pro Fortran atd.). Tato hodnota je fragment řetězce příkazového řádku. Proto by mělo být více možností odděleno mezerami a možnosti s mezerami by měly být uvedeny v uvozovkách.",
	"assets/variables.json.CMAKE_LANG_FLAGS_MINSIZEREL": "Tato proměnná je varianta MinSizeRel proměnné CMAKE_<LANG>_FLAGS_.",
	"assets/variables.json.CMAKE_LANG_FLAGS_MINSIZEREL_INIT": "Tato proměnná je varianta MinSizeRel proměnné CMAKE_<LANG>_FLAGS_<CONFIG>_INIT.",
	"assets/variables.json.CMAKE_LANG_FLAGS_RELEASE": "Tato proměnná je varianta Release proměnné CMAKE_<LANG>_FLAGS_.",
	"assets/variables.json.CMAKE_LANG_FLAGS_RELEASE_INIT": "Tato proměnná je varianta Release proměnné CMAKE_<LANG>_FLAGS_<CONFIG>_INIT.",
	"assets/variables.json.CMAKE_LANG_FLAGS_RELWITHDEBINFO": "Tato proměnná je varianta RelWithDebInfo proměnné CMAKE_<LANG>_FLAGS_.",
	"assets/variables.json.CMAKE_LANG_FLAGS_RELWITHDEBINFO_INIT": "Tato proměnná je varianta RelWithDebInfo proměnné CMAKE_<LANG>_FLAGS_<CONFIG>_INIT.",
	"assets/variables.json.CMAKE_LANG_HOST_COMPILER": "Tato proměnná je k dispozici, když <LANG> je CUDA nebo HIP.",
	"assets/variables.json.CMAKE_LANG_IGNORE_EXTENSIONS": "Přípony souborů, které by sestavení mělo ignorovat",
	"assets/variables.json.CMAKE_LANG_IMPLICIT_INCLUDE_DIRECTORIES": "Adresáře, ve kterých kompilátor implicitně vyhledávává soubory hlaviček",
	"assets/variables.json.CMAKE_LANG_IMPLICIT_LINK_DIRECTORIES": "Implicitní cesta hledání linkeru, která byla zjištěna pro jazyk <LANG>",
	"assets/variables.json.CMAKE_LANG_IMPLICIT_LINK_FRAMEWORK_DIRECTORIES": "Implicitní cesta hledání rozhraní linkeru, která byla zjištěna pro jazyk <LANG>",
	"assets/variables.json.CMAKE_LANG_IMPLICIT_LINK_LIBRARIES": "Příznaky a knihovny implicitních odkazů, které byly zjištěny pro jazyk <LANG>",
	"assets/variables.json.CMAKE_LANG_INCLUDE_WHAT_YOU_USE": "Výchozí hodnota cílové vlastnosti <LANG>_INCLUDE_WHAT_YOU_USE. Tato proměnná slouží k inicializaci této vlastnosti u každého cíle v době, kdy se vytváří. To se provádí jenom v případě, že <LANG> je C nebo CXX.",
	"assets/variables.json.CMAKE_LANG_LIBRARY_ARCHITECTURE": "Název adresáře knihovny cílové architektury, který byl zjištěn pro jazyk <LANG>",
	"assets/variables.json.CMAKE_LANG_LINKER_LAUNCHER": "Výchozí hodnota cílové vlastnosti <LANG>_LINKER_LAUNCHER. Tato proměnná slouží k inicializaci této vlastnosti u každého cíle, když je vytvořen. To se provádí jenom v případě, že <LANG> je C, CXX, OBJC nebo OBJCXX.",
	"assets/variables.json.CMAKE_LANG_LINKER_PREFERENCE": "Interní proměnná, která se může změnit",
	"assets/variables.json.CMAKE_LANG_LINKER_PREFERENCE_PROPAGATES": "Interní proměnná, která se může změnit",
	"assets/variables.json.CMAKE_LANG_LINKER_WRAPPER_FLAG": "Definuje syntaxi možnosti ovladače kompilátoru pro předání možností do nástroje linker. Použije se k překladu prefixu LINKER: v možnostech připojení (viz add_link_options a target_link_options).",
	"assets/variables.json.CMAKE_LANG_LINKER_WRAPPER_FLAG_SEP": "Tato proměnná se používá spolu s proměnnou CMAKE_<LANG>_LINKER_WRAPPER_FLAG k formátování prefixu LINKER: v možnostech připojení (viz add_link_options a target_link_options).",
	"assets/variables.json.CMAKE_LANG_LINK_EXECUTABLE": "Proměnná pravidla pro propojení spustitelného souboru",
	"assets/variables.json.CMAKE_LANG_LINK_GROUP_USING_FEATURE": "Tato proměnná definuje způsob propojení skupiny knihoven pro zadanou <FEATURE>, pokud je použit výraz generátoru LINK_GROUP a jazyk propojení pro cíl je <LANG>. Aby tato proměnná měla nějaký účinek, musí být přidružená proměnná CMAKE_<LANG>_LINK_GROUP_USING_<FEATURE>_SUPPORTED nastavena na true.",
	"assets/variables.json.CMAKE_LANG_LINK_GROUP_USING_FEATURE_SUPPORTED": "Tato proměnná určuje, zda je <FEATURE> podporována pro jazyk odkazu <LANG>. Pokud je tato proměnná true, pak musí být <FEATURE> definována pomocí CMAKE_<LANG>_LINK_GROUP_USING_ a obecnější proměnné CMAKE_LINK_GROUP_USING_<FEATURE>_SUPPORTED a CMAKE_LINK_GROUP_USING_ se nepoužívají.",
	"assets/variables.json.CMAKE_LANG_LINK_LIBRARY_FEATURE_ATTRIBUTES": "Tato proměnná definuje sémantiku zadané knihovny odkazů <FEATURE> při propojování s jazykem odkazu <LANG>. Má přednost před CMAKE_LINK_LIBRARY_<FEATURE>_ATTRIBUTES, pokud je proměnná definována také pro stejnou knihovnu odkazů <FEATURE>, ale jinak má podobný účinek. Další podrobnosti viz CMAKE_LINK_LIBRARY_<FEATURE>_ATTRIBUTES.",
	"assets/variables.json.CMAKE_LANG_LINK_LIBRARY_FILE_FLAG": "Příznak závislý na jazyku, který se má použít pro připojení knihovny zadané pomocí cesty k jejímu souboru",
	"assets/variables.json.CMAKE_LANG_LINK_LIBRARY_FLAG": "Příznak, který se má použít pro připojení knihovny do sdílené knihovny nebo spustitelného souboru",
	"assets/variables.json.CMAKE_LANG_LINK_LIBRARY_SUFFIX": "Přípona závislá na jazyku pro knihovny, se kterými se propojujete",
	"assets/variables.json.CMAKE_LANG_LINK_LIBRARY_USING_FEATURE": "Tato proměnná definuje způsob propojení knihovny nebo architektury pro zadanou <FEATURE>, pokud je použit výraz generátoru LINK_LIBRARY a jazyk propojení pro cíl je <LANG>. Aby tato proměnná měla nějaký účinek, musí být přidružená proměnná CMAKE_<LANG>_LINK_LIBRARY_USING_<FEATURE>_SUPPORTED nastavena na true.",
	"assets/variables.json.CMAKE_LANG_LINK_LIBRARY_USING_FEATURE_SUPPORTED": "Nastavte na true, pokud je <FEATURE> definovaný proměnnou CMAKE_<LANG>_LINK_LIBRARY_USING_ podporovaný pro jazyk linkeru <LANG>.",
	"assets/variables.json.CMAKE_LANG_LINK_WHAT_YOU_USE_FLAG": "Příznak linkeru, který se má použít ke konfiguraci linkeru tak, aby se na cíl napojily všechny knihovny zadané na příkazovém řádku.",
	"assets/variables.json.CMAKE_LANG_OUTPUT_EXTENSION": "Rozšíření pro výstup kompilace pro jeden soubor",
	"assets/variables.json.CMAKE_LANG_PLATFORM_ID": "Interní proměnná, která se může změnit",
	"assets/variables.json.CMAKE_LANG_SIMULATE_ID": "Identifikační řetězec simulovaného kompilátoru",
	"assets/variables.json.CMAKE_LANG_SIMULATE_VERSION": "Řetězec verze simulovaného kompilátoru",
	"assets/variables.json.CMAKE_LANG_SIZEOF_DATA_PTR": "Velikost typů ukazatelů na data pro jazyk <LANG>",
	"assets/variables.json.CMAKE_LANG_SOURCE_FILE_EXTENSIONS": "Rozšíření zdrojových souborů pro daný jazyk",
	"assets/variables.json.CMAKE_LANG_STANDARD": "Varianty:",
	"assets/variables.json.CMAKE_LANG_STANDARD_DEFAULT": "Výchozí standard kompilátoru pro jazyk <LANG>. Pokud kompilátor nevyužívá princip úrovní standardu, je hodnota prázdná.",
	"assets/variables.json.CMAKE_LANG_STANDARD_INCLUDE_DIRECTORIES": "Adresáře souborů k zahrnutí, které se mají má použít pro každý zdrojový soubor kompilovaný pomocí kompilátoru <LANG>. Toto nastavení je určeno pro specifikaci adresářů systémových souborů k zahrnutí, kterou vyžaduje jazyk pro aktuální platformu. Tyto adresáře se zobrazí vždy na konci cesty zahrnutí, která se předává do kompilátoru.",
	"assets/variables.json.CMAKE_LANG_STANDARD_LATEST": "Tato proměnná představuje minimální verzi mezi nejnovější verzí standardu pro jazyk <LANG>, kterou podporuje aktuální kompilátor, a nejnovější verzí, kterou podporuje CMake. Její hodnota bude nastavena na jednu z podporovaných hodnot příslušné cílové vlastnosti <LANG>_STANDARD; seznam podporovaných jazyků najdete v dokumentaci k této vlastnosti.",
	"assets/variables.json.CMAKE_LANG_STANDARD_LIBRARIES": "Knihovny připojené ke každému spustitelnému souboru a připojená sdílená knihovna pro jazyk <LANG>. Toto nastavení je určeno pro specifikaci systémových knihoven, kterou vyžaduje jazyk pro aktuální platformu.",
	"assets/variables.json.CMAKE_LANG_STANDARD_REQUIRED": "Varianty:",
	"assets/variables.json.CMAKE_LANG_USING_LINKER_MODE": "Určuje, jak má být interpretována hodnota proměnné CMAKE_<LANG>_USING_LINKER_. Podporované hodnoty režimu linkeru jsou:",
	"assets/variables.json.CMAKE_LANG_USING_LINKER_TYPE": "Tato proměnná určuje způsob zadání linkeru <TYPE> pro krok propojení, který je řízen proměnnou CMAKE_LINKER_TYPE nebo vlastností cíle LINKER_TYPE. V závislosti na hodnotě proměnné CMAKE_<LANG>_USING_LINKER_MODE může proměnná CMAKE_<LANG>_USING_LINKER_<TYPE> obsahovat příznaky kompilátoru pro krok propojení nebo příznaky, které mají být předány přímo nástroji linker.",
	"assets/variables.json.CMAKE_LANG_VISIBILITY_PRESET": "Výchozí hodnota cílové vlastnosti <LANG>_VISIBILITY_PRESET při vytváření cíle",
	"assets/variables.json.CMAKE_LIBRARY_ARCHITECTURE": "Název adresáře knihovny cílové architektury, pokud byl zjištěn",
	"assets/variables.json.CMAKE_LIBRARY_ARCHITECTURE_REGEX": "Regulární výraz odpovídající možný názvům adresářů knihoven cílové architektury",
	"assets/variables.json.CMAKE_LIBRARY_OUTPUT_DIRECTORY": "Umístění pro všechny soubory s cílem LIBRARY při sestavení",
	"assets/variables.json.CMAKE_LIBRARY_OUTPUT_DIRECTORY_CONFIG": "Umístění pro všechny soubory s cílem LIBRARY při sestavení pro určitou konfiguraci",
	"assets/variables.json.CMAKE_LIBRARY_PATH": "Seznam adresářů oddělených středníky, který určuje cestu hledání pro příkaz find_library. Ve výchozím nastavení je seznam prázdný, je určen k nastavení podle projektu.",
	"assets/variables.json.CMAKE_LIBRARY_PATH_FLAG": "Příznak, který se má použít k přidání cesty pro hledání knihovny do kompilátoru",
	"assets/variables.json.CMAKE_LINKER_TYPE": "Určete, který linker se použije pro krok propojení.",
	"assets/variables.json.CMAKE_LINK_DEF_FILE_FLAG": "Příznak linkeru, který se má použít pro určení souboru .def pro vytvoření knihovny dll",
	"assets/variables.json.CMAKE_LINK_DEPENDS_NO_SHARED": "Určuje, jestli se u souborů sdílených knihoven mají přeskakovat závislosti odkazů.",
	"assets/variables.json.CMAKE_LINK_DEPENDS_USE_LINKER": "Pro generátory Makefile a Ninja se teď závislosti propojení v případě výběru nástrojů pro propojování generují samotným nástrojem pro propojování. Definováním této proměnné s hodnotou FALSE můžete tuto funkci deaktivovat.",
	"assets/variables.json.CMAKE_LINK_DIRECTORIES_BEFORE": "Určuje, jestli se adresáře v link_directories mají ve výchozím nastavení připojit nebo předřadit.",
	"assets/variables.json.CMAKE_LINK_GROUP_USING_FEATURE": "Tato proměnná definuje způsob propojení skupiny knihoven pro zadanou <FEATURE>, pokud je použit generátorový výraz LINK_GROUP. Aby se tato proměnná projevila, musí být splněny obě následující podmínky:",
	"assets/variables.json.CMAKE_LINK_GROUP_USING_FEATURE_SUPPORTED": "Tato proměnná určuje, zda je <FEATURE> podporována bez ohledu na jazyk odkazu. Pokud je tato proměnná true, pak musí být <FEATURE> definována pomocí CMAKE_LINK_GROUP_USING_.",
	"assets/variables.json.CMAKE_LINK_INTERFACE_LIBRARIES": "Výchozí hodnota LINK_INTERFACE_LIBRARIES pro cíle",
	"assets/variables.json.CMAKE_LINK_LIBRARIES_ONLY_TARGETS": "Tuto proměnnou nastavte, pokud chcete inicializovat vlastnost LINK_LIBRARIES_ONLY_TARGETS neimportovaných cílů při jejich vytvoření. Nastavení na true umožňuje další kontrolu, že všechny položky pojmenované podle target_link_libraries, které mohou být cílovými názvy, jsou ve skutečnosti názvy existujících cílů. Podrobnosti najdete v dokumentaci k cílové vlastnosti.",
	"assets/variables.json.CMAKE_LINK_LIBRARY_FEATURE_ATTRIBUTES": "Tato proměnná definuje chování zadané knihovny odkazů <FEATURE>. Určuje, jak <FEATURE> interaguje s jinými funkcemi, kdy se má <FEATURE> použít, a aspekty způsobu zpracování <FEATURE>, když CMake sestaví konečný příkazový řádek linkeru (např. odstranění duplicit).",
	"assets/variables.json.CMAKE_LINK_LIBRARY_FILE_FLAG": "Příznak, který se má použít pro připojení knihovny zadané pomocí cesty k jejímu souboru",
	"assets/variables.json.CMAKE_LINK_LIBRARY_FLAG": "Příznak, který se má použít pro připojení knihovny ke spustitelnému souboru",
	"assets/variables.json.CMAKE_LINK_LIBRARY_SUFFIX": "Přípona pro knihovny, se kterými se propojujete",
	"assets/variables.json.CMAKE_LINK_LIBRARY_USING_FEATURE": "Tato proměnná definuje způsob propojení knihovny nebo architektury pro zadanou <FEATURE>, pokud je použit výraz generátoru LINK_LIBRARY. Aby se tato proměnná projevila, musí být splněny obě následující podmínky:",
	"assets/variables.json.CMAKE_LINK_LIBRARY_USING_FEATURE_SUPPORTED": "Nastaveno na TRUE, pokud je <FEATURE>, definovaná proměnnou CMAKE_LINK_LIBRARY_USING_, podporována bez ohledu na jazyk linkeru.",
	"assets/variables.json.CMAKE_LINK_SEARCH_END_STATIC": "Zakončete propojovací řadu tak, aby se používaly statické systémové knihovny.",
	"assets/variables.json.CMAKE_LINK_SEARCH_START_STATIC": "Předpokládejte, že linker ve výchozím nastavení hledá statické knihovny.",
	"assets/variables.json.CMAKE_LINK_WHAT_YOU_USE": "Výchozí hodnota cílové vlastnosti LINK_WHAT_YOU_USE. Tato proměnná slouží k inicializaci této vlastnosti u každého cíle v době, kdy se vytváří.",
	"assets/variables.json.CMAKE_LINK_WHAT_YOU_USE_CHECK": "Definuje příkaz spuštěný po kroku propojování, kterým se zkontroluje využití knihoven. Tato kontrola je aktuálně definována jen na platformách ELF s hodnotou ldd -u -r.",
	"assets/variables.json.CMAKE_MACOSX_BUNDLE": "Výchozí hodnota MACOSX_BUNDLE pro cíle",
	"assets/variables.json.CMAKE_MACOSX_RPATH": "Určuje, jestli se v systémech macOS a iOS mají používat cesty rpath.",
	"assets/variables.json.CMAKE_MAJOR_VERSION": "První komponenta čísla verze v proměnné CMAKE_VERSION",
	"assets/variables.json.CMAKE_MAKE_PROGRAM": "Nástroj, který může spouštět nativní systém sestavení. Hodnotou může být úplná cesta ke spustitelnému souboru, nebo jenom název nástroje, pokud se očekává, že bude v cestě PATH.",
	"assets/variables.json.CMAKE_MAP_IMPORTED_CONFIG_CONFIG": "Výchozí hodnota MAP_IMPORTED_CONFIG_ pro cíle",
	"assets/variables.json.CMAKE_MATCH_COUNT": "Počet shod s posledním regulárním výrazem",
	"assets/variables.json.CMAKE_MATCH_n": "Skupina zachycení <n> odpovídá poslednímu regulárnímu výrazu pro skupiny 0 až 9. Skupina 0 představuje úplnou shodu. Skupiny 1 až 9 jsou dílčí výrazy zachycené syntaxí ().",
	"assets/variables.json.CMAKE_MAXIMUM_RECURSION_DEPTH": "Maximální hloubka rekurze pro skripty CMake. Má se nastavovat v příkazovém řádku s proměnnou -DCMAKE_MAXIMUM_RECURSION_DEPTH=<x> nebo v rámci souboru CMakeLists.txt pomocí projektů, které vyžadují velkou hloubku rekurze. Projekty, které nastavují tuto proměnnou, by měly uživateli poskytnout způsob, jak ji přepsat. Například:",
	"assets/variables.json.CMAKE_MESSAGE_CONTEXT": "Pokud to povolí parametr příkazového řádku cmake --log-context nebo proměnná CMAKE_MESSAGE_CONTEXT_SHOW, převede příkaz zprávy seznam CMAKE_MESSAGE_CONTEXT na řetězec oddělený tečkami ohraničenými hranatými závorkami a předepnou ho na každý řádek pro zprávy úrovně protokolu NOTICE a nižší.",
	"assets/variables.json.CMAKE_MESSAGE_CONTEXT_SHOW": "Nastavení této proměnné na true umožňuje zobrazení kontextu s každým řádkem protokolovaným příkazem message (postup určení samotného kontextu najdete v informacích k proměnné CMAKE_MESSAGE_CONTEXT).",
	"assets/variables.json.CMAKE_MESSAGE_INDENT": "Příkaz message spojuje řetězce z tohoto seznamu a pro úrovně protokolů NOTICE a níže, výsledný řetězec předřadí na každý řádek zprávy.",
	"assets/variables.json.CMAKE_MESSAGE_LOG_LEVEL": "Při nastavení tato proměnná určuje úroveň protokolování používanou příkazem zprávy. Platné hodnoty jsou stejné jako pro parametr příkazového řádku --log-level <cmake --log-level> programu cmake. Pokud je tato proměnná nastavená a parametr --log-level <cmake --log-level> je zadána možnost příkazového řádku, má přednost možnost příkazového řádku.",
	"assets/variables.json.CMAKE_MFC_FLAG": "Použijte knihovnu MFC pro spustitelný soubor nebo knihovnu DLL.",
	"assets/variables.json.CMAKE_MINIMUM_REQUIRED_VERSION": "Verze <min> CMake předaná nejnovějšímu volání příkazu cmake_minimum_required v aktuálním oboru proměnných nebo libovolném nadřazeném oboru proměnných.",
	"assets/variables.json.CMAKE_MINOR_VERSION": "Druhá komponenta čísla verze v proměnné CMAKE_VERSION",
	"assets/variables.json.CMAKE_MODULE_LINKER_FLAGS": "Příznaky linkeru, které se mají použít pro vytvoření modulů",
	"assets/variables.json.CMAKE_MODULE_LINKER_FLAGS_CONFIG": "Příznaky, které se mají použít při připojování modulu",
	"assets/variables.json.CMAKE_MODULE_LINKER_FLAGS_CONFIG_INIT": "Hodnota používaná k inicializaci položky mezipaměti CMAKE_MODULE_LINKER_FLAGS_ při první konfiguraci stromu sestavení. Tuto proměnnou by měl nastavit soubor sady nástrojů. CMake může k této hodnotě předřadit nebo připojit obsah na základě prostředí a cílové platformy.",
	"assets/variables.json.CMAKE_MODULE_LINKER_FLAGS_INIT": "Hodnota používaná k inicializaci položky mezipaměti CMAKE_MODULE_LINKER_FLAGS při první konfiguraci stromu sestavení. Tuto proměnnou by měl nastavit soubor sady nástrojů. CMake může k této hodnotě předřadit nebo připojit obsah na základě prostředí a cílové platformy.",
	"assets/variables.json.CMAKE_MODULE_PATH": "Seznam adresářů oddělených středníky a reprezentovaných dopřednými lomítky, který určuje cestu pro hledání modulů CMake, které se mají načíst pomocí příkazů include nebo find_package, než se provede kontrola výchozích modulů, jež jsou součástí CMake. Ve výchozím nastavení je seznam prázdný, je určen k nastavení podle projektu.",
	"assets/variables.json.CMAKE_MSVCIDE_RUN_PATH": "Další umístění PATH, která by se měla použít při provádění příkazu add_custom_command nebo add_custom_target, když se používá generátor pro Visual Studio 12 2013 (nebo vyšší). Umožňuje spouštění příkazů a používání knihoven dll, o kterých prostředí IDE nemá žádné informace.",
	"assets/variables.json.CMAKE_MSVC_DEBUG_INFORMATION_FORMAT": "Vyberte formát informací o ladění MSVC, který cílí na rozhraní MSVC ABI. Tato proměnná slouží k inicializaci vlastnosti MSVC_DEBUG_INFORMATION_FORMAT u všech cílů při jejich vytváření. Je také rozšířen voláním příkazu try_compile do testovacího projektu.",
	"assets/variables.json.CMAKE_MSVC_RUNTIME_LIBRARY": "Vyberte knihovnu runtime MSVC, kterou budou používat kompilátory, které cílí na MSVC ABI. Tato proměnná slouží k inicializaci vlastnosti MSVC_RUNTIME_LIBRARY u všech cílů v době, kdy se vytvářejí. Je také šířena voláními příkazu try_compile do projektu testu.",
	"assets/variables.json.CMAKE_NETRC": "Tato proměnná se používá k inicializaci možnosti NETRC pro soubor a souborové příkazy. Další informace viz tyto příkazy.",
	"assets/variables.json.CMAKE_NETRC_FILE": "Tato proměnná se používá k inicializaci možnosti NETRC_FILE pro soubor a souborové příkazy. Další informace viz tyto příkazy.",
	"assets/variables.json.CMAKE_NINJA_OUTPUT_PATH_PREFIX": "Řekněte generátorům Ninja, aby do každé výstupní cesty v build.ninja přidaly předponu. Pokud chybí, připojí se k předponě koncové lomítko.",
	"assets/variables.json.CMAKE_NOT_USING_CONFIG_FLAGS": "V případě hodnoty true přeskočit příznaky _BUILD_TYPE",
	"assets/variables.json.CMAKE_NO_BUILTIN_CHRPATH": "Při instalaci neopravovat cesty pro vyhledávání knihoven modulů runtime pomocí integrovaného binárního editoru",
	"assets/variables.json.CMAKE_NO_SYSTEM_FROM_IMPORTED": "Výchozí hodnota NO_SYSTEM_FROM_IMPORTED pro cíle",
	"assets/variables.json.CMAKE_OBJCXX_EXTENSIONS": "Výchozí hodnota pro cílovou vlastnost OBJCXX_EXTENSIONS, pokud je nastavena při vytvoření cíle",
	"assets/variables.json.CMAKE_OBJCXX_STANDARD": "Výchozí hodnota pro cílovou vlastnost OBJCXX_STANDARD, pokud je nastavena při vytvoření cíle",
	"assets/variables.json.CMAKE_OBJCXX_STANDARD_REQUIRED": "Výchozí hodnota pro cílovou vlastnost OBJCXX_STANDARD_REQUIRED, pokud je nastavena při vytvoření cíle",
	"assets/variables.json.CMAKE_OBJC_EXTENSIONS": "Výchozí hodnota pro cílovou vlastnost OBJC_EXTENSIONS, pokud je nastavena při vytvoření cíle",
	"assets/variables.json.CMAKE_OBJC_STANDARD": "Výchozí hodnota pro cílovou vlastnost OBJC_STANDARD, pokud je nastavena při vytvoření cíle",
	"assets/variables.json.CMAKE_OBJC_STANDARD_REQUIRED": "Výchozí hodnota pro cílovou vlastnost OBJC_STANDARD_REQUIRED, pokud je nastavena při vytvoření cíle",
	"assets/variables.json.CMAKE_OBJECT_PATH_MAX": "Maximální délka úplné cesty k souboru objektu, kterou povolují nativní nástroje sestavení",
	"assets/variables.json.CMAKE_OPTIMIZE_DEPENDENCIES": "Inicializuje cílovou vlastnost OPTIMIZE_DEPENDENCIES.",
	"assets/variables.json.CMAKE_OSX_ARCHITECTURES": "Specifické cílové architektury pro macOS a iOS",
	"assets/variables.json.CMAKE_OSX_DEPLOYMENT_TARGET": "Zadejte minimální verzi cílové platformy (např. macOS nebo iOS), na kterou mají být cílové binární soubory nasazeny. CMake použije hodnotu této proměnné pro příznak -mmacosx-version-min nebo jeho odpovídající ekvivalenty na cílové platformě. U starších verzí Xcode, se kterými se dodává více sad SDK pro macOS, pomáhá tato proměnná také zvolit sadu SDK v případě, že není nastaveno CMAKE_OSX_SYSROOT.",
	"assets/variables.json.CMAKE_OSX_SYSROOT": "Zadejte umístění nebo název sady SDK pro platformu macOS, která se má použít. CMake použije tuto hodnotu k výpočtu hodnoty příznaku -isysroot nebo jeho ekvivalentu a k tomu, aby příkazům find_* usnadnil hledání umístění souborů v sadě SDK.",
	"assets/variables.json.CMAKE_PARENT_LIST_FILE": "Úplná cesta k souboru CMake, který zahrnoval aktuální soubor",
	"assets/variables.json.CMAKE_PATCH_VERSION": "Třetí komponenta čísla verze v proměnné CMAKE_VERSION",
	"assets/variables.json.CMAKE_PCH_INSTANTIATE_TEMPLATES": "Tato proměnná slouží k inicializaci vlastnosti PCH_INSTANTIATE_TEMPLATES cílů při jejich vytváření.",
	"assets/variables.json.CMAKE_PCH_WARN_INVALID": "Tato proměnná se používá k inicializaci vlastnosti PCH_WARN_INVALID cílů při jejich vytváření.",
	"assets/variables.json.CMAKE_PDB_OUTPUT_DIRECTORY": "Výstupní adresář pro soubory .pdb se symbolem ladění MS, které vygeneroval linker pro cíle spustitelných souborů a sdílených knihoven",
	"assets/variables.json.CMAKE_PDB_OUTPUT_DIRECTORY_CONFIG": "Výstupní adresář pro soubory .pdb se symbolem ladění MS podle konfigurací, které vygeneroval linker pro cíle spustitelných souborů a sdílených knihoven",
	"assets/variables.json.CMAKE_PLATFORM_NO_VERSIONED_SONAME": "Tato proměnná slouží ke globálnímu řízení toho, jestli se mají pro sdílené knihovny používat cílové vlastnosti VERSION a SOVERSION. Pokud je tato hodnota nastavená na true, přidávání informací o verzi do každého cíle sdílené knihovny je zakázané.",
	"assets/variables.json.CMAKE_POLICY_DEFAULT_CMPNNNN": "Výchozí hodnota pro zásady CMake CMP<NNNN>, pokud se jinak ponechává nenastavená",
	"assets/variables.json.CMAKE_POLICY_WARNING_CMPNNNN": "Umožňuje explicitně povolit nebo zakázat upozornění, když se CMake Policy CMP<NNNN> nenastaví explicitně přes cmake_policy nebo implicitně přes cmake_minimum_required. Toto má význam jen pro zásady, které negenerují upozornění ve výchozím nastavení:",
	"assets/variables.json.CMAKE_POSITION_INDEPENDENT_CODE": "Výchozí hodnota POSITION_INDEPENDENT_CODE pro cíle",
	"assets/variables.json.CMAKE_PREFIX_PATH": "Středníky oddělený seznam adresářů určující prefixy instalace, ve kterých mají hledat příkazy find_package, find_program, find_library, find_file a find_path. Každý příkaz přidá příslušné podadresáře (například bin, lib nebo include), které má uvedené ve své dokumentaci.",
	"assets/variables.json.CMAKE_PROGRAM_PATH": "Seznam adresářů oddělených středníky, který určuje cestu hledání pro příkaz find_program. Ve výchozím nastavení je seznam prázdný, je určen k nastavení podle projektu.",
	"assets/variables.json.CMAKE_PROJECT_DESCRIPTION": "Popis projektu nejvyšší úrovně",
	"assets/variables.json.CMAKE_PROJECT_HOMEPAGE_URL": "Adresa URL domovské stránky projektu nejvyšší úrovně",
	"assets/variables.json.CMAKE_PROJECT_INCLUDE": "Soubor jazyka CMake, který má být zahrnut jako poslední krok všech volání příkazů projektu. Je určen pro vkládání vlastního kódu do sestavení projektu bez úpravy jeho zdroje. Podrobnější informace o souborech potenciálně zahrnutých během volání projektu naleznete v části Vkládání kódu.",
	"assets/variables.json.CMAKE_PROJECT_INCLUDE_BEFORE": "Soubor jazyka CMake, který má být zahrnut jako první krok všech volání příkazů projektu. Je určen pro vkládání vlastního kódu do sestavení projektu bez úpravy jeho zdroje. Podrobnější informace o souborech potenciálně zahrnutých během volání projektu naleznete v části Vkládání kódu.",
	"assets/variables.json.CMAKE_PROJECT_NAME": "Název projektu nejvyšší úrovně",
	"assets/variables.json.CMAKE_PROJECT_PROJECT-NAME_INCLUDE": "Soubor jazyka CMake, který má být zahrnut jako poslední krok všech volání příkazů projektu, které mají nastaven název projektu <PROJECT-NAME>. Je určen pro vkládání vlastního kódu do sestavení projektu bez úpravy jeho zdroje. Podrobnější informace o souborech potenciálně zahrnutých během volání projektu naleznete v části Vkládání kódu.",
	"assets/variables.json.CMAKE_PROJECT_PROJECT-NAME_INCLUDE_BEFORE": "Soubor jazyka CMake, který má být zahrnut jako první krok všech volání příkazů projektu, které mají nastaven název projektu <PROJECT-NAME>. Je určen pro vkládání vlastního kódu do sestavení projektu bez úpravy jeho zdroje. Podrobnější informace o souborech potenciálně zahrnutých během volání projektu naleznete v části Vkládání kódu.",
	"assets/variables.json.CMAKE_PROJECT_TOP_LEVEL_INCLUDES": "Seznam jazykových souborů CMake oddělených středníkem, které se mají zahrnout jako součást prvního volání projektu. Soubory budou zahrnuty ihned po načtení souboru s řetězcem nástrojů (pokud je zadán) a nastavení proměnných platformy, ale před povolením jakýchkoli jazyků. Proto nemusí být nastaveny proměnné specifické pro jednotlivé jazyky, včetně věcí jako CMAKE_<LANG>_COMPILER. Podrobnější informace o souborech potenciálně zahrnutých během volání projektu najdete v části Vkládání kódu.",
	"assets/variables.json.CMAKE_PROJECT_VERSION": "Verze projektu nejvyšší úrovně",
	"assets/variables.json.CMAKE_PROJECT_VERSION_MAJOR": "Hlavní verze projektu nejvyšší úrovně",
	"assets/variables.json.CMAKE_PROJECT_VERSION_MINOR": "Podverze projektu nejvyšší úrovně",
	"assets/variables.json.CMAKE_PROJECT_VERSION_PATCH": "Verze opravy projektu nejvyšší úrovně",
	"assets/variables.json.CMAKE_PROJECT_VERSION_TWEAK": "Verze vylepšení projektu nejvyšší úrovně",
	"assets/variables.json.CMAKE_RANLIB": "Název nástroj pro náhodné řazení pro statické knihovny",
	"assets/variables.json.CMAKE_REQUIRE_FIND_PACKAGE_PackageName": "Proměnná, která umožní nastavit, aby find_package volalo REQUIRED",
	"assets/variables.json.CMAKE_ROOT": "Instalační adresář pro spuštěný cmake",
	"assets/variables.json.CMAKE_RULE_MESSAGES": "Určete, jestli se má hlásit zpráva pro každé vytvářecí pravidlo.",
	"assets/variables.json.CMAKE_RUNTIME_OUTPUT_DIRECTORY": "Umístění pro všechny soubory s cílem RUNTIME při sestavení",
	"assets/variables.json.CMAKE_RUNTIME_OUTPUT_DIRECTORY_CONFIG": "Umístění pro všechny soubory s cílem RUNTIME při sestavení pro určitou konfiguraci",
	"assets/variables.json.CMAKE_SCRIPT_MODE_FILE": "Úplná cesta k souboru skriptu cmake -P, který se právě zpracovává",
	"assets/variables.json.CMAKE_SHARED_LIBRARY_ENABLE_EXPORTS": "Určete, zda sdílená knihovna vygeneruje soubor importu.",
	"assets/variables.json.CMAKE_SHARED_LIBRARY_PREFIX": "Předpona pro sdílené knihovny, se kterými se propojujete",
	"assets/variables.json.CMAKE_SHARED_LIBRARY_SUFFIX": "Přípona pro sdílené knihovny, ke kterým nastavujete propojení",
	"assets/variables.json.CMAKE_SHARED_LINKER_FLAGS": "Příznaky linkeru, které se mají použít pro vytvoření sdílených knihoven",
	"assets/variables.json.CMAKE_SHARED_LINKER_FLAGS_CONFIG": "Příznaky, které se mají použít při připojování sdílené knihovny",
	"assets/variables.json.CMAKE_SHARED_LINKER_FLAGS_CONFIG_INIT": "Hodnota používaná k inicializaci položky mezipaměti CMAKE_SHARED_LINKER_FLAGS_ při první konfiguraci stromu sestavení. Tuto proměnnou by měl nastavit soubor sady nástrojů. CMake může k této hodnotě předřadit nebo připojit obsah na základě prostředí a cílové platformy.",
	"assets/variables.json.CMAKE_SHARED_LINKER_FLAGS_INIT": "Hodnota používaná k inicializaci položky mezipaměti CMAKE_SHARED_LINKER_FLAGS při první konfiguraci stromu sestavení. Tuto proměnnou by měl nastavit soubor sady nástrojů. CMake může k této hodnotě předřadit nebo připojit obsah na základě prostředí a cílové platformy.",
	"assets/variables.json.CMAKE_SHARED_MODULE_PREFIX": "Předpona pro moduly, které lze načíst a se kterými se propojujete",
	"assets/variables.json.CMAKE_SHARED_MODULE_SUFFIX": "Přípona pro sdílené knihovny, ke kterým nastavujete propojení",
	"assets/variables.json.CMAKE_SIZEOF_VOID_P": "Velikost prázdného ukazatele",
	"assets/variables.json.CMAKE_SKIP_BUILD_RPATH": "Nezahrnovat cesty RPATH do stromu sestavení",
	"assets/variables.json.CMAKE_SKIP_INSTALL_ALL_DEPENDENCY": "Nenastavovat závislost cíle instalace na všech cílích",
	"assets/variables.json.CMAKE_SKIP_INSTALL_RPATH": "Nezahrnovat cesty RPATH do stromu instalace",
	"assets/variables.json.CMAKE_SKIP_INSTALL_RULES": "Určuje, jestli se má zakázat generování pravidel pro instalaci.",
	"assets/variables.json.CMAKE_SKIP_RPATH": "V případě hodnoty true nepřidávejte informace o cestě v režimu runtime.",
	"assets/variables.json.CMAKE_SKIP_TEST_ALL_DEPENDENCY": "Určete, jestli je cíl testu závislý na cíli all.",
	"assets/variables.json.CMAKE_SOURCE_DIR": "Cesta k nejvyšší úrovni zdrojového stromu",
	"assets/variables.json.CMAKE_STAGING_PREFIX": "Do této proměnné lze nastavit cestu instalace při křížové kompilaci. Může být užitečná, pokud cesta v CMAKE_SYSROOT je jen pro čtení, jinak by měla zůstat čistá.",
	"assets/variables.json.CMAKE_STATIC_LIBRARY_PREFIX": "Předpona pro statické knihovny, se kterými se propojujete",
	"assets/variables.json.CMAKE_STATIC_LIBRARY_SUFFIX": "Přípona pro statické knihovny, se kterými se propojujete",
	"assets/variables.json.CMAKE_STATIC_LINKER_FLAGS": "Příznaky, které se mají použít k vytvoření statických knihoven. Tyto příznaky budou předány archivačnímu programu (archivátoru) při vytváření statické knihovny.",
	"assets/variables.json.CMAKE_STATIC_LINKER_FLAGS_CONFIG": "Příznaky, které se mají použít k vytvoření statických knihoven. Tyto příznaky budou předány archivačnímu programu (archivátoru) při vytváření statické knihovny v konfiguraci <CONFIG>.",
	"assets/variables.json.CMAKE_STATIC_LINKER_FLAGS_CONFIG_INIT": "Hodnota používaná k inicializaci položky mezipaměti CMAKE_STATIC_LINKER_FLAGS_ při první konfiguraci stromu sestavení. Tuto proměnnou by měl nastavit soubor sady nástrojů. CMake může k této hodnotě předřadit nebo připojit obsah na základě prostředí a cílové platformy.",
	"assets/variables.json.CMAKE_STATIC_LINKER_FLAGS_INIT": "Hodnota používaná k inicializaci položky mezipaměti CMAKE_STATIC_LINKER_FLAGS při první konfiguraci stromu sestavení. Tuto proměnnou by měl nastavit soubor sady nástrojů. CMake může k této hodnotě předřadit nebo připojit obsah na základě prostředí a cílové platformy.",
	"assets/variables.json.CMAKE_SUBLIME_TEXT_2_ENV_SETTINGS": "Tato proměnná obsahuje seznam proměnných prostředí jako seznam tokenů se syntaxí var=hodnota.",
	"assets/variables.json.CMAKE_SUBLIME_TEXT_2_EXCLUDE_BUILD_TREE": "Pokud se tato proměnná na konci nejvyšší úrovně souboru CMakeLists.txt vyhodnotí s hodnotou ON, zvláštní generátor Sublime Text 2 vyloučí strom sestavení ze .sublime-project, pokud se nachází ve zdrojovém stromu.",
	"assets/variables.json.CMAKE_SUPPRESS_REGENERATION": "Pokud má CMAKE_SUPPRESS_REGENERATION hodnotu OFF, což je výchozí nastavení, pak CMake přidá zvláštní cíl, na kterém jsou všechny ostatní cíle závislé a který zkontroluje systém sestavení a volitelně znovu spustí CMake, aby se systém sestavení znovu vygeneroval, když se zdroj specifikace cíle změní.",
	"assets/variables.json.CMAKE_Swift_COMPILATION_MODE": "Zadejte, jak Swift zkompiluje cíl. Tato proměnná slouží k inicializaci vlastnosti Swift_COMPILATION_MODE na cílech při jejich vytváření.",
	"assets/variables.json.CMAKE_Swift_LANGUAGE_VERSION": "Nastavte tuto možnost na číslo jazykové verze Swift. Pokud není nastavená, bere se za platnou nejstarší starší verze, o které je známo, že je ve verzi Xcode hostitele:",
	"assets/variables.json.CMAKE_Swift_MODULE_DIRECTORY": "Adresář výstupu modulu pro Swift",
	"assets/variables.json.CMAKE_Swift_NUM_THREADS": "Počet vláken pro paralelní kompilaci pro cíle Swift",
	"assets/variables.json.CMAKE_SYSROOT": "Cesta k předání do kompilátoru v příznaku --sysroot",
	"assets/variables.json.CMAKE_SYSROOT_COMPILE": "Cesta k předání do kompilátoru v příznaku --sysroot při kompilaci zdrojových souborů. Je stejná jako CMAKE_SYSROOT, ale používá se jenom pro kompilaci zdrojů a ne k propojování.",
	"assets/variables.json.CMAKE_SYSROOT_LINK": "Cesta k předání do kompilátoru v příznaku --sysroot při propojování. Je stejná jako CMAKE_SYSROOT, ale používá se jenom pro propojování a ne ke kompilaci zdrojů.",
	"assets/variables.json.CMAKE_SYSTEM": "Složený název operačního systému, pro který se kompiluje CMake",
	"assets/variables.json.CMAKE_SYSTEM_APPBUNDLE_PATH": "Cesta vyhledávání pro balíčky aplikací macOS, kterou používají příkazy find_program a find_package. Ve výchozím nastavení obsahuje standardní adresáře pro aktuální systém. Projekt by ji neměl upravovat, použijte pro tento účel CMAKE_APPBUNDLE_PATH.",
	"assets/variables.json.CMAKE_SYSTEM_FRAMEWORK_PATH": "Cesta vyhledávání pro architektury macOS, kterou používají příkazy find_library, find_package, find_path a find_file. Ve výchozím nastavení obsahuje standardní adresáře pro aktuální systém. Projekt by ji neměl upravovat, použijte pro tento účel CMAKE_FRAMEWORK_PATH.",
	"assets/variables.json.CMAKE_SYSTEM_IGNORE_PATH": "Středníky oddělený seznam adresářů, které mají být ignorovány různými příkazy find...().",
	"assets/variables.json.CMAKE_SYSTEM_IGNORE_PREFIX_PATH": "Středníky oddělený seznam předpon vyhledávání, které mají být ignorovány příkazy find_program, find_library, find_file a find_path. Režim konfigurace příkazu find_package také ignoruje předpony (režim modulu není ovlivněný). Pokud místo toho chcete ignorovat konkrétní adresáře, podívejte se na CMAKE_IGNORE_NONPREFIX_VAR.",
	"assets/variables.json.CMAKE_SYSTEM_INCLUDE_PATH": "Středníky oddělený seznam adresářů určující cestu vyhledávání pro příkazy find_file a find_path. Ve výchozím nastavení obsahuje standardní adresáře pro aktuální systém. Projekt by ho neměl upravovat, použijte pro tento účel CMAKE_INCLUDE_PATH. Viz také proměnná CMAKE_SYSTEM_PREFIX_PATH.",
	"assets/variables.json.CMAKE_SYSTEM_LIBRARY_PATH": "Středníky oddělený seznam adresářů určující cestu vyhledávání pro příkaz find_library. Ve výchozím nastavení obsahuje standardní adresáře pro aktuální systém. Projekt by ho neměl upravovat, použijte pro tento účel CMAKE_LIBRARY_PATH. Viz také proměnná CMAKE_SYSTEM_PREFIX_PATH.",
	"assets/variables.json.CMAKE_SYSTEM_NAME": "Název operačního systému, pro který se má sestavit CMake. Verzi operačního systému zjistíte z proměnné CMAKE_SYSTEM_VERSION.",
	"assets/variables.json.CMAKE_SYSTEM_PREFIX_PATH": "Středníky oddělený seznam adresářů určující prefixy instalace, ve kterých mají hledat příkazy find_package, find_program, find_library, find_file a find_path. Každý příkaz přidá příslušné podadresáře (například bin, lib nebo include), které má uvedené ve své dokumentaci.",
	"assets/variables.json.CMAKE_SYSTEM_PROCESSOR": "Když se neprovádí křížová kompilace, má tato proměnná stejnou hodnotu jako proměnná CMAKE_HOST_SYSTEM_PROCESSOR. V mnoha případech bude odpovídat cílové architektuře pro sestavení, ale není to zaručeno. (Například ve Windows může být hostitel AMD64 i v případě, že se používá kompilátor MSVC cl s 32bitovým cílem.)",
	"assets/variables.json.CMAKE_SYSTEM_PROGRAM_PATH": "Středníky oddělený seznam adresářů určující cestu vyhledávání pro příkaz find_program. Ve výchozím nastavení obsahuje standardní adresáře pro aktuální systém. Projekt by ho neměl upravovat, použijte pro tento účel CMAKE_PROGRAM_PATH. Viz také proměnná CMAKE_SYSTEM_PREFIX_PATH.",
	"assets/variables.json.CMAKE_SYSTEM_VERSION": "Verze operačního systému, pro který se má sestavit CMake. Název operačního systému zjistíte z proměnné CMAKE_SYSTEM_NAME.",
	"assets/variables.json.CMAKE_TASKING_TOOLSET": "Vyberte sadu nástrojů Tasking, která poskytuje kompilátor.",
	"assets/variables.json.CMAKE_TEST_LAUNCHER": "Tato proměnná se používá k inicializaci vlastnosti cíle TEST_LAUNCHER u cílů spustitelných souborů při jejich vytváření. Používá se k určení spouštěče pro spouštění testů přidaných příkazem add_test, které spouštějí cíl spustitelného souboru.",
	"assets/variables.json.CMAKE_TLS_CAINFO": "Zadejte výchozí hodnotu pro možnosti TLS_CAINFO souborů a jejich příkazů. Ve výchozím nastavení není nastaveno.",
	"assets/variables.json.CMAKE_TLS_VERIFY": "Zadejte výchozí hodnotu souboru a možnosti TLS_VERIFY pro příkazy souboru. Pokud tato proměnná není nastavená, příkazy zkontrolují proměnnou prostředí CMAKE_TLS_VERIFY. Pokud není nastaveno ani jedno z toho, výchozí nastavení je Vypnuto.",
	"assets/variables.json.CMAKE_TLS_VERSION": "Zadejte výchozí hodnotu souboru a možnosti TLS_VERSION pro příkazy souboru. Pokud tato proměnná není nastavená, příkazy zkontrolují proměnnou prostředí CMAKE_TLS_VERSION.",
	"assets/variables.json.CMAKE_TOOLCHAIN_FILE": "Cesta k souboru sady nástrojů dodanému do cmake",
	"assets/variables.json.CMAKE_TRY_COMPILE_CONFIGURATION": "Konfigurace sestavení, která se používá pro projekty try_compile a try_run",
	"assets/variables.json.CMAKE_TRY_COMPILE_NO_PLATFORM_VARIABLES": "Nastavte na true, aby příkaz try_compile nepropagoval do testovacího projektu žádné proměnné platformy.",
	"assets/variables.json.CMAKE_TRY_COMPILE_PLATFORM_VARIABLES": "Seznam proměnných, který signatura zdrojového souboru příkazu try_compile musí rozšířit do testovacího projektu, aby cílem byla stejná platforma jako u projektu hostitele",
	"assets/variables.json.CMAKE_TRY_COMPILE_TARGET_TYPE": "Typ cíle vygenerovaný pro volání try_compile pomocí signatury zdrojového souboru. Platné hodnoty jsou:",
	"assets/variables.json.CMAKE_TWEAK_VERSION": "Definováno na hodnotu 0 za účelem kompatibility s kódem napsaným pro starší verze CMake, které mohly mít definované vyšší hodnoty",
	"assets/variables.json.CMAKE_UNITY_BUILD": "Tato proměnná se používá k inicializaci vlastnosti UNITY_BUILD cílů při jejich vytváření. Nastavení proměnné na hodnotu true povolí dávkovou kompilaci více zdrojů v rámci každého cíle. Tato funkce se označuje jako sestavení Unity nebo Jumbo.",
	"assets/variables.json.CMAKE_UNITY_BUILD_BATCH_SIZE": "Tato proměnná se používá k inicializaci vlastnosti UNITY_BUILD_BATCH_SIZE cílů při jejich vytváření. Určuje výchozí horní limit počtu zdrojových souborů, které mohou být kombinovány v jakémkoliv zdrojovém souboru unity v případě, že jsou pro cíl povolena sestavení unity.",
	"assets/variables.json.CMAKE_UNITY_BUILD_UNIQUE_ID": "Tato proměnná slouží k inicializaci vlastnosti UNITY_BUILD_UNIQUE_ID cílů ve chvíli, kdy se vytvářejí. Určuje název jedinečného identifikátoru vygenerovaného pro jednotlivé soubory v sestavení Unity.",
	"assets/variables.json.CMAKE_USER_MAKE_RULES_OVERRIDE": "Umožňuje zadat soubor CMake, který přepíše informace o platformě.",
	"assets/variables.json.CMAKE_USER_MAKE_RULES_OVERRIDE_LANG": "Umožňuje zadat soubor CMake, který přepíše informace o platformě pro jazyk <LANG>.",
	"assets/variables.json.CMAKE_USE_RELATIVE_PATHS": "Tato proměnná nemá žádný účinek. Částečně implementovaný efekt, který měla v předchozích vydaných verzích, už ve verzi CMake 3.4 není.",
	"assets/variables.json.CMAKE_VERBOSE_MAKEFILE": "Umožňuje povolit podrobný výstup z buildů Makefile.",
	"assets/variables.json.CMAKE_VERIFY_INTERFACE_HEADER_SETS": "Tato proměnná se používá k inicializaci vlastnosti VERIFY_INTERFACE_HEADER_SETS cílů při jejich vytváření. Její nastavení na true umožňuje ověřování sad záhlaví.",
	"assets/variables.json.CMAKE_VERSION": "Řetězec verze CMake jako tři nezáporné celočíselné komponenty oddělené . a pravděpodobně následované - a dalšími informacemi. První dvě komponenty představují úroveň funkce a třetí komponenta představuje úroveň opravy chyby nebo datum vývoje.",
	"assets/variables.json.CMAKE_VISIBILITY_INLINES_HIDDEN": "Výchozí hodnota pro cílovou vlastnost VISIBILITY_INLINES_HIDDEN při vytvoření cíle",
	"assets/variables.json.CMAKE_VS_DEBUGGER_COMMAND": "Tato proměnná slouží k inicializaci vlastnosti VS_DEBUGGER_COMMAND u každého cíle při jeho vytvoření. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_VS_DEBUGGER_COMMAND_ARGUMENTS": "Tato proměnná slouží k inicializaci vlastnosti VS_DEBUGGER_COMMAND_ARGUMENTS u každého cíle při jeho vytvoření. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_VS_DEBUGGER_ENVIRONMENT": "Tato proměnná slouží k inicializaci vlastnosti VS_DEBUGGER_ENVIRONMENT u každého cíle při jeho vytvoření. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_VS_DEBUGGER_WORKING_DIRECTORY": "Tato proměnná slouží k inicializaci vlastnosti VS_DEBUGGER_WORKING_DIRECTORY u každého cíle při jeho vytvoření. Další informace najdete v popisu této vlastnosti cílů.",
	"assets/variables.json.CMAKE_VS_DEVENV_COMMAND": "Generátory pro Visual Studio 12 2013 a novější nastaví tuto proměnnou na příkaz devenv.com nainstalovaný s odpovídající verzí sady Visual Studio. Počítejte s tím, že tato proměnná může být v edicích Visual Studio Express prázdná, protože ty tento nástroj neobsahují.",
	"assets/variables.json.CMAKE_VS_GLOBALS": "Seznam záznamů Klíč=Hodnota, které se mají nastavit pro každý cíl jako cílové vlastnosti VS_GLOBAL_ se záznamem proměnná=Klíč a hodnotou Hodnota.",
	"assets/variables.json.CMAKE_VS_INCLUDE_INSTALL_TO_DEFAULT_BUILD": "Umožňuje zahrnout cíl INSTALL do výchozího sestavení.",
	"assets/variables.json.CMAKE_VS_INCLUDE_PACKAGE_TO_DEFAULT_BUILD": "Umožňuje zahrnout cíl PACKAGE do výchozího sestavení.",
	"assets/variables.json.CMAKE_VS_INTEL_Fortran_PROJECT_VERSION": "Při generování pro Visual Studio 12 2013 nebo novější s nainstalovaným modulem plug-in Intel Fortran toto nastavení určuje verzi formátu souboru projektu .vfproj. Je určené pro interní použití nástroji CMake a neměl by ho používat kód projektu.",
	"assets/variables.json.CMAKE_VS_JUST_MY_CODE_DEBUGGING": "Povolí možnost Pouze můj kód s ladicím programem Visual Studio.",
	"assets/variables.json.CMAKE_VS_MSBUILD_COMMAND": "Generátory pro Visual Studio 12 2013 a vyšší nastavily tuto proměnnou na příkaz MSBuild.exe nainstalovaný s odpovídající verzí Visual Studio.",
	"assets/variables.json.CMAKE_VS_NO_COMPILE_BATCHING": "Při použití generátorů Visual Studio vypněte dávkování kompilace.",
	"assets/variables.json.CMAKE_VS_NsightTegra_VERSION": "Při použití generátoru sady Visual Studio s proměnnou CMAKE_SYSTEM_NAME nastavenou na hodnotu Android tato proměnná obsahuje číslo verze nainstalovaného prostředí NVIDIA Nsight Tegra Visual Studio Edition.",
	"assets/variables.json.CMAKE_VS_NUGET_PACKAGE_RESTORE": "Při použití generátoru Visual Studio tato proměnná mezipaměti řídí, jestli se msbuild má automaticky pokoušet obnovit balíčky NuGet před sestavením. Balíčky NuGet je možné definovat pomocí vlastnosti VS_PACKAGE_REFERENCES v cíli. Pokud nejsou definovány žádné odkazy na balíček, toto nastavení neprovede žádnou akci.",
	"assets/variables.json.CMAKE_VS_PLATFORM_NAME": "Název cílové platformy sady Visual Studio, který používá aktuální generátor",
	"assets/variables.json.CMAKE_VS_PLATFORM_NAME_DEFAULT": "Výchozí hodnota pro název cílové platformy sady Visual Studio pro aktuální generátor bez toho, aby se brala v úvahu hodnota proměnné CMAKE_GENERATOR_PLATFORM. Pro generátory Visual Studio pro VS 2017 a nižší je to vždy Win32. Pro VS 2019 a vyšší se vychází z hostitelské platformy.",
	"assets/variables.json.CMAKE_VS_PLATFORM_TOOLSET": "Název sady nástrojů platformy sady Visual Studio",
	"assets/variables.json.CMAKE_VS_PLATFORM_TOOLSET_CUDA": "Verze sady nástrojů NVIDIA CUDA, jejíž sada nástrojů sady Visual Studio se má použít",
	"assets/variables.json.CMAKE_VS_PLATFORM_TOOLSET_CUDA_CUSTOM_DIR": "Cesta k samostatné sadě nástrojů NVIDIA CUDA (např. extrahované z instalačního programu)",
	"assets/variables.json.CMAKE_VS_PLATFORM_TOOLSET_FORTRAN": "Kompilátor Fortran, který se má používat v projektech sady Visual Studio",
	"assets/variables.json.CMAKE_VS_PLATFORM_TOOLSET_HOST_ARCHITECTURE": "Preferovaná architektura nástrojů sady Visual Studio",
	"assets/variables.json.CMAKE_VS_PLATFORM_TOOLSET_VERSION": "Verze sady nástrojů platformy sady Visual Studio",
	"assets/variables.json.CMAKE_VS_SDK_EXCLUDE_DIRECTORIES": "Tato proměnná umožňuje potlačit výchozí vyloučené adresáře sady Visual Studio.",
	"assets/variables.json.CMAKE_VS_SDK_EXECUTABLE_DIRECTORIES": "Tato proměnná umožňuje potlačit výchozí adresáře spustitelných souborů sady Visual Studio.",
	"assets/variables.json.CMAKE_VS_SDK_INCLUDE_DIRECTORIES": "Tato proměnná umožňuje potlačit výchozí adresáře zahrnutí sady Visual Studio.",
	"assets/variables.json.CMAKE_VS_SDK_LIBRARY_DIRECTORIES": "Tato proměnná umožňuje potlačit výchozí adresáře knihoven sady Visual Studio.",
	"assets/variables.json.CMAKE_VS_SDK_LIBRARY_WINRT_DIRECTORIES": "Tato proměnná umožňuje potlačit výchozí adresáře WinRT knihoven sady Visual Studio.",
	"assets/variables.json.CMAKE_VS_SDK_REFERENCE_DIRECTORIES": "Tato proměnná umožňuje potlačit výchozí adresáře odkazů sady Visual Studio.",
	"assets/variables.json.CMAKE_VS_SDK_SOURCE_DIRECTORIES": "Tato proměnná umožňuje potlačit výchozí adresáře zdrojů sady Visual Studio.",
	"assets/variables.json.CMAKE_VS_TARGET_FRAMEWORK_IDENTIFIER": "Identifikátor cílové architektury sady Visual Studio",
	"assets/variables.json.CMAKE_VS_TARGET_FRAMEWORK_TARGETS_VERSION": "Verze cílů cílové architektury sady Visual Studio",
	"assets/variables.json.CMAKE_VS_TARGET_FRAMEWORK_VERSION": "Verze cílové architektury sady Visual Studio",
	"assets/variables.json.CMAKE_VS_USE_DEBUG_LIBRARIES": "Indikuje pro generátory sady Visual Studio, které konfigurace se považují za konfigurace ladění. To řídí nastavení UseDebugLibraries v každé konfiguraci souboru .vcxproj.",
	"assets/variables.json.CMAKE_VS_VERSION_BUILD_NUMBER": "Verze Visual Studia.",
	"assets/variables.json.CMAKE_VS_WINDOWS_TARGET_PLATFORM_MIN_VERSION": "Řekněte generátorům Visual Studio, aby používaly danou minimální verzi cílové platformy Windows.",
	"assets/variables.json.CMAKE_VS_WINDOWS_TARGET_PLATFORM_VERSION": "Verze cílové platformy Windows sady Visual Studio",
	"assets/variables.json.CMAKE_VS_WINDOWS_TARGET_PLATFORM_VERSION_MAXIMUM": "Přepíše maximální verzi sady Windows 10 SDK pro sadu VS 2015 a novější.",
	"assets/variables.json.CMAKE_VS_WINRT_BY_DEFAULT": "Informuje generátory Visual Studio pro VS 2010 a vyšší, že cílová platforma umožňuje ve výchozím nastavení kompilaci WinRT a musí být výslovně zakázána, pokud je vynechaný parametr /ZW nebo proměnná VS_WINRT_COMPONENT (oproti jejímu povolení, když je některá z těchto možností k dispozici).",
	"assets/variables.json.CMAKE_WARN_DEPRECATED": "Určuje, jestli se mají vydávat upozornění pro zastaralé funkce.",
	"assets/variables.json.CMAKE_WARN_ON_ABSOLUTE_INSTALL_DESTINATION": "Požádá skript cmake_install.cmake, aby upozornil pokaždé, když se zjistí soubor s absolutním umístěním INSTALL DESTINATION (DESTINACE INSTALACE).",
	"assets/variables.json.CMAKE_WATCOM_RUNTIME_LIBRARY": "Vyberte knihovnu runtime Watcom, kterou budou používat kompilátory, které cílí na Watcom ABI. Tato proměnná slouží k inicializaci vlastnostWATCOM_RUNTIME_LIBRARY u všech cílů v době, kdy se vytvářejí. Je také šířena voláními příkazu try_compile do projektu testu.",
	"assets/variables.json.CMAKE_WIN32_EXECUTABLE": "Výchozí hodnota pro vlastnost WIN32_EXECUTABLE cílů",
	"assets/variables.json.CMAKE_WINDOWS_EXPORT_ALL_SYMBOLS": "Výchozí hodnota pro cílovou vlastnost WINDOWS_EXPORT_ALL_SYMBOLS. Tato proměnná slouží k inicializaci vlastnosti na každém cíli při jeho vytvoření.",
	"assets/variables.json.CMAKE_XCODE_ATTRIBUTE_an-attribute": "Nastavte cílové atributy pro Xcode přímo.",
	"assets/variables.json.CMAKE_XCODE_BUILD_SYSTEM": "Výběr sestavovacího systému Xcode",
	"assets/variables.json.CMAKE_XCODE_GENERATE_SCHEME": "Pokud je možnost povolena, vygeneruje generátor Xcode soubory schématu. Jsou užitečné pro vyvolání akcí analyzování, archivace, sestavení pro testování a testování z příkazového řádku.",
	"assets/variables.json.CMAKE_XCODE_GENERATE_TOP_LEVEL_PROJECT_ONLY": "Pokud je možnost povolena, vygeneruje generátor Xcode jenom jeden soubor projektu Xcode pro první příkaz project() shora namísto generování souboru pro každý příkaz project().",
	"assets/variables.json.CMAKE_XCODE_LINK_BUILD_PHASE_MODE": "Tato proměnná slouží k inicializaci vlastnosti XCODE_LINK_BUILD_PHASE_MODE v cílech. Má vliv na metody, které generátor Xcode používá k propojení různých druhů knihoven. Její výchozí hodnota je NONE.",
	"assets/variables.json.CMAKE_XCODE_PLATFORM_TOOLSET": "Výběr kompilátoru Xcode",
	"assets/variables.json.CMAKE_XCODE_SCHEME_ADDRESS_SANITIZER": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky povolit sanitizér adres.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_ADDRESS_SANITIZER_USE_AFTER_RETURN": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky povolit detekce použití zásobníku po návratu.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_DEBUG_DOCUMENT_VERSIONING": "Určuje, jestli se má povolit možnost Povolit ladění, když se v oddíle Možnosti vygenerovaného schématu Xcode používá prohlížeč verzí dokumentu.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_DISABLE_MAIN_THREAD_CHECKER": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu Diagnostics zakázat Main Thread Checker.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_DYNAMIC_LIBRARY_LOADS": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky povolit načítání dynamických knihoven.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_DYNAMIC_LINKER_API_USAGE": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky povolit dynamické použití rozhraní API linkeru.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_ENABLE_GPU_API_VALIDATION": "Hodnota vlastnosti pro Metal: Ověření rozhraní API v části Možnosti vygenerovaného schématu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_ENABLE_GPU_FRAME_CAPTURE_MODE": "Hodnota vlastnosti pro zachytávání snímků GPU v části Možnosti vygenerovaného schématu Xcode. Příklady hodnot jsou Metal a Disabled.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_ENABLE_GPU_SHADER_VALIDATION": "Hodnota vlastnosti pro Metal: Ověření shaderu v části Možnosti vygenerovaného schématu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_ENVIRONMENT": "Zadejte proměnné prostředí, které by se měly přidat do části Argument vygenerovaného schématu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_GUARD_MALLOC": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky povolit možnost Guard Malloc.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_LAUNCH_CONFIGURATION": "Nastavte konfiguraci sestavení tak, aby se spustil cíl.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_LAUNCH_MODE": "Hodnota vlastnosti Launch v oddílu Informace vygenerovaného schématu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_MAIN_THREAD_CHECKER_STOP": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu Diagnostics u Main Thread Checkeru povolit možnost Pause při potížích.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_MALLOC_GUARD_EDGES": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky povolit možnost Malloc Guard Edges.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_MALLOC_SCRIBBLE": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky povolit možnost Malloc Scribble.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_MALLOC_STACK": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky povolit zásobník funkce Malloc.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_THREAD_SANITIZER": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky povolit sanitizér vláken.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_THREAD_SANITIZER_STOP": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky u Thread Sanitizeru povolit možnost pozastavení při potížích.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_UNDEFINED_BEHAVIOUR_SANITIZER": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky povolit Undefined Behavior Sanitizer.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_UNDEFINED_BEHAVIOUR_SANITIZER_STOP": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky u Undefined Behavior Sanitizeru povolit možnost pozastavení při potížích.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_WORKING_DIRECTORY": "Umožňuje zadat pracovní adresář akcí spuštění a profilu ve vygenerovaném schématu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_ZOMBIE_OBJECTS": "Určuje, jestli se mají ve vygenerovaném schématu Xcode v oddílu diagnostiky povolit zombie objekty.",
	"assets/variables.json.CMAKE_XCODE_XCCONFIG": "Pokud je tato možnost nastavená, generátor Xcode zaregistruje zadaný soubor jako globální soubor XCConfig. Pro soubory XCConfig na cílové úrovni se podívejte na XCODE_XCCONFIG cílovou vlastnost.",
	"assets/variables.json.CPACK_ABSOLUTE_DESTINATION_FILES": "Seznam souborů, které se nainstalovaly pomocí cesty ABSOLUTE DESTINATION",
	"assets/variables.json.CPACK_COMPONENT_INCLUDE_TOPLEVEL_DIRECTORY": "Logický přepínač pro zahrnutí nebo vyloučení adresáře nejvyšší úrovně (v případě komponent)",
	"assets/variables.json.CPACK_CUSTOM_INSTALL_VARIABLES": "Proměnné CPack (nastavené například pomocí skriptů cpack -D, CPackConfig.cmake nebo CPACK_PROJECT_CONFIG_FILE) nejsou přímo viditelné v instalačních skriptech. Místo toho můžete předávat seznam párů varName=value v proměnné CPACK_CUSTOM_INSTALL_VARIABLES. Při instalaci bude mít každá položka v seznamu za následek nastavení proměnné se zadaným názvem (varName) na danou hodnotu. Parametr = lze pro prázdnou hodnotu vynechat.",
	"assets/variables.json.CPACK_ERROR_ON_ABSOLUTE_INSTALL_DESTINATION": "Požádá CPack, aby skončil s chybou, jakmile se zjistí soubor s absolutním umístěním INSTALL DESTINATION (DESTINACE INSTALACE).",
	"assets/variables.json.CPACK_INCLUDE_TOPLEVEL_DIRECTORY": "Logický přepínač pro zahrnutí nebo vyloučení adresáře nejvyšší úrovně",
	"assets/variables.json.CPACK_INSTALL_DEFAULT_DIRECTORY_PERMISSIONS": "Výchozí oprávnění pro adresáře implicitně vytvořené během balíčkování",
	"assets/variables.json.CPACK_PACKAGING_INSTALL_PREFIX": "Předpona použitá v balíčku sestavení",
	"assets/variables.json.CPACK_SET_DESTDIR": "Logický přepínač, aby CPack používal při balení mechanismus DESTDIR",
	"assets/variables.json.CPACK_WARN_ON_ABSOLUTE_INSTALL_DESTINATION": "Požádá CPack, aby upozornil pokaždé, když se zjistí soubor s absolutním umístěním INSTALL DESTINATION (DESTINACE INSTALACE).",
	"assets/variables.json.CTEST_BINARY_DIRECTORY": "Umožňuje zadat nastavení BuildDirectory CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_BUILD_COMMAND": "Umožňuje zadat nastavení MakeCommand CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_BUILD_NAME": "Umožňuje zadat nastavení BuildName CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_BZR_COMMAND": "Umožňuje zadat nastavení BZRCommand CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_BZR_UPDATE_OPTIONS": "Umožňuje zadat nastavení BZRUpdateOptions CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_CHANGE_ID": "Umožňuje zadat nastavení ChangeId CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_CHECKOUT_COMMAND": "Řekne příkazu ctest_start, jak rezervovat nebo inicializovat zdrojový adresář ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_CONFIGURATION_TYPE": "Umožňuje zadat nastavení DefaultCTestConfigurationType CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_CONFIGURE_COMMAND": "Umožňuje zadat nastavení ConfigureCommand CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_COVERAGE_COMMAND": "Umožňuje zadat nastavení CoverageCommand CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_COVERAGE_EXTRA_FLAGS": "Umožňuje zadat nastavení CoverageExtraFlags CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_CURL_OPTIONS": "Umožňuje zadat nastavení CurlOptions CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_CUSTOM_COVERAGE_EXCLUDE": "Seznam regulárních výrazů, které budou použity k vyloučení souborů podle jejich cesty z výstupu pokrytí příkazem ctest_coverage",
	"assets/variables.json.CTEST_CUSTOM_ERROR_EXCEPTION": "Seznam regulárních výrazů, které se použijí ve výstupech sestavení příkazem ctest_build k vyloučení při zjišťování chybových zpráv.",
	"assets/variables.json.CTEST_CUSTOM_ERROR_MATCH": "Seznam regulárních výrazů, které budou použity k zjišťování chybových zpráv ve výstupech sestavení příkazem ctest_build.",
	"assets/variables.json.CTEST_CUSTOM_ERROR_POST_CONTEXT": "Počet řádků, které mají být zahrnuty jako kontext, které následují za chybovou zprávou, příkazem ctest_build. Výchozí hodnota je 10.",
	"assets/variables.json.CTEST_CUSTOM_ERROR_PRE_CONTEXT": "Počet řádků, které mají být zahrnuty jako kontext, které předcházejí chybové zprávě, příkazem ctest_build. Výchozí hodnota je 10.",
	"assets/variables.json.CTEST_CUSTOM_MAXIMUM_FAILED_TEST_OUTPUT_SIZE": "Při ukládání výstupu neúspěšného testu se jedná o maximální velikost v bajtech, která bude shromážděna příkazem ctest_test. Výchozí hodnota je 307200 (300 KiB). Možné režimy zkracování najdete v CTEST_CUSTOM_TEST_OUTPUT_TRUNCATION.",
	"assets/variables.json.CTEST_CUSTOM_MAXIMUM_NUMBER_OF_ERRORS": "Maximální počet chyb v jediném kroku sestavení, který bude rozpoznán. Po nich příkaz ctest_test zkrátí výstup. Výchozí hodnota je 50.",
	"assets/variables.json.CTEST_CUSTOM_MAXIMUM_NUMBER_OF_WARNINGS": "Maximální počet upozornění v jediném kroku sestavení, který bude rozpoznán. Po nich příkaz ctest_test zkrátí výstup. Výchozí hodnota je 50.",
	"assets/variables.json.CTEST_CUSTOM_MAXIMUM_PASSED_TEST_OUTPUT_SIZE": "Při ukládání výstupu úspěšného testu se jedná o maximální velikost v bajtech, která bude shromážděna příkazem ctest_test. Výchozí hodnota je 1024 (1 KiB). Možné režimy zkracování najdete v CTEST_CUSTOM_TEST_OUTPUT_TRUNCATION.",
	"assets/variables.json.CTEST_CUSTOM_MEMCHECK_IGNORE": "Seznam regulárních výrazů, které budou použity k vyloučení testů během příkazu ctest_memcheck",
	"assets/variables.json.CTEST_CUSTOM_POST_MEMCHECK": "Seznam příkazů ke spuštění na konci příkazu ctest_memcheck",
	"assets/variables.json.CTEST_CUSTOM_POST_TEST": "Seznam příkazů ke spuštění na konci příkazu ctest_test",
	"assets/variables.json.CTEST_CUSTOM_PRE_MEMCHECK": "Seznam příkazů ke spuštění na začátku příkazu ctest_memcheck",
	"assets/variables.json.CTEST_CUSTOM_PRE_TEST": "Seznam příkazů ke spuštění na začátku příkazu ctest_test",
	"assets/variables.json.CTEST_CUSTOM_TESTS_IGNORE": "Seznam názvů testů, které mají být vyloučeny ze sady testů spuštěných příkazem ctest_test.",
	"assets/variables.json.CTEST_CUSTOM_TEST_OUTPUT_TRUNCATION": "Nastavení režimu zkracování výstupu testu v případě, že je pomocí proměnných CTEST_CUSTOM_MAXIMUM_PASSED_TEST_OUTPUT_SIZE nebo CTEST_CUSTOM_MAXIMUM_FAILED_TEST_OUTPUT_SIZE nakonfigurována maximální velikost. Ve výchozím nastavení se konec výstupu zkrátí. Další možné hodnoty jsou střed a začátek.",
	"assets/variables.json.CTEST_CUSTOM_WARNING_EXCEPTION": "Seznam regulárních výrazů, které budou použity k vyloučení při zjišťování upozornění ve výstupech sestavení příkazem ctest_build",
	"assets/variables.json.CTEST_CUSTOM_WARNING_MATCH": "Seznam regulárních výrazů, které budou použity k zjišťování upozornění ve výstupech sestavení příkazem ctest_build",
	"assets/variables.json.CTEST_CVS_CHECKOUT": "Zastaralé. Místo toho použijte CTEST_CHECKOUT_COMMAND.",
	"assets/variables.json.CTEST_CVS_COMMAND": "Umožňuje zadat nastavení CVSCommand CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_CVS_UPDATE_OPTIONS": "Umožňuje zadat nastavení CVSUpdateOptions CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_DROP_LOCATION": "Umožňuje zadat nastavení DropLocation CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_DROP_METHOD": "Umožňuje zadat nastavení DropMethod CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_DROP_SITE": "Umožňuje zadat nastavení DropSite CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_DROP_SITE_CDASH": "Umožňuje zadat nastavení IsCDash CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_DROP_SITE_PASSWORD": "Umožňuje zadat nastavení DropSitePassword CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_DROP_SITE_USER": "Umožňuje zadat nastavení DropSiteUser CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_EXTRA_COVERAGE_GLOB": "Seznam regulárních výrazů, které budou použity k nalezení souborů, které by měly být pokryty, příkazem ctest_coverage",
	"assets/variables.json.CTEST_GIT_COMMAND": "Umožňuje zadat nastavení GITCommand CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_GIT_INIT_SUBMODULES": "Umožňuje zadat nastavení GITInitSubmodules CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_GIT_UPDATE_CUSTOM": "Umožňuje zadat nastavení GITUpdateCustom CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_GIT_UPDATE_OPTIONS": "Umožňuje zadat nastavení GITUpdateOptions CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_HG_COMMAND": "Umožňuje zadat nastavení HGCommand CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_HG_UPDATE_OPTIONS": "Umožňuje zadat nastavení HGUpdateOptions CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_LABELS_FOR_SUBPROJECTS": "Umožňuje zadat nastavení LabelsForSubprojects CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_MEMORYCHECK_COMMAND": "Umožňuje zadat nastavení MemoryCheckCommand CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_MEMORYCHECK_COMMAND_OPTIONS": "Umožňuje zadat nastavení MemoryCheckCommandOptions CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_MEMORYCHECK_SANITIZER_OPTIONS": "Umožňuje zadat nastavení MemoryCheckSanitizerOptions CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_MEMORYCHECK_SUPPRESSIONS_FILE": "Umožňuje zadat nastavení MemoryCheckSuppressionFile CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_MEMORYCHECK_TYPE": "Umožňuje zadat nastavení MemoryCheckType CTestu ve skriptu klienta řídicího panelu ctest. Platné hodnoty jsou Valgrind, Purify, BoundsChecker, DrMemory, CudaSanitizer, ThreadSanitizer, AddressSanitizer, LeakSanitizer, MemorySanitizer a UndefinedBehaviorSanitizer.",
	"assets/variables.json.CTEST_NIGHTLY_START_TIME": "Umožňuje zadat nastavení NightlyStartTime CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_P4_CLIENT": "Umožňuje zadat nastavení P4Client CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_P4_COMMAND": "Umožňuje zadat nastavení P4Command CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_P4_OPTIONS": "Umožňuje zadat nastavení P4Options CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_P4_UPDATE_OPTIONS": "Umožňuje zadat nastavení P4UpdateOptions CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_RESOURCE_SPEC_FILE": "Umožňuje zadat nastavení ResourceSpecFile CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_RUN_CURRENT_SCRIPT": "Nastavení na 0 zabraňuje, aby byl znovu spuštěn příkaz ctest, když dosáhne konce skriptu spuštěného voláním ctest -S.",
	"assets/variables.json.CTEST_SCP_COMMAND": "Starší možnost. Nepoužívá se.",
	"assets/variables.json.CTEST_SCRIPT_DIRECTORY": "Adresář obsahující skript CTest na nejvyšší úrovni. Koncept je podobný jako u CMAKE_SOURCE_DIR.",
	"assets/variables.json.CTEST_SITE": "Umožňuje zadat nastavení Site CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_SOURCE_DIRECTORY": "Umožňuje zadat nastavení SourceDirectory CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_SUBMIT_INACTIVITY_TIMEOUT": "Umožňuje zadat nastavení SubmitInactivityTimeout CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_SUBMIT_URL": "Umožňuje zadat nastavení SubmitURL CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_SVN_COMMAND": "Umožňuje zadat nastavení SVNCommand CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_SVN_OPTIONS": "Umožňuje zadat nastavení SVNOptions CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_SVN_UPDATE_OPTIONS": "Umožňuje zadat nastavení SVNUpdateOptions CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_TEST_LOAD": "Umožňuje zadat nastavení TestLoad v testovacím kroku CTestu skriptu klienta řídicího panelu ctest. Nastaví výchozí hodnotu pro možnost TEST_LOAD příkazu ctest_test.",
	"assets/variables.json.CTEST_TEST_TIMEOUT": "Umožňuje zadat nastavení TimeOut CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_TLS_VERIFY": "Nastavení CTest TLSVerify zadejte ve skriptu klienta řídicího panelu ctest nebo v kódu CMakeLists.txt projektu před začleněním modulu CTest. Hodnota je logická hodnota, která určuje, jestli se má při odesílání do řídicího panelu prostřednictvím adres URL https:// ověřovat certifikát serveru.",
	"assets/variables.json.CTEST_TLS_VERSION": "Nastavení CTest TLSVersion zadejte ve skriptu klienta řídicího panelu ctest nebo v kódu CMakeLists.txt projektu před začleněním modulu CTest. Hodnota je minimální verze protokolu TLS povolená při odesílání do řídicího panelu přes adresy URL https://.",
	"assets/variables.json.CTEST_TRIGGER_SITE": "Starší možnost. Nepoužívá se.",
	"assets/variables.json.CTEST_UPDATE_COMMAND": "Umožňuje zadat nastavení UpdateCommand CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_UPDATE_OPTIONS": "Umožňuje zadat nastavení UpdateOptions CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_UPDATE_VERSION_ONLY": "Umožňuje zadat nastavení UpdateVersionOnly CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_UPDATE_VERSION_OVERRIDE": "Umožňuje zadat nastavení UpdateVersionOverride CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CTEST_USE_LAUNCHERS": "Umožňuje zadat nastavení UseLaunchers CTestu ve skriptu klienta řídicího panelu ctest.",
	"assets/variables.json.CYGWIN": "Hodnota true pro Cygwin",
	"assets/variables.json.ENV": "Operátor pro čtení proměnných prostředí",
	"assets/variables.json.EXECUTABLE_OUTPUT_PATH": "Stará proměnná umístění spustitelného souboru",
	"assets/variables.json.GHSMULTI": "1, pokud se používá generátor MULTI od Green Hills.",
	"assets/variables.json.IOS": "Nastavte na hodnotu 1, pokud je cílovým systémem (CMAKE_SYSTEM_NAME) iOS.",
	"assets/variables.json.LIBRARY_OUTPUT_PATH": "Stará proměnná umístění knihovny",
	"assets/variables.json.LINUX": "Pokud je cílovým systémem Linux, nastavte hodnotu true.",
	"assets/variables.json.MINGW": "Nastavte na hodnotu true, pokud je povolený alespoň jeden jazyk s kompilátorem, který cílí na GNU ABI ve Windows (MinGW).",
	"assets/variables.json.MSVC": "Nastavte na hodnotu True, pokud je kompilátor nějakou verzí Microsoft Visual C++ nebo jiného kompilátoru simulujícího syntaxi příkazového řádku Visual C++ cl.",
	"assets/variables.json.MSVC10": "Nedoporučuje se. Použijte radši proměnnou MSVC_VERSION.",
	"assets/variables.json.MSVC11": "Nedoporučuje se. Použijte radši proměnnou MSVC_VERSION.",
	"assets/variables.json.MSVC12": "Nedoporučuje se. Použijte radši proměnnou MSVC_VERSION.",
	"assets/variables.json.MSVC14": "Nedoporučuje se. Použijte radši proměnnou MSVC_VERSION.",
	"assets/variables.json.MSVC60": "Nedoporučuje se. Použijte radši proměnnou MSVC_VERSION.",
	"assets/variables.json.MSVC70": "Nedoporučuje se. Použijte radši proměnnou MSVC_VERSION.",
	"assets/variables.json.MSVC71": "Nedoporučuje se. Použijte radši proměnnou MSVC_VERSION.",
	"assets/variables.json.MSVC80": "Nedoporučuje se. Použijte radši proměnnou MSVC_VERSION.",
	"assets/variables.json.MSVC90": "Nedoporučuje se. Použijte radši proměnnou MSVC_VERSION.",
	"assets/variables.json.MSVC_IDE": "Je true, pokud se používá rozhraní IDE Microsoft Visual C++.",
	"assets/variables.json.MSVC_TOOLSET_VERSION": "Verze používané sady nástrojů Microsoft Visual C/C++, pokud se nějaká používá. Pokud se používá jako MSVC, tato proměnná je nastavena na základě verze kompilátoru, jak ji stanovuje proměnná MSVC_VERSION.",
	"assets/variables.json.MSVC_VERSION": "Verze používané aplikace Microsoft Visual C/C++, pokud se nějaká používá. Pokud se používá kompilátor simulující Visual C++, je tato proměnná nastavena na verzi simulované sady nástrojů, jak ji stanovuje definice preprocesoru _MSC_VER.",
	"assets/variables.json.MSYS": "Má hodnotu true při použití generátoru MSYS Makefiles.",
	"assets/variables.json.PackageName_ROOT": "Volání do find_package (<PackageName>) bude hledat v předponách určených proměnnou CMake <PackageName>_ROOT, kde <PackageName> je název daný volání find_package (je nutné dodržet velikost písmen) a _ROOT je literál. Například find_package(Foo) bude vyhledávat předpony zadané v proměnné CMake Foo_ROOT (pokud je nastavená). Viz zásada CMP0074.",
	"assets/variables.json.PROJECT-NAME_BINARY_DIR": "Binární adresář nejvyšší úrovně pro jmenovaný projekt",
	"assets/variables.json.PROJECT-NAME_DESCRIPTION": "Hodnota zadaná pro možnost DESCRIPTION posledního volání příkazu projektu s názvem projektu <PROJECT-NAME>, pokud existuje.",
	"assets/variables.json.PROJECT-NAME_HOMEPAGE_URL": "Hodnota zadaná pro možnost HOMEPAGE_URL posledního volání příkazu projektu s názvem projektu <PROJECT-NAME>, pokud existuje.",
	"assets/variables.json.PROJECT-NAME_IS_TOP_LEVEL": "Logická proměnná označující, jestli byl pojmenovaný projekt volán v souboru CMakeLists.txt nejvyšší úrovně.",
	"assets/variables.json.PROJECT-NAME_SOURCE_DIR": "Zdrojový adresář nejvyšší úrovně pro jmenovaný projekt",
	"assets/variables.json.PROJECT-NAME_VERSION": "Hodnota zadaná pro možnost VERSION posledního volání příkazu projektu s názvem projektu <PROJECT-NAME>, pokud existuje.",
	"assets/variables.json.PROJECT-NAME_VERSION_MAJOR": "První komponenta čísla verze proměnné <PROJECT-NAME>_VERSION nastavená příkazem projektu",
	"assets/variables.json.PROJECT-NAME_VERSION_MINOR": "Druhá komponenta čísla verze proměnné <PROJECT-NAME>_VERSION nastavená příkazem projektu",
	"assets/variables.json.PROJECT-NAME_VERSION_PATCH": "Třetí komponenta čísla verze proměnné <PROJECT-NAME>_VERSION nastavená příkazem projektu",
	"assets/variables.json.PROJECT-NAME_VERSION_TWEAK": "Čtvrtá komponenta čísla verze proměnné <PROJECT-NAME>_VERSION nastavená příkazem projektu",
	"assets/variables.json.PROJECT_BINARY_DIR": "Úplná cesta k adresáři sestavení pro projekt",
	"assets/variables.json.PROJECT_DESCRIPTION": "Krátký popis projektu daný příkazu projektu",
	"assets/variables.json.PROJECT_HOMEPAGE_URL": "Adresa URL domovské stránky projektu",
	"assets/variables.json.PROJECT_IS_TOP_LEVEL": "Logická proměnná označující, jestli poslední volaný příkaz projektu v aktuálním nebo vyšším oboru byl v souboru CMakeLists.txt nejvyšší úrovně.",
	"assets/variables.json.PROJECT_NAME": "Název projektu zadaný do příkazu projektu",
	"assets/variables.json.PROJECT_SOURCE_DIR": "Toto je zdrojový adresář posledního volání příkazu projektu vytvořeného v aktuálním oboru adresáře nebo v jednom z jeho nadřazených objektů. Poznámka: Není ovlivněn voláními do projektu vytvořenými v oboru podřízeného adresáře (tj. v rámci volání do add_subdirectory z aktuálního oboru).",
	"assets/variables.json.PROJECT_VERSION": "Hodnota zadaná pro možnost VERSION posledního volání příkazu projektu, pokud existuje.",
	"assets/variables.json.PROJECT_VERSION_MAJOR": "První komponenta čísla verze proměnné PROJECT_VERSION nastavená příkazem projektu",
	"assets/variables.json.PROJECT_VERSION_MINOR": "Druhá komponenta čísla verze proměnné PROJECT_VERSION nastavená příkazem projektu",
	"assets/variables.json.PROJECT_VERSION_PATCH": "Třetí komponenta čísla verze proměnné PROJECT_VERSION nastavená příkazem projektu",
	"assets/variables.json.PROJECT_VERSION_TWEAK": "Čtvrtá komponenta čísla verze proměnné PROJECT_VERSION nastavená příkazem projektu",
	"assets/variables.json.UNIX": "Nastavte na hodnotu True, pokud cílovým systémem je UNIX nebo na způsob UNIXu (např. APPLE a CYGWIN). Pokud jsou potřeba konkrétnější znalosti o cílovém systému, měl by se zadat dotaz na proměnnou CMAKE_SYSTEM_NAME.",
	"assets/variables.json.WIN32": "Když je cílovým systémem Windows, včetně Win64, nastavte tuto možnost na True.",
	"assets/variables.json.WINCE": "True, když je proměnná CMAKE_SYSTEM_NAME nastavená na WindowsCE",
	"assets/variables.json.WINDOWS_PHONE": "True, když je proměnná CMAKE_SYSTEM_NAME nastavená na WindowsPhone",
	"assets/variables.json.WINDOWS_STORE": "True, když je proměnná CMAKE_SYSTEM_NAME nastavená na WindowsStore",
	"assets/variables.json.XCODE": "True, když se používá generátor Xcode",
	"assets/variables.json.XCODE_VERSION": "Verze Xcode (jen generátor Xcode)",
	"assets/variables.json.ADVANCED": "Zadejte hodnotu True, pokud má být položka ve výchozím nastavení v GUI skrytá.",
	"assets/variables.json.HELPSTRING": "Nápověda k položce v rozhraních GUI",
	"assets/variables.json.MODIFIED": "Vlastnost vnitřní správy. Nenastavujte nebo nenačítejte ji.",
	"assets/variables.json.STRINGS": "Zobrazí výčet možných vstupních hodnot STRING (ŘETĚZEC) pro výběr grafického uživatelského rozhraní.",
	"assets/variables.json.TYPE": "Typ widgetu pro záznam v rozhraních GUI",
	"assets/variables.json.VALUE": "Hodnota položky mezipaměti",
	"assets/variables.json.ADDITIONAL_CLEAN_FILES": "Středníky oddělený seznam souborů nebo adresářů, který bude odebrán jako součást globálního cíle čištění. Je vhodný pro určení generovaných souborů nebo adresářů, které jsou používány více cíli nebo samotným nástrojem CMake, nebo které jsou generovány způsobem, který nelze zachytit jako výstupy nebo vedlejší produkty vlastních příkazů.",
	"assets/variables.json.ADDITIONAL_MAKE_CLEAN_FILES": "Další soubory k odebrání během fáze čištění",
	"assets/variables.json.BINARY_DIR": "Tato vlastnost adresáře jen pro čtení hlásí absolutní cestu k binárnímu adresáři odpovídajícímu zdroji, ve kterém se přečte.",
	"assets/variables.json.BUILDSYSTEM_TARGETS": "Tato vlastnost adresáře jen pro čtení obsahuje středníky oddělený seznam cílů sestavovacího systému přidaných do adresáře voláními příkazů add_library, add_executable a add_custom_target. Seznam nezahrnuje žádné importované cíle nebo cíle aliasu, ale zahrnuje knihovny rozhraní. Každá položka v seznamu je logický název cíle vhodný pro předání do parametru TARGET příkazu get_property.",
	"assets/variables.json.CACHE_VARIABLES": "Seznam proměnných mezipaměti dostupných v aktuálním adresáři",
	"assets/variables.json.CLEAN_NO_CUSTOM": "Nastavením na hodnotu true můžete určit, že generátory Makefile nemají odebírat výstupy vlastních příkazů pro tento adresář během operace čištění. Toto nastavení se u jiných generátorů ignoruje, protože ho není možné implementovat.",
	"assets/variables.json.CMAKE_CONFIGURE_DEPENDS": "Oznamte nástroji CMake další vstupní soubory pro proces konfigurace. Pokud se změní nějaký uvedený soubor, sestavovací systém znovu spustí CMake, aby se soubor překonfiguroval a znovu generoval sestavovací systém.",
	"assets/variables.json.COMPILE_DEFINITIONS": "Definice preprocesoru pro kompilování zdrojů adresáře",
	"assets/variables.json.COMPILE_DEFINITIONS_CONFIG": "Ignorováno. Viz zásada CMP0043 pro CMake.",
	"assets/variables.json.COMPILE_OPTIONS": "Seznam možností, které mají být předány kompilátoru",
	"assets/variables.json.DEFINITIONS": "Pouze z důvodů kompatibility s CMake 2.4. Místo toho použijte COMPILE_DEFINITIONS.",
	"assets/variables.json.EXCLUDE_FROM_ALL": "Nastavte tuto vlastnost adresáře na hodnotu true v podadresáři, aby se vyloučily jeho cíle z cíle „všechny“ jeho nadřazených prvků. Pokud jsou vyloučené, spuštění například v nadřazeném adresáři ve výchozím nastavení nevytvoří cíle v podadresáři. Toto nemá vliv na cíl „všechny“ samotného podadresáře. Spuštění například uvnitř podadresáře i tak vytvoří jeho cíle.",
	"assets/variables.json.IMPLICIT_DEPENDS_INCLUDE_TRANSFORM": "Umožňuje zadat transformace řádku #include pro závislosti v adresáři.",
	"assets/variables.json.IMPORTED_TARGETS": "Tato vlastnost adresáře jen pro čtení obsahuje středníky oddělený seznam importovaných cílů přidaných do adresáře voláními příkazů add_library a add_executable. Každá položka v seznamu je logický název cíle vhodný pro předání do možnosti TARGET příkazu get_property při volání ve stejném adresáři.",
	"assets/variables.json.INCLUDE_DIRECTORIES": "Seznam adresářů pro hledání souborů zahrnutí preprocesoru",
	"assets/variables.json.INCLUDE_REGULAR_EXPRESSION": "Umožňuje zahrnout regulární výraz pro skenování souborů.",
	"assets/variables.json.INTERPROCEDURAL_OPTIMIZATION": "Tato vlastnost adresáře již neexistuje.",
	"assets/variables.json.INTERPROCEDURAL_OPTIMIZATION_CONFIG": "Tato vlastnost adresáře již neexistuje.",
	"assets/variables.json.LABELS": "Zadejte seznam textových popisků přidružených k adresáři a všem jeho podadresářům. Toto odpovídá nastavení cílové vlastnosti LABELS (POPISKY) a vlastnosti testu LABELS u všech cílů a testů v aktuálním adresáři a podadresářích. Poznámka: Aby spouštěcí programy rozšířily popisky na cíle, musí být povolené.",
	"assets/variables.json.LINK_DIRECTORIES": "Seznam vyhledávacích adresářů propojovacího programu (linkeru)",
	"assets/variables.json.LINK_OPTIONS": "Seznam možností, které se mají použít pro krok propojení sdílené knihovny, modulu a spustitelného souboru jako cílů i pro krok propojení zařízení",
	"assets/variables.json.LISTFILE_STACK": "Aktuální zásobník zpracovávaných souborů seznamů",
	"assets/variables.json.MACROS": "Seznam příkazů makra dostupný v aktuálním adresáři",
	"assets/variables.json.PARENT_DIRECTORY": "Zdrojový adresář, který přidal aktuální podadresář",
	"assets/variables.json.RULE_LAUNCH_COMPILE": "Umožňuje zadat spouštěč pro pravidla kompilace.",
	"assets/variables.json.RULE_LAUNCH_CUSTOM": "Umožňuje zadat spouštěč pro vlastní pravidla.",
	"assets/variables.json.RULE_LAUNCH_LINK": "Umožňuje zadat spouštěč pro pravidla odkazů.",
	"assets/variables.json.SOURCE_DIR": "Tato vlastnost adresáře jen pro čtení hlásí absolutní cestu ke zdrojovému adresáři, ve kterém se přečte.",
	"assets/variables.json.SUBDIRECTORIES": "Tato vlastnost adresáře jen pro čtení obsahuje středníky oddělený seznam podadresářů doposud zpracovaných příkazy add_subdirectory nebo subdirs. Každá položka je absolutní cesta ke zdrojovému adresáři (obsahujícímu soubor CMakeLists.txt). Toto je vhodné předat do parametru DIRECTORY (ADRESÁŘ) příkazu get_property.",
	"assets/variables.json.SYSTEM": "Tato vlastnost adresáře slouží k inicializaci cílové vlastnosti SYSTEM pro neimportované cíle vytvořené v tomto adresáři. Nastaví se na hodnotu true příkazy add_subdirectory a FetchContent_Declare, pokud je možnost SYSTEM uvedená jako argument těchto příkazů.",
	"assets/variables.json.TESTS": "Seznam testů",
	"assets/variables.json.TEST_INCLUDE_FILE": "Zastaralé. Místo toho použijte TEST_INCLUDE_FILES.",
	"assets/variables.json.TEST_INCLUDE_FILES": "Seznam souborů cmake, které budou zahrnuty, když se spustí ctest",
	"assets/variables.json.VARIABLES": "Seznam proměnných definovaných v aktuálním adresáři",
	"assets/variables.json.VS_GLOBAL_SECTION_POST_section": "Zadejte globální oddíl postSolution v sadě Visual Studio.",
	"assets/variables.json.VS_GLOBAL_SECTION_PRE_section": "Zadejte globální oddíl preSolution v sadě Visual Studio.",
	"assets/variables.json.VS_STARTUP_PROJECT": "Zadejte výchozí spouštěný projekt v řešení sady Visual Studio.",
	"assets/variables.json.ALLOW_DUPLICATE_CUSTOM_TARGETS": "Povolí vytváření duplicitních vlastních cílů.",
	"assets/variables.json.AUTOGEN_SOURCE_GROUP": "Název source_group pro soubory generované funkcemi AUTOMOC, AUTORCC a AUTOUIC",
	"assets/variables.json.AUTOGEN_TARGETS_FOLDER": "Název parametru FOLDER pro cíle *_autogen, které CMake automaticky přidává pro cíle s povolenou možností AUTOMOC",
	"assets/variables.json.AUTOMOC_SOURCE_GROUP": "Název source_group pro vygenerované soubory AUTOMOC",
	"assets/variables.json.AUTOMOC_TARGETS_FOLDER": "Název parametru FOLDER pro cíle *_autogen, které CMake automaticky přidává pro cíle s povolenou možností AUTOMOC",
	"assets/variables.json.AUTORCC_SOURCE_GROUP": "Název source_group pro soubory generované autorcc",
	"assets/variables.json.AUTOUIC_SOURCE_GROUP": "Název source_group pro soubory generované funkcí AUTOUIC",
	"assets/variables.json.CMAKE_CUDA_KNOWN_FEATURES": "Seznam funkcí jazyka CUDA známých v této verzi nástroje CMake",
	"assets/variables.json.CMAKE_CXX_KNOWN_FEATURES": "Seznam funkcí jazyka C++ známých v této verzi nástroje CMake",
	"assets/variables.json.CMAKE_C_KNOWN_FEATURES": "Seznam funkcí jazyka C známých v této verzi nástroje CMake",
	"assets/variables.json.CMAKE_HIP_KNOWN_FEATURES": "Seznam funkcí HIP známých v této verzi nástroje CMake",
	"assets/variables.json.CMAKE_ROLE": "Sděluje, v jakém režimu je aktuální spuštěný skript. Může mít jednu z několika hodnot:",
	"assets/variables.json.DEBUG_CONFIGURATIONS": "Umožňuje zadat, které konfigurace jsou pro ladění.",
	"assets/variables.json.DISABLED_FEATURES": "Seznam funkcí, které jsou zakázané během doby, kdy je CMake spuštěný",
	"assets/variables.json.ECLIPSE_EXTRA_CPROJECT_CONTENTS": "Další obsah, který má být vložen do vygenerovaného souboru cproject Eclipse",
	"assets/variables.json.ECLIPSE_EXTRA_NATURES": "Seznam přirozených hodnot, které se mají přidat do vygenerovaného souboru projektu Eclipse",
	"assets/variables.json.ENABLED_FEATURES": "Seznam funkcí, které jsou povolené během doby, kdy je CMake spuštěný",
	"assets/variables.json.ENABLED_LANGUAGES": "Vlastnost jen pro čtení, která obsahuje seznam aktuálně povolených jazyků",
	"assets/variables.json.FIND_LIBRARY_USE_LIB32_PATHS": "Určuje, jestli by měl příkaz find_library automaticky hledat v adresářích lib32.",
	"assets/variables.json.FIND_LIBRARY_USE_LIB64_PATHS": "Určuje, jestli by měl příkaz find_library automaticky hledat v adresářích lib64.",
	"assets/variables.json.FIND_LIBRARY_USE_LIBX32_PATHS": "Určuje, jestli by měl příkaz find_library automaticky hledat v adresářích libx32.",
	"assets/variables.json.FIND_LIBRARY_USE_OPENBSD_VERSIONING": "Určuje, jestli by měl příkaz find_library vyhledat sdílené knihovny ve stylu OpenBSD.",
	"assets/variables.json.GENERATOR_IS_MULTI_CONFIG": "Vlastnost jen pro čtení, která je pravdivá u generátorů s více konfiguracemi",
	"assets/variables.json.GLOBAL_DEPENDS_DEBUG_MODE": "Umožňuje povolit režim ladění globálního cílového grafu závislosti.",
	"assets/variables.json.GLOBAL_DEPENDS_NO_CYCLES": "Umožňuje zakázat cykly globálního cílového grafu závislosti.",
	"assets/variables.json.INSTALL_PARALLEL": "Povolí možnost paralelní instalace pro generátor Ninja.",
	"assets/variables.json.IN_TRY_COMPILE": "Vlastnost jen pro čtení, která má hodnotu true při konfiguraci s pokusem o kompilaci",
	"assets/variables.json.JOB_POOLS": "Pouze Ninja: seznam dostupných fondů",
	"assets/variables.json.PACKAGES_FOUND": "Seznam balíčků, které se našly během doby, kdy byl CMake spuštěný",
	"assets/variables.json.PACKAGES_NOT_FOUND": "Seznam balíčků, které se nenašly během doby, kdy byl CMake spuštěný",
	"assets/variables.json.PREDEFINED_TARGETS_FOLDER": "Název FOLDER (SLOŽKY) pro cíle, které jsou automaticky přidávány nástroji CMake",
	"assets/variables.json.PROPAGATE_TOP_LEVEL_INCLUDES_TO_TRY_COMPILE": "Když je tato globální vlastnost nastavená na true, proměnná CMAKE_PROJECT_TOP_LEVEL_INCLUDES se rozšíří do volání try_compile, která používají podpis celého projektu. Na volání podpisu zdrojového souboru nemá tato vlastnost vliv. Vlastnost PROPAGATE_TOP_LEVEL_INCLUDES_TO_TRY_COMPILE je ve výchozím nastavení nenastavená.",
	"assets/variables.json.REPORT_UNDEFINED_PROPERTIES": "Pokud je možnost nastavená, budou se všechny nedefinované vlastnosti hlásit do tohoto souboru.",
	"assets/variables.json.RULE_MESSAGES": "Určete, jestli se má hlásit zpráva pro každé vytvářecí pravidlo.",
	"assets/variables.json.TARGET_ARCHIVES_MAY_BE_SHARED_LIBS": "Umožňuje nastavit, jestli je možné pojmenovat sdílené knihovny jako archivy.",
	"assets/variables.json.TARGET_MESSAGES": "Umožňuje zadat, jestli se má hlásit dokončení každého cíle.",
	"assets/variables.json.TARGET_SUPPORTS_SHARED_LIBS": "Podporuje cílová platforma sdílené knihovny.",
	"assets/variables.json.USE_FOLDERS": "Určuje, jestli se má použít cílová vlastnost FOLDER k uspořádání cílů do složek. Chování určuje hodnota USE_FOLDERS na konci souboru CMakeLists.txt nejvyšší úrovně.",
	"assets/variables.json.XCODE_EMIT_EFFECTIVE_PLATFORM_NAME": "Řídit generování EFFECTIVE_PLATFORM_NAME generátorem Xcode",
	"assets/variables.json.CPACK_DESKTOP_SHORTCUTS": "Určuje seznam názvů zástupců, které mají být vytvořeny na ploše pro tento soubor.",
	"assets/variables.json.CPACK_NEVER_OVERWRITE": "Vytvoří žádost, aby se tento soubor nepřepisoval při instalaci nebo přeinstalaci.",
	"assets/variables.json.CPACK_PERMANENT": "Vytvoří žádost, aby se tento soubor neodebíral při odinstalaci.",
	"assets/variables.json.CPACK_STARTUP_SHORTCUTS": "Určuje seznam názvů zástupců, které mají být vytvořeny ve složce Po spuštění pro tento soubor.",
	"assets/variables.json.CPACK_START_MENU_SHORTCUTS": "Určuje seznam názvů zástupců, které mají být vytvořeny v nabídce Start pro tento soubor.",
	"assets/variables.json.CPACK_WIX_ACL": "Určuje přístupová oprávnění k souborům nebo adresářům nainstalovaným instalační službou WiX.",
	"assets/variables.json.ABSTRACT": "Určuje, jestli tento zdrojový soubor je abstraktní třída.",
	"assets/variables.json.AUTORCC_OPTIONS": "Další možnosti pro rcc při použití AUTORCC",
	"assets/variables.json.AUTOUIC_OPTIONS": "Další možnosti pro uic při použití AUTOUIC",
	"assets/variables.json.COMPILE_FLAGS": "Další příznaky, které se mají přidat při kompilaci tohoto zdrojového souboru",
	"assets/variables.json.CXX_SCAN_FOR_MODULES": "CXX_SCAN_FOR_MODULES je logická hodnota určující, jestli CMake vyhledá ve zdroji závislosti modulu C++. Nastavení pro celý cíl najdete také v CXX_SCAN_FOR_MODULES.",
	"assets/variables.json.EXTERNAL_OBJECT": "Pokud je možnost nastavená na hodnotu true, pak jde o soubor objektu.",
	"assets/variables.json.Fortran_FORMAT": "Nastavením hodnoty FIXED nebo FREE můžete určit rozložení zdroje v jazyce Fortran.",
	"assets/variables.json.Fortran_PREPROCESS": "Řídí, jestli má být zdrojový soubor Fortran bezpodmínečně předzpracován.",
	"assets/variables.json.GENERATED": "Je tento zdrojový soubor vygenerovaný jako součást sestavení nebo procesu CMake.",
	"assets/variables.json.HEADER_FILE_ONLY": "Je tento zdrojový soubor jenom soubor hlavičky.",
	"assets/variables.json.KEEP_EXTENSION": "Umožňuje nastavit, aby výstupní soubor měl stejnou příponu jako zdrojový soubor.",
	"assets/variables.json.LANGUAGE": "Zadejte programovací jazyk, ve kterém je napsaný zdrojový soubor.",
	"assets/variables.json.LOCATION": "Úplná cesta ke zdrojovému souboru",
	"assets/variables.json.MACOSX_PACKAGE_LOCATION": "Umožňuje umístit zdrojový soubor uvnitř balíčku aplikace (MACOSX_BUNDLE), balíčku Foundation Core (BUNDLE) nebo balíčku architektury (FRAMEWORK). Platí pro macOS a iOS.",
	"assets/variables.json.OBJECT_DEPENDS": "Další soubory, na kterých závisí zkompilovaný soubor objektu",
	"assets/variables.json.OBJECT_OUTPUTS": "Další výstupy pro pravidlo generátorů Ninja nebo Makefile",
	"assets/variables.json.SKIP_AUTOGEN": "Umožňuje vyloučit zdrojový soubor ze zpracování AUTOMOC, AUTOUIC a AUTORCC (pro projekty Qt).",
	"assets/variables.json.SKIP_AUTOMOC": "Umožňuje vyloučit zdrojový soubor ze zpracování AUTOMOC (pro projekty Qt).",
	"assets/variables.json.SKIP_AUTORCC": "Umožňuje vyloučit zdrojový soubor ze zpracování AUTORCC (pro projekty Qt).",
	"assets/variables.json.SKIP_AUTOUIC": "Umožňuje vyloučit zdrojový soubor ze zpracování AUTOUIC (pro projekty Qt).",
	"assets/variables.json.SKIP_LINTING": "Tato vlastnost umožňuje vyloučit konkrétní zdrojový soubor z procesu lintování. Proces lintování zahrnuje spouštění nástrojů, jako jsou <LANG>_CPPLINT, <LANG>_CLANG_TIDY, <LANG>_CPPCHECK a <LANG>_INCLUDE_WHAT_YOU_USE na zdrojových souborech, a také kompilaci souborů hlaviček v rámci VERIFY_INTERFACE_HEADER_SETS. Nastavením SKIP_LINTING na zdrojovém souboru se uvedené nástroje pro lintování pro daný soubor nespustí.",
	"assets/variables.json.SKIP_PRECOMPILE_HEADERS": "Určuje, jestli tento zdrojový soubor funkce PRECOMPILE_HEADERS vynechává.",
	"assets/variables.json.SKIP_UNITY_BUILD_INCLUSION": "Nastavení této vlastnosti na hodnotu true zajišťuje, že sestavení unity vynechají zdrojový soubor v případě, že jeho přidružený cíl má vlastnost UNITY_BUILD nastavenou na hodnotu true. Zdrojový soubor se místo toho zkompiluje samostatně stejným způsobem jako se zakázanými sestaveními unity.",
	"assets/variables.json.Swift_DEPENDENCIES_FILE": "Tato vlastnost nastavuje cestu pro soubor závislosti Swift (swiftdeps) pro zdroj. Pokud není zadaná, bude výchozí <OBJECT>.swiftdeps.",
	"assets/variables.json.Swift_DIAGNOSTICS_FILE": "Tato vlastnost řídí, kde je serializována diagnostika Swift.",
	"assets/variables.json.SYMBOLIC": "Je to jen název pro pravidlo.",
	"assets/variables.json.UNITY_GROUP": "Tato vlastnost řídí, kterého bloku bude zdroj součástí, když je vlastnost UNITY_BUILD_MODE nastavená na hodnotu GROUP (SKUPINA).",
	"assets/variables.json.VS_COPY_TO_OUT_DIR": "Nastaví značku <CopyToOutputDirectory> pro zdrojový soubor v souboru projektu sady Visual Studio. Platné hodnoty jsou Never, Always a PreserveNewest.",
	"assets/variables.json.VS_CSHARP_tagname": "Konfigurace specifická pro konkrétní zdrojový soubor sady Visual Studio a CSharp",
	"assets/variables.json.VS_DEPLOYMENT_CONTENT": "Umožňuje označit zdrojový soubor jako obsah pro nasazení s aplikací pro Windows Phone nebo Windows Store, když se sestaví pomocí generátorů <cmake-generators(7)> sady Visual Studio. Hodnota musí být 1 nebo 0 a může používat výrazy generátoru <cmake-generator-expressions(7)> při rozhodování na základě konfigurace sestavení. Položka zdrojového souboru .vcxproj bude označena DeploymentContent nebo ExcludedFromBuild pro hodnoty 1 a 0 v uvedeném pořadí.",
	"assets/variables.json.VS_DEPLOYMENT_LOCATION": "Určuje umístění nasazení pro zdrojový soubor obsahu u aplikace pro Windows Phone nebo Windows Store, když se sestaví pomocí generátorů <cmake-generators(7)> sady Visual Studio. Tato vlastnost je použitelná jenom při použití možnosti VS_DEPLOYMENT_CONTENT. Hodnota představuje relativní cestu k balíčku aplikace a platí pro všechny konfigurace.",
	"assets/variables.json.VS_INCLUDE_IN_VSIX": "Logická vlastnost, která určuje, jestli se soubor má zahrnout do balíčku rozšíření VSIX (Visual Studio Integration Extension). Je potřebná při vývoji rozšíření sady Visual Studio.",
	"assets/variables.json.VS_RESOURCE_GENERATOR": "Tato vlastnost umožňuje zadat generátor prostředků, který se použije pro tento soubor. Pokud se nenastaví, výchozí možností je PublicResXFileCodeGenerator.",
	"assets/variables.json.VS_SETTINGS": "Nastaví metadata kterékoli položky v souboru.",
	"assets/variables.json.VS_SHADER_DISABLE_OPTIMIZATIONS": "Zakažte optimalizace kompilátoru pro zdrojový soubor .hlsl. Tím se do příkazového řádku přidá příznak -Od pro nástroj FxCompiler. Pokud chcete optimalizace kompilátoru zakázat, zadejte pro tuto vlastnost hodnotu true.",
	"assets/variables.json.VS_SHADER_ENABLE_DEBUG": "Povolte informace pro ladění pro zdrojový soubor .hlsl. Tím se do příkazového řádku přidá příznak -Zi pro nástroj FxCompiler. Pokud chcete pro zkompilovaný shader generovat informace o ladění, zadejte pro tuto vlastnost hodnotu true.",
	"assets/variables.json.VS_SHADER_ENTRYPOINT": "Určuje název vstupního bodu pro shader zdrojového souboru .hlsl.",
	"assets/variables.json.VS_SHADER_FLAGS": "Umožňuje nastavit další příznaky shaderu sady Visual Studio zdrojového souboru .hlsl.",
	"assets/variables.json.VS_SHADER_MODEL": "Určuje model shaderu zdrojového souboru .hlsl. Některé typy shaderů se dají použít jen s novějšími modely shaderů.",
	"assets/variables.json.VS_SHADER_OBJECT_FILE_NAME": "Určuje název souboru zkompilovaného souboru objektu shaderu pro zdrojový soubor .hlsl. Tato možnost přidá do příkazového řádku nástroje FxCompuler příznak -Fo.",
	"assets/variables.json.VS_SHADER_OUTPUT_HEADER_FILE": "Nastavte název souboru pro výstupní soubor hlaviček, který obsahuje objektový kód zdrojového souboru .hlsl.",
	"assets/variables.json.VS_SHADER_TYPE": "Umožňuje nastavit typ shaderu sady Visual Studio zdrojového souboru .hlsl.",
	"assets/variables.json.VS_SHADER_VARIABLE_NAME": "Nastavte název proměnné v souboru hlaviček, který obsahuje objektový kód zdrojového souboru .hlsl.",
	"assets/variables.json.VS_TOOL_OVERRIDE": "Přepište výchozí nástroj Visual Studio, který se použije pro zdrojový soubor, novým nástrojem, který se nezakládá na příponě souboru.",
	"assets/variables.json.VS_XAML_TYPE": "Označte zdrojový soubor XAML (Extensible Application Markup Language) jako jiný typ, než je výchozí typ Stránka. Nejběžnější použití by bylo nastavit výchozí soubor App.xaml na ApplicationDefinition.",
	"assets/variables.json.WRAP_EXCLUDE": "Vyloučit tento zdrojový soubor ze všech technik balení kódu",
	"assets/variables.json.XCODE_EXPLICIT_FILE_TYPE": "Nastavte atribut Xcode explicitFileType v jeho odkazu na zdrojový soubor. CMake vypočítá výchozí hodnotu podle přípony souboru, ale pomocí této vlastnosti je možné určit hodnotu explicitně.",
	"assets/variables.json.XCODE_FILE_ATTRIBUTES": "Přidejte hodnoty do nastavení Xcode ATTRIBUTES v jeho odkazu na zdrojový soubor. Kromě jiného se tato možnost dá použít k nastavení role v souboru .mig:",
	"assets/variables.json.XCODE_LAST_KNOWN_FILE_TYPE": "Nastavte atribut Xcode lastKnownFileType v jeho odkazu na zdrojový soubor. CMake vypočítá výchozí hodnotu podle přípony souboru, ale pomocí této vlastnosti je možné určit hodnotu explicitně.",
	"assets/variables.json.ATTACHED_FILES": "Připojí seznam souborů pro odeslání na řídicí panel.",
	"assets/variables.json.ATTACHED_FILES_ON_FAIL": "Připojí seznam souborů pro odeslání na řídicí panel v případě neúspěšného testu.",
	"assets/variables.json.COST": "Tato vlastnost popisuje náklady testu. Pokud je povoleno paralelní testování, testy v sadě testů budou spuštěny v sestupném pořadí podle nákladů. Projekty mohou explicitně definovat náklady testu nastavením této vlastnosti na hodnotu s pohyblivou desetinnou čárkou.",
	"assets/variables.json.DEPENDS": "Určuje, že tento test by se měl provést pouze po zadaném seznamu testů.",
	"assets/variables.json.DISABLED": "Pokud je možnost nastavená na hodnotu True, test bude přeskočen a jeho stav bude Nespuštěno. Test ve stavu DISABLED (ZAKÁZÁNO) se nebude počítat do celkového počtu testů a jeho stav dokončení se bude hlásit do CDash jako Zakázáno.",
	"assets/variables.json.ENVIRONMENT": "Umožňuje zadat proměnné prostředí, které by měly být definovány pro spuštění testu.",
	"assets/variables.json.ENVIRONMENT_MODIFICATION": "Zadejte proměnné prostředí, které by se měly upravit pro spuštění testu. Poznámka: Operace prováděné touto vlastností se provádějí až po zavedení vlastnosti ENVIRONMENT.",
	"assets/variables.json.FAIL_REGULAR_EXPRESSION": "Pokud se výstup testu (stdout nebo stderr) shoduje s tímto regulárním výrazem, test se nezdaří, a to bez ohledu na ukončovací kód procesu. Testy, které překročí časový limit určený parametrem TIMEOUT, selžou bez ohledu na FAIL_REGULAR_EXPRESSION. Při jakémkoli selhání testu s nenulovým návratovým kódem nebo selhání testu na úrovni systému, včetně chyb segmentace, přerušení signálu nebo chyb haldy, test selže, i když regulární výraz neodpovídá.",
	"assets/variables.json.FIXTURES_CLEANUP": "Určuje seznam testovacích přípravků, u kterých se má test považovat za čisticí test. Názvy těchto testovacích přípravků se liší od názvů testovacích případů a nemusí být nijak podobné názvům testů, které jsou k nim přidružené.",
	"assets/variables.json.FIXTURES_REQUIRED": "Určuje seznam testovacích přípravků, které test vyžaduje. V názvech testovacích přípravků se rozlišují malá a velká písmena a nemusí být nijak podobné názvům testů.",
	"assets/variables.json.FIXTURES_SETUP": "Určuje seznam testovacích přípravků, u kterých se má test považovat za nastavovací test. Názvy těchto testovacích přípravků se liší od názvů testovacích případů a nemusí být nijak podobné názvům testů, které jsou k nim přidružené.",
	"assets/variables.json.GENERATED_RESOURCE_SPEC_FILE": "Cesta k dynamicky generovanému souboru specifikace prostředku <ctest-resource-dynamically-generated-spec-file> vygenerovaný tímto testem.",
	"assets/variables.json.MEASUREMENT": "Umožňuje určit měření a hodnotu CDASH, které se mají hlásit pro test.",
	"assets/variables.json.PASS_REGULAR_EXPRESSION": "Výstup testu (stdout nebo stderr) se musí shodovat s tímto regulárním výrazem, aby byl test úspěšný. Ukončovací kód procesu je ignorován. Testy, které překročí časový limit určený parametrem TIMEOUT, selžou bez ohledu na PASS_REGULAR_EXPRESSION. Selhání testu na úrovni systému, včetně chyb segmentace, přerušení signálu nebo chyb haldy, může vést k selhání testu, a to i v případě shody s PASS_REGULAR_EXPRESSION.",
	"assets/variables.json.PROCESSORS": "Nastavením této možnosti určíte, kolik slotů procesů tento test vyžaduje. Pokud není možnost nastavená, je výchozí hodnota 1 procesor.",
	"assets/variables.json.PROCESSOR_AFFINITY": "Když je nastavená na hodnotu true, požádá CTest, aby spustil testovací proces se spřažením procesorů pro pevnou sadu procesorů. Pokud je možnost povolená a podporovaná pro aktuální platformu, zvolí CTest sadu procesorů, které umístí do masky spřažení procesorů při spouštění testovacího procesu. Počet procesorů v sadě je určený vlastností testu PROCESSORS nebo počtem procesorů dostupných CTestu, podle toho, co je menší. Sada zvolených procesorů bude oddělená od procesorů přiřazených jiným souběžně spuštěným testům, které mají také povolenou vlastnost PROCESSOR_AFFINITY.",
	"assets/variables.json.REQUIRED_FILES": "Seznam souborů potřebných ke spuštění testu. Názvy souborů jsou relativní k testovacímu WORKING_DIRECTORY, pokud není zadána absolutní cesta.",
	"assets/variables.json.RESOURCE_GROUPS": "Zadejte prostředky požadované testem seskupené způsobem, který je pro test smysluplný. Další informace o tom, jak se tato vlastnost integruje do funkce přidělování prostředků CTest, najdete v <ctest-resource-allocation> přidělování prostředků.",
	"assets/variables.json.RESOURCE_LOCK": "Umožňuje zadat seznam prostředků, které jsou tímto testem zamknuté.",
	"assets/variables.json.RUN_SERIAL": "Nespouštějte tento test souběžně s žádným jiným testem.",
	"assets/variables.json.SKIP_REGULAR_EXPRESSION": "Pokud se výstup testu (stderr nebo stdout) shoduje s tímto regulárním výrazem, bude test bez ohledu na ukončovací kód procesu označen jako přeskočený. Testy, které překročí časový limit určený parametrem TIMEOUT, selžou bez ohledu na SKIP_REGULAR_EXPRESSION. Selhání testu na úrovni systému, včetně chyb segmentace, přerušení signálu nebo chyb haldy, může vést k selhání testu, a to i v případě shody regulárního výrazu.",
	"assets/variables.json.SKIP_RETURN_CODE": "Návratový kód k označení testu jako přeskočeného",
	"assets/variables.json.TIMEOUT": "Počet sekund povolený pro tento test",
	"assets/variables.json.TIMEOUT_AFTER_MATCH": "Umožňuje změnit časový limit testu po zjištění odpovídajícího řádku v jeho výstupu.",
	"assets/variables.json.TIMEOUT_SIGNAL_GRACE_PERIOD": "Pokud je nastavená vlastnost testu TIMEOUT_SIGNAL_NAME, určuje tato vlastnost počet sekund, po které se má čekat na ukončení testovacího procesu po odeslání vlastního signálu. Jinak tato vlastnost nemá žádný význam.",
	"assets/variables.json.TIMEOUT_SIGNAL_NAME": "Zadejte vlastní signál, který se odešle do testovacího procesu při dosažení časového limitu. Tato možnost je dostupná jenom na platformách podporujících signály POSIX. Není k dispozici ve Windows.",
	"assets/variables.json.WILL_FAIL": "Pokud je true, invertuje kritéria úspěšnosti/neúspěšnosti testu. Testy, pro které je WILL_FAIL true, budou neúspěšné s návratovým kódem 0 a úspěšné s nenulovým návratovým kódem. Testy, které překročí časový limit určený parametrem TIMEOUT, selžou bez ohledu na WILL_FAIL. Selhání testu na úrovni systému, včetně chyb segmentace, přerušení signálu nebo chyb haldy, může vést k selhání testu, a to i v případě, že WILL_FAIL je true.",
	"assets/variables.json.WORKING_DIRECTORY": "Adresář, ze kterého se zavolá spustitelný soubor testu",
	"assets/variables.json.AIX_EXPORT_ALL_SYMBOLS": "V systému AIX CMake automaticky exportuje všechny symboly ze sdílených knihoven a ze spustitelných souborů s nastavenou cílovou vlastností ENABLE_EXPORTS. Když explicitně vypnete tuto logickou vlastnost, ve výchozím nastavení se potlačí toto chování a neexportují se žádné symboly. V tomto případě se očekává, že projekt použije jiné prostředky k exportu některých symbolů.",
	"assets/variables.json.ALIASED_TARGET": "Název cíle, pro který se jako alias používá tento cíl",
	"assets/variables.json.ALIAS_GLOBAL": "Vlastnost jen pro čtení, která označuje, jestli je cíl ALIAS globálně viditelný",
	"assets/variables.json.ANDROID_ANT_ADDITIONAL_OPTIONS": "Umožňuje nastavit další možnosti pro sestavovací systém Android Ant. Jde o řetězcovou hodnotu obsahující všechny možnosti příkazového řádku pro sestavení Ant. Tato vlastnost se inicializuje hodnotou proměnné CMAKE_ANDROID_ANT_ADDITIONAL_OPTIONS, pokud je nastavená při vytváření cíle.",
	"assets/variables.json.ANDROID_API": "Když se provádí křížová kompilace pro Android pomocí NVIDIA Nsight Tegra Visual Studio Edition, nastavuje tato vlastnost verzi cílového rozhraní API pro Android (například 15). Číslo verze musí být celé kladné číslo v desítkové soustavě. Tato vlastnost se inicializuje hodnotou proměnné CMAKE_ANDROID_API, pokud je nastavená při vytváření cíle.",
	"assets/variables.json.ANDROID_API_MIN": "Umožňuje nastavit minimální verzi rozhraní API pro Android (například 9). Číslo verze musí být celé kladné číslo v desítkové soustavě. Tato vlastnost se inicializuje hodnotou proměnné CMAKE_ANDROID_API_MIN, pokud je nastavená při vytváření cíle. Pomocí této verze rozhraní API se sestavuje nativní kód.",
	"assets/variables.json.ANDROID_ARCH": "Když se provádí křížová kompilace pro Android pomocí NVIDIA Nsight Tegra Visual Studio Edition, nastavuje tato vlastnost cílovou architekturu Androidu.",
	"assets/variables.json.ANDROID_ASSETS_DIRECTORIES": "Umožňuje nastavit adresář prostředků pro Android, který se má zkopírovat do hlavní složky s prostředky před sestavením. Jde o řetězcovou vlastnost obsahující cesty k adresářům oddělené středníky. Tato vlastnost se inicializuje hodnotou proměnné CMAKE_ANDROID_ASSETS_DIRECTORIES, pokud je nastavená při vytváření cíle.",
	"assets/variables.json.ANDROID_GUI": "Když se provádí křížová kompilace pro Android pomocí NVIDIA Nsight Tegra Visual Studio Edition, tato vlastnost určuje, jestli se má sestavit spustitelný soubor jako balíček aplikace pro Android.",
	"assets/variables.json.ANDROID_JAR_DEPENDENCIES": "Umožňuje nastavit vlastnost pro Android, která určuje závislosti souborů JAR. Jde o vlastnost s řetězcovou hodnotou. Tuto vlastnost inicializuje hodnota proměnné CMAKE_ANDROID_JAR_DEPENDENCIES, pokud je nastavená při vytváření cíle.",
	"assets/variables.json.ANDROID_JAR_DIRECTORIES": "Umožňuje nastavit vlastnost pro Android, která určuje adresáře, ve kterých se mají hledat knihovny JAR.",
	"assets/variables.json.ANDROID_JAVA_SOURCE_DIR": "Umožňuje nastavit vlastnost pro Android, která definuje kořenové adresáře se zdrojovým kódem v Javě. Jde o řetězcovou vlastnost obsahující cesty k adresářům oddělené středníky. Tato vlastnost se inicializuje hodnotou proměnné CMAKE_ANDROID_JAVA_SOURCE_DIR, pokud je nastavená při vytváření cíle.",
	"assets/variables.json.ANDROID_NATIVE_LIB_DEPENDENCIES": "Umožňuje nastavit vlastnost pro Android, která určuje závislosti souborů .so. Jde o řetězcovou vlastnost.",
	"assets/variables.json.ANDROID_NATIVE_LIB_DIRECTORIES": "Umožňuje nastavit vlastnost pro Android, která určuje adresáře, ve kterých se mají hledat knihovny .so.",
	"assets/variables.json.ANDROID_PROCESS_MAX": "Umožňuje nastavit vlastnost pro Android, která definuje maximální počet paralelních procesů kompilátoru NDK (například 4). Tato vlastnost se inicializuje hodnotou proměnné CMAKE_ANDROID_PROCESS_MAX, pokud je nastavená při vytváření cíle.",
	"assets/variables.json.ANDROID_PROGUARD": "Pokud je tato vlastnost nastavená na hodnotu true, může nástroj ProGuard zmenšovat, optimalizovat a obfuskovat kód odebíráním nepoužívaného kódu a přejmenováváním tříd, polí a metod se sémanticky nejasnými názvy. Tato vlastnost se inicializuje hodnotou proměnné CMAKE_ANDROID_PROGUARD, pokud je nastavená při vytváření cíle.",
	"assets/variables.json.ANDROID_PROGUARD_CONFIG_PATH": "Umožňuje nastavit vlastnost pro Android, která určuje umístění konfiguračního souboru ProGuard. Pokud chcete použít výchozí umístění, nechejte hodnotu prázdnou. Jde o řetězcovou vlastnost obsahující cestu ke konfiguračnímu souboru ProGuard. Tuto vlastnost inicializuje hodnota proměnné CMAKE_ANDROID_PROGUARD_CONFIG_PATH, pokud je nastavená při vytváření cíle.",
	"assets/variables.json.ANDROID_SECURE_PROPS_PATH": "Umožňuje nastavit vlastnost pro Android, která uvádí umístěná souboru zabezpečených vlastností. Jde o řetězcovou vlastnost obsahující cestu k souboru. Tuto vlastnost inicializuje hodnota proměnné CMAKE_ANDROID_SECURE_PROPS_PATH, pokud je nastavená při vytváření cíle.",
	"assets/variables.json.ANDROID_SKIP_ANT_STEP": "Umožňuje nastavit vlastnost pro Android, která definuje, jestli se má nebo nemá přeskočit krok sestavení Ant. Jde o logickou hodnotu inicializovanou hodnotou proměnné CMAKE_ANDROID_SKIP_ANT_STEP, pokud je nastavená při vytváření cíle.",
	"assets/variables.json.ANDROID_STL_TYPE": "Když se provádí křížová kompilace pro Android pomocí NVIDIA Nsight Tegra Visual Studio Edition, tato vlastnost určuje typ podpory STL pro projekt. Jde o řetězcovou vlastnost, kterou je možné nastavit na jednu z následujících hodnot:",
	"assets/variables.json.ARCHIVE_OUTPUT_DIRECTORY": "Výstupní adresář, ve kterém se mají sestavit cílové soubory XXX",
	"assets/variables.json.ARCHIVE_OUTPUT_DIRECTORY_CONFIG": "Výstupní podadresář pro jednotlivé konfigurace pro cílové soubory typu ARCHIVE",
	"assets/variables.json.ARCHIVE_OUTPUT_NAME": "Název výstupu pro cílové soubory XXX",
	"assets/variables.json.ARCHIVE_OUTPUT_NAME_CONFIG": "Název výstupu pro jednotlivé konfigurace pro cílové soubory typu ARCHIVE",
	"assets/variables.json.AUTOGEN_BETTER_GRAPH_MULTI_CONFIG": "AUTOGEN_BETTER_GRAPH_MULTI_CONFIG je logická vlastnost, kterou lze v cíli nastavit tak, aby měla lepší graf závislostí pro generátory s více konfiguracemi. Když se tato vlastnost povolí, CMake vygeneruje více cílů pro jednotlivé konfigurace. Graf závislostí tak bude pro generátory s více konfiguracemi přesnější a předejde se některým opětovným kompilacím.",
	"assets/variables.json.AUTOGEN_BUILD_DIR": "Adresář, kde AUTOMOC, AUTOUIC a AUTORCC generují soubory pro cíl",
	"assets/variables.json.AUTOGEN_COMMAND_LINE_LENGTH_MAX": "Omezení délky příkazového řádku pro cíle autogen, tj. moc nebo uic, které aktivuje použití souborů odpovědí v systému Windows namísto předávání všech argumentů na příkazovém řádku.",
	"assets/variables.json.AUTOGEN_ORIGIN_DEPENDS": "Přepínač pro předávání závislostí cíle původu příslušnému cíli <ORIGIN>_autogen",
	"assets/variables.json.AUTOGEN_PARALLEL": "Počet paralelních procesů moc nebo uic, které se mají spustit při použití možností AUTOMOC a AUTOUIC",
	"assets/variables.json.AUTOGEN_TARGET_DEPENDS": "Další závislosti na cíli odpovídajícího cíle <ORIGIN>_autogen",
	"assets/variables.json.AUTOGEN_USE_SYSTEM_INCLUDE": "AUTOGEN_USE_SYSTEM_INCLUDE je logická vlastnost, která se dá nastavit v cíli, aby bylo zřejmé, že by se měl do cíle přidat adresář zahrnutí cíle automatického generování jako systémový adresář pro zahrnutí nebo normální adresář pro zahrnutí.",
	"assets/variables.json.AUTOMOC": "Určuje, jestli se má cíl zpracovat pomocí funkce auto-moc (pro projekty Qt).",
	"assets/variables.json.AUTOMOC_COMPILER_PREDEFINES": "Logická hodnota, kterou AUTOMOC používá k určení, jestli by se měl generovat soubor předběžných definic kompilátoru moc_predefs.h",
	"assets/variables.json.AUTOMOC_DEPEND_FILTERS": "Definice filtrů, které AUTOMOC používá k extrahování názvů souborů ze zdrojového souboru, které jsou registrované jako další závislosti pro soubor moc zdrojového souboru",
	"assets/variables.json.AUTOMOC_EXECUTABLE": "AUTOMOC_EXECUTABLE je cesta k souboru, která odkazuje na spustitelný soubor moc, který se má použít pro soubory s povolenou funkcí AUTOMOC. Nastavení této vlastnosti způsobí, že CMake přeskočí automatické zjišťování binárního souboru moc i testů logičnosti, které se obvykle spouští, aby bylo zajištěno, že je binární soubor k dispozici a funguje podle očekávání.",
	"assets/variables.json.AUTOMOC_MACRO_NAMES": "Středníky oddělený seznam názvů maker, který AUTOMOC používá k určení, jestli moc musí zpracovat soubor C++.",
	"assets/variables.json.AUTOMOC_MOC_OPTIONS": "Další možnosti pro moc při použití AUTOMOC",
	"assets/variables.json.AUTOMOC_PATH_PREFIX": "Pokud je tato vlastnost zapnutá, CMake vygeneruje předponový parametr cesty -p pro funkci moc na cílech Qt s povolenou funkcí AUTOMOC.",
	"assets/variables.json.AUTORCC": "Určuje, jestli se má cíl zpracovat pomocí funkce auto-rcc (pro projekty Qt).",
	"assets/variables.json.AUTORCC_EXECUTABLE": "AUTORCC_EXECUTABLE je cesta k souboru, která odkazuje na spustitelný soubor rcc, který se má použít pro soubory s povolenou funkcí AUTORCC. Nastavení této vlastnosti způsobí, že CMake přeskočí automatické zjišťování binárního souboru rcc i testů logičnosti, které se obvykle spouští, aby bylo zajištěno, že je binární soubor k dispozici a funguje podle očekávání.",
	"assets/variables.json.AUTOUIC": "Určuje, jestli se má cíl zpracovat pomocí funkce auto-uic (pro projekty Qt).",
	"assets/variables.json.AUTOUIC_EXECUTABLE": "AUTOUIC_EXECUTABLE je cesta k souboru, která odkazuje na spustitelný soubor uic, který se má použít pro soubory s povolenou funkcí AUTOUIC. Nastavení této vlastnosti způsobí, že CMake přeskočí automatické zjišťování binárního souboru uic i testů logičnosti, které se obvykle spouští, aby bylo zajištěno, že je binární soubor k dispozici a funguje podle očekávání.",
	"assets/variables.json.AUTOUIC_SEARCH_PATHS": "Seznam cest pro vyhledávání, které AUTOUIC používá k hledání zahrnutých souborů .ui",
	"assets/variables.json.BUILD_RPATH": "Středníky oddělený seznam určující položky cesty modulu runtime (RPATH), které se mají přidat do binárních souborů propojených ve stromu sestavení (pro platformy, které to podporují). Ve výchozím nastavení CMake nastaví cestu modulu runtime binárních souborů ve stromu sestavení tak, aby obsahovala cesty hledání, o kterých ví, že jsou potřeba k nalezení sdílených knihoven, které propojují. Projekty mohou nastavit BUILD_RPATH a zadat další cesty hledání.",
	"assets/variables.json.BUILD_RPATH_USE_ORIGIN": "Určuje, jestli se mají použít relativní cesty pro parametr RPATH sestavení.",
	"assets/variables.json.BUILD_WITH_INSTALL_NAME_DIR": "BUILD_WITH_INSTALL_NAME_DIR je logická hodnota určující, jestli install_name cíle v macOS ve stromu sestavení používá adresář určený vlastností INSTALL_NAME_DIR. Toto nastavení platí jenom pro cíle v macOS.",
	"assets/variables.json.BUILD_WITH_INSTALL_RPATH": "BUILD_WITH_INSTALL_RPATH je logická hodnota určující, jestli se má cíl ve stromu sestavení propojit s cestou INSTALL_RPATH. Toto nastavení má přednost před nastavením SKIP_BUILD_RPATH a umožňuje vyhnout se před instalací opakovanému propojení.",
	"assets/variables.json.BUNDLE": "Tento cíl je CFBundle v macOS.",
	"assets/variables.json.BUNDLE_EXTENSION": "Přípona souboru, která se má použít k pojmenování cílů typu BUNDLE, FRAMEWORK nebo MACOSX_BUNDLE v systémech macOS a iOS",
	"assets/variables.json.COMMON_LANGUAGE_RUNTIME": "Nastavením této cílové vlastnosti nakonfigurujete cíl na sestavení s podporou C++/CLI.",
	"assets/variables.json.COMPATIBLE_INTERFACE_BOOL": "Vlastnosti, které musí být kompatibilní se svým rozhraním propojení",
	"assets/variables.json.COMPATIBLE_INTERFACE_NUMBER_MAX": "Vlastnosti, u kterých se použije maximální hodnota z propojovacího rozhraní",
	"assets/variables.json.COMPATIBLE_INTERFACE_NUMBER_MIN": "Vlastnosti, u kterých se použije minimální hodnota z propojovacího rozhraní.",
	"assets/variables.json.COMPATIBLE_INTERFACE_STRING": "Vlastnosti, které musí mít kompatibilní řetězec se svým rozhraním propojení",
	"assets/variables.json.COMPILE_FEATURES": "Funkce kompilátoru povolené pro tento cíl",
	"assets/variables.json.COMPILE_PDB_NAME": "Výstupní název pro soubor .pdb symbolu ladění MS vygenerovaný kompilátorem při sestavování zdrojových souborů",
	"assets/variables.json.COMPILE_PDB_NAME_CONFIG": "Výstupní název podle konfigurace pro soubor .pdb symbolu ladění MS vygenerovaný kompilátorem při sestavování zdrojových souborů",
	"assets/variables.json.COMPILE_PDB_OUTPUT_DIRECTORY": "Výstupní adresář pro soubor .pdb symbolu ladění MS vygenerovaný kompilátorem při sestavování zdrojových souborů",
	"assets/variables.json.COMPILE_PDB_OUTPUT_DIRECTORY_CONFIG": "Výstupní adresář podle konfigurace pro soubor .pdb symbolu ladění MS vygenerovaný kompilátorem při sestavování zdrojových souborů",
	"assets/variables.json.COMPILE_WARNING_AS_ERROR": "Určete, jestli se mají upozornění při kompilaci zpracovávat jako chyby. Pokud je tato možnost povolená, přidá se příznak pro zpracování upozornění při kompilaci jako chyby. Pokud je na příkazovém řádku cmake zadána možnost cmake --compile-no-warning-as-error, bude tato vlastnost ignorována.",
	"assets/variables.json.CONFIG_OUTPUT_NAME": "Starý základní název cílového souboru podle konfigurace. Místo toho použijte OUTPUT_NAME_.",
	"assets/variables.json.CONFIG_POSTFIX": "Přípona k připojení za název cílového souboru pro konfiguraci <CONFIG>",
	"assets/variables.json.CROSSCOMPILING_EMULATOR": "Použije daný emulátor ke spouštění spustitelných souborů vytvořených při křížovém kompilování. Tento příkaz se přidá jako předpona k příkazům add_test, add_custom_command a add_custom_target pro sestavené cílové spustitelné soubory systému.",
	"assets/variables.json.CUDA_ARCHITECTURES": "Seznam architektur, pro které se má generovat kód zařízení",
	"assets/variables.json.CUDA_CUBIN_COMPILATION": "Zkompilujte zdroje CUDA do souborů .cubin namísto souborů .obj v knihovnách objektů.",
	"assets/variables.json.CUDA_EXTENSIONS": "Logická hodnota určující, jestli se vyžadují rozšíření specifická pro kompilátor",
	"assets/variables.json.CUDA_FATBIN_COMPILATION": "Zkompilujte zdroje CUDA do souborů .fatbin namísto souborů .obj v knihovnách objektů.",
	"assets/variables.json.CUDA_OPTIX_COMPILATION": "Zkompiluje zdroje CUDA do souborů .optixir namísto souborů .obj v knihovnách objektů.",
	"assets/variables.json.CUDA_PTX_COMPILATION": "Zkompiluje zdroje CUDA do souborů .ptx namísto souborů .obj v knihovnách objektů.",
	"assets/variables.json.CUDA_RESOLVE_DEVICE_SYMBOLS": "Jenom CUDA: Povolí propojení zařízení pro konkrétní cíl knihovny v případě potřeby.",
	"assets/variables.json.CUDA_RUNTIME_LIBRARY": "Umožňuje vybrat knihovnu runtime CUDA pro použití kompilátory, které cílí na jazyk CUDA.",
	"assets/variables.json.CUDA_SEPARABLE_COMPILATION": "Jenom CUDA: Povolí oddělenou kompilaci kódu zařízení.",
	"assets/variables.json.CUDA_STANDARD": "Standard CUDA/C++, jehož funkce se vyžadují k sestavení tohoto cíle",
	"assets/variables.json.CUDA_STANDARD_REQUIRED": "Logická hodnota popisující, jestli je hodnota CUDA_STANDARD požadavek",
	"assets/variables.json.CXX_EXTENSIONS": "Logická hodnota určující, jestli se vyžadují rozšíření specifická pro kompilátor",
	"assets/variables.json.CXX_MODULE_DIRS": "Středníky oddělený seznam základních adresářů výchozí sady modulů C++ cíle (tj. sada souborů s názvem a typem CXX_MODULES). Vlastnost podporuje výrazy generátoru <cmake-generator-expressions(7)>.",
	"assets/variables.json.CXX_MODULE_DIRS_NAME": "Středníky oddělený seznam základních adresářů sady modulů <NAME> C++, který má nastavený typ CXX_MODULES. Vlastnost podporuje výrazy generátoru <cmake-generator-expressions(7)>.",
	"assets/variables.json.CXX_MODULE_SET": "Středníky oddělený seznam souborů ve výchozí sadě modulů C++ cíle (tj. sada souborů s názvem a typem CXX_MODULES). Pokud jsou některé cesty relativní, počítají se relativně ke zdrojovému adresáři cíle. Vlastnost podporuje výrazy generátoru <cmake-generator-expressions(7)>.",
	"assets/variables.json.CXX_MODULE_SETS": "Seznam sad modulů PRIVATE a PUBLIC C++ cíle jen pro čtení (tj. všechny sady souborů s typem CXX_MODULES). Soubory uvedené v těchto sadách souborů jsou pro účely integrace integrovaného vývojového prostředí považovány za zdrojové soubory.",
	"assets/variables.json.CXX_MODULE_SET_NAME": "Středníky oddělený seznam souborů v sadě modulů <NAME> C++, který má nastavený typ CXX_MODULES. Pokud jsou některé cesty relativní, počítají se relativně ke zdrojovému adresáři cíle. Vlastnost podporuje výrazy generátoru <cmake-generator-expressions(7)>.",
	"assets/variables.json.CXX_MODULE_STD": "CXX_MODULE_STD je logická hodnota určující, jestli cíl může používat import std, jeho zdroje C++, nebo ne.",
	"assets/variables.json.CXX_STANDARD": "Standard C++, jehož funkce se vyžadují k sestavení tohoto cíle",
	"assets/variables.json.CXX_STANDARD_REQUIRED": "Logická hodnota popisující, jestli je hodnota CXX_STANDARD požadavek",
	"assets/variables.json.C_EXTENSIONS": "Logická hodnota určující, jestli se vyžadují rozšíření specifická pro kompilátor",
	"assets/variables.json.C_STANDARD": "Standard jazyka C, jehož funkce jsou potřebné k sestavení tohoto cíle",
	"assets/variables.json.C_STANDARD_REQUIRED": "Logická hodnota popisující, jestli se vyžaduje hodnota C_STANDARD",
	"assets/variables.json.DEBUG_POSTFIX": "Viz cílová vlastnost <CONFIG>_POSTFIX.",
	"assets/variables.json.DEFINE_SYMBOL": "Definuje symbol při kompilaci zdrojů tohoto cíle.",
	"assets/variables.json.DEPLOYMENT_ADDITIONAL_FILES": "Umožňuje nastavit AdditionalFiles projektu WinCE v hodnotě DeploymentTool v souborech .vcproj vygenerovaných generátory sady Visual Studio. To je užitečné, když chcete ladit kód na vzdáleném zařízení WinCE. Zadejte další soubory, které budou zkopírovány do zařízení. Příklad:",
	"assets/variables.json.DEPLOYMENT_REMOTE_DIRECTORY": "Umožňuje nastavit RemoteDirectory projektu WinCE v hodnotách DeploymentTool a RemoteExecutable v nástroji DebugerTool v souborech .vcproj vygenerovaných generátory sady Visual Studio. To je užitečné, když chcete ladit kód na vzdáleném zařízení WinCE. Příklad:",
	"assets/variables.json.DEPRECATION": "Zpráva o zastaralosti od vývojáře importovaného cíle",
	"assets/variables.json.DISABLE_PRECOMPILE_HEADERS": "Zakáže předkompilaci souborů hlaviček určených vlastností PRECOMPILE_HEADERS.",
	"assets/variables.json.DLL_NAME_WITH_SOVERSION": "Tato vlastnost určuje, jestli se cílová vlastnost SOVERSION přidá do názvu souboru vygenerovaných názvů souborů DLL pro platformu Windows, která je vybrána při nastavení proměnné WIN32.",
	"assets/variables.json.DOTNET_SDK": "Zadejte sadu .NET SDK pro projekty jazyka C#. Příklad: Microsoft.NET.Sdk.",
	"assets/variables.json.DOTNET_TARGET_FRAMEWORK": "Zadejte cílovou architekturu .NET.",
	"assets/variables.json.DOTNET_TARGET_FRAMEWORK_VERSION": "Zadejte verzi cílové architektury .NET.",
	"assets/variables.json.EchoString": "Zpráva, která se má zobrazit, když se sestaví cíl",
	"assets/variables.json.ENABLE_EXPORTS": "Určete, jestli spustitelný soubor nebo sdílená knihovna exportuje symboly.",
	"assets/variables.json.EXCLUDE_FROM_DEFAULT_BUILD": "Umožňuje vyloučit cíl z operace Sestavit řešení.",
	"assets/variables.json.EXCLUDE_FROM_DEFAULT_BUILD_CONFIG": "Verze vyloučení cíle podle konfigurace z operace Sestavit řešení",
	"assets/variables.json.EXPORT_COMPILE_COMMANDS": "Povolit nebo zakázat výstup příkazů kompilace během generování pro cíl",
	"assets/variables.json.EXPORT_FIND_PACKAGE_NAME": "Určuje název balíčku přidružený k cíli závislosti při exportu volání find_dependency v instalaci nebo exportu. Dá se použít k přiřazení názvu balíčku k balíčku, který je sestaven nástrojem CMake a exportován, nebo k přepsání balíčku ve volání find_package, které vytvořilo cíl.",
	"assets/variables.json.EXPORT_NAME": "Exportovaný název pro cílové soubory",
	"assets/variables.json.EXPORT_NO_SYSTEM": "Tato vlastnost má vliv na chování příkazů pro instalaci a export při instalaci nebo exportu cíle. Když je hodnota EXPORT_NO_SYSTEM nastavená na true, vygenerují tyto příkazy importovaný cíl s vlastností SYSTEM nastavenou na false.",
	"assets/variables.json.EXPORT_PROPERTIES": "Zobrazí seznam dalších vlastností k exportu pro cíl.",
	"assets/variables.json.FOLDER": "U integrovaných vývojových prostředí, která prezentují cíle pomocí hierarchie složek, tato vlastnost určuje název složky, do které se má cíl umístit. Pokud chcete vnořit složky, použijte hodnoty FOLDER, například grafické uživatelské rozhraní nebo dialogy, se znaky oddělujícími úrovně složek. Cíle bez vlastnosti FOLDER se zobrazí jako entity nejvyšší úrovně. Cíle se stejnou hodnotou vlastnosti FOLDER se zobrazí ve stejné složce jako na stejné úrovni.",
	"assets/variables.json.Fortran_BUILDING_INSTRINSIC_MODULES": "Dá preprocesoru CMake Fortran informaci, že cíl sestavuje vnitřní funkce Fortranu pro sestavení kompilátoru Fortranu.",
	"assets/variables.json.Fortran_MODULE_DIRECTORY": "Umožňuje zadat výstupní adresář pro moduly Fortran poskytnuté cílem.",
	"assets/variables.json.FRAMEWORK": "Umožňuje sestavit SHARED (SDÍLENOU) nebo STATIC (STATICKOU) knihovnu jako sadu architektury v macOS a iOS.",
	"assets/variables.json.FRAMEWORK_MULTI_CONFIG_POSTFIX_CONFIG": "Přípona, která se má připojit k názvu souboru architektury pro konfiguraci <CONFIG> při použití generátoru s více konfiguracemi (například Xcode a Ninja Multi-Config).",
	"assets/variables.json.FRAMEWORK_VERSION": "Verze architektury vytvořené pomocí cílové vlastnosti FRAMEWORK (například A)",
	"assets/variables.json.GENERATOR_FILE_NAME": "Soubor generátoru pro tento cíl",
	"assets/variables.json.GHS_INTEGRITY_APP": "Logická hodnota ZAPNOUT/VYPNOUT, která určuje, jestli má být cíl spustitelného souboru považován za aplikaci integrity",
	"assets/variables.json.GHS_NO_SOURCE_GROUP_FILE": "Logická hodnota ZAPNOUT/VYPNOUT, která určuje, jestli soubor projektu pro cíl by měl být jeden jediný soubor nebo více souborů",
	"assets/variables.json.GNUtoMS": "Umožňuje převést knihovnu importu GNU (.dll.a) na formát MS (.lib).",
	"assets/variables.json.HAS_CXX": "Umožňuje propojit cíl pomocí nástroje linker C++ (zastaralé).",
	"assets/variables.json.HEADER_DIRS": "Středníky oddělený seznam základních adresářů výchozí sady hlaviček cíle (tj. sada souborů s názvem a typem HEADERS). Vlastnost podporuje výrazy generátoru <cmake-generator-expressions(7)>.",
	"assets/variables.json.HEADER_DIRS_NAME": "Středníky oddělený seznam základních adresářů sady hlaviček <NAME> cíle, která má nastavený typ HEADERS. Vlastnost podporuje výrazy generátoru <cmake-generator-expressions(7)>.",
	"assets/variables.json.HEADER_SET": "Středníky oddělený seznam souborů ve výchozí sadě hlaviček cíle (tj. sada souborů s názvem a typem HEADERS). Pokud jsou některé cesty relativní, počítají se relativně ke zdrojovému adresáři cíle. Vlastnost podporuje výrazy generátoru <cmake-generator-expressions(7)>.",
	"assets/variables.json.HEADER_SETS": "Seznam sad hlaviček PRIVATE a PUBLIC cíle jen pro čtení (tj. všechny sady souborů s typem HEADERS). Soubory uvedené v těchto sadách souborů jsou pro účely integrace integrovaného vývojového prostředí považovány za zdrojové soubory. Soubory mají také vlastnost HEADER_FILE_ONLY nastavenou na hodnotu TRUE.",
	"assets/variables.json.HEADER_SET_NAME": "Středníky oddělený seznam souborů v sadě hlaviček <NAME> cíle, která má nastavený typ HEADERS. Pokud jsou některé cesty relativní, počítají se relativně ke zdrojovému adresáři cíle. Vlastnost podporuje výrazy generátoru <cmake-generator-expressions(7)>.",
	"assets/variables.json.HIP_ARCHITECTURES": "Seznam architektur GPU, pro které se má vygenerovat kód zařízení. Názvy architektury se interpretují na základě CMAKE_HIP_PLATFORM.",
	"assets/variables.json.HIP_EXTENSIONS": "Logická hodnota určující, jestli se vyžadují rozšíření specifická pro kompilátor",
	"assets/variables.json.HIP_STANDARD": "Standard HIP/C++ požádal o vytvoření tohoto cíle.",
	"assets/variables.json.HIP_STANDARD_REQUIRED": "Logická hodnota popisující, jestli se vyžaduje hodnota HIP_STANDARD",
	"assets/variables.json.IMPORTED": "Označení jen pro čtení, jestli je cíl IMPORTED (IMPORTOVANÝ)",
	"assets/variables.json.IMPORTED_COMMON_LANGUAGE_RUNTIME": "Vlastnost, která definuje, jestli cíl používá C++/CLI",
	"assets/variables.json.IMPORTED_CONFIGURATIONS": "Konfigurace zadané pro importovaný cíl.",
	"assets/variables.json.IMPORTED_CXX_MODULES_COMPILE_DEFINITIONS": "Definice preprocesoru pro kompilaci zdrojů modulu C++ cíle IMPORTED.",
	"assets/variables.json.IMPORTED_CXX_MODULES_COMPILE_FEATURES": "Funkce kompilátoru povolené pro moduly C++ tohoto cíle IMPORTED.",
	"assets/variables.json.IMPORTED_CXX_MODULES_COMPILE_OPTIONS": "Seznam možností, které se mají předat kompilátoru pro moduly C++ tohoto cíle IMPORTED.",
	"assets/variables.json.IMPORTED_CXX_MODULES_INCLUDE_DIRECTORIES": "Seznam preprocesorů zahrnuje adresáře pro vyhledávání souborů při kompilaci modulů C++ pro cíle IMPORTED.",
	"assets/variables.json.IMPORTED_CXX_MODULES_LINK_LIBRARIES": "Seznam přímých závislostí, které se mají použít pro požadavky na použití pro moduly C++ v cílových modulech C++.",
	"assets/variables.json.IMPORTED_GLOBAL": "Označení, jestli IMPORTED (IMPORTOVANÝ) cíl je globálně viditelný",
	"assets/variables.json.IMPORTED_IMPLIB": "Úplná cesta ke knihovně importu pro IMPORTED (IMPORTOVANÝ) cíl",
	"assets/variables.json.IMPORTED_IMPLIB_CONFIG": "Verze vlastnosti IMPORTED_IMPLIB specifická pro konfiguraci <CONFIG>",
	"assets/variables.json.IMPORTED_LIBNAME": "Umožňuje zadat název knihovny propojení pro importovanou knihovnu rozhraní.",
	"assets/variables.json.IMPORTED_LIBNAME_CONFIG": "Verze vlastnosti IMPORTED_LIBNAME specifická pro konfiguraci <CONFIG>",
	"assets/variables.json.IMPORTED_LINK_DEPENDENT_LIBRARIES": "Závislé sdílené knihovny importované sdílené knihovny",
	"assets/variables.json.IMPORTED_LINK_DEPENDENT_LIBRARIES_CONFIG": "Verze vlastnosti IMPORTED_LINK_DEPENDENT_LIBRARIES specifická pro konfiguraci <CONFIG>",
	"assets/variables.json.IMPORTED_LINK_INTERFACE_LANGUAGES": "Jazyky zkompilované do IMPORTED (IMPORTOVANÉ) statické knihovny",
	"assets/variables.json.IMPORTED_LINK_INTERFACE_LANGUAGES_CONFIG": "Verze vlastnosti IMPORTED__LINK_INTERFACE_LANGUAGES specifická pro konfiguraci <CONFIG>",
	"assets/variables.json.IMPORTED_LINK_INTERFACE_LIBRARIES": "Rozhraní přenosného propojení IMPORTED (IMPORTOVANÉHO) cíle",
	"assets/variables.json.IMPORTED_LINK_INTERFACE_LIBRARIES_CONFIG": "Verze vlastnosti IMPORTED_LINK_INTERFACE_LIBRARIES specifická pro konfiguraci <CONFIG>",
	"assets/variables.json.IMPORTED_LINK_INTERFACE_MULTIPLICITY": "Počet opakování pro cykly IMPORTED (IMPORTOVANÝCH) statických knihoven",
	"assets/variables.json.IMPORTED_LINK_INTERFACE_MULTIPLICITY_CONFIG": "Verze vlastnosti IMPORTED_LINK_INTERFACE_MULTIPLICITY specifická pro konfiguraci <CONFIG>",
	"assets/variables.json.IMPORTED_LOCATION": "Úplná cesta k hlavnímu souboru na disku pro IMPORTED (IMPORTOVANÝ) cíl",
	"assets/variables.json.IMPORTED_LOCATION_CONFIG": "Verze vlastnosti IMPORTED_LOCATION specifická pro konfiguraci <CONFIG>",
	"assets/variables.json.IMPORTED_NO_SONAME": "Určuje, že cíl IMPORTED (IMPORTOVANÉ) sdílené knihovny nemá žádný název soname.",
	"assets/variables.json.IMPORTED_NO_SONAME_CONFIG": "Verze vlastnosti IMPORTED_NO_SONAME specifická pro konfiguraci <CONFIG>",
	"assets/variables.json.IMPORTED_NO_SYSTEM": "Nastavení IMPORTED_NO_SYSTEM na hodnotu true u importovaného cíle určuje, že se nejedná o systémový cíl. To má následující účinky:",
	"assets/variables.json.IMPORTED_OBJECTS": "Středníky oddělený seznam absolutních cest k souborům objektů na disku pro importovanou knihovnu objektů",
	"assets/variables.json.IMPORTED_OBJECTS_CONFIG": "Verze vlastnosti IMPORTED_OBJECTS specifická pro konfiguraci <CONFIG>",
	"assets/variables.json.IMPORTED_SONAME": "Název soname IMPORTED (IMPORTOVANÉHO) cíle typu sdílené knihovny",
	"assets/variables.json.IMPORTED_SONAME_CONFIG": "Verze vlastnosti IMPORTED_SONAME specifická pro konfiguraci <CONFIG>",
	"assets/variables.json.IMPORT_PREFIX": "Co je před názvem knihovny importu.",
	"assets/variables.json.IMPORT_SUFFIX": "Co následuje za názvem knihovny importu.",
	"assets/variables.json.INSTALL_NAME_DIR": "Název adresáře pro nainstalované cíle na platformách Apple",
	"assets/variables.json.INSTALL_REMOVE_ENVIRONMENT_RPATH": "Řídí, jestli by se měly během instalace odebrat cesty rpaths definované sadou nástrojů.",
	"assets/variables.json.INSTALL_RPATH": "Cesta rpath, která se má použít pro instalované cíle",
	"assets/variables.json.INSTALL_RPATH_USE_LINK_PATH": "Přidejte cesty pro vyhledávání linkeru a cestu rpath pro nainstalované cíle.",
	"assets/variables.json.INTERFACE_AUTOMOC_MACRO_NAMES": "Středníky oddělený seznam názvů maker, které mají být rozšířeny do příjemců AUTOMOC.",
	"assets/variables.json.INTERFACE_AUTOUIC_OPTIONS": "Seznam možností rozhraní, které mají být předány UIC",
	"assets/variables.json.INTERFACE_COMPILE_DEFINITIONS": "Seznam požadavků na veřejné elementy property_name pro knihovnu",
	"assets/variables.json.INTERFACE_COMPILE_FEATURES": "Seznam požadavků na veřejné elementy property_name pro knihovnu",
	"assets/variables.json.INTERFACE_COMPILE_OPTIONS": "Seznam požadavků na veřejné elementy property_name pro knihovnu",
	"assets/variables.json.INTERFACE_CXX_MODULE_SETS": "Seznam sad modulů PUBLIC C++ cíle pouze pro čtení (tj. všechny sady souborů s typem CXX_MODULES). Soubory uvedené v těchto sadách modulů C++ je možné nainstalovat a exportovat při instalaci a exportu.",
	"assets/variables.json.INTERFACE_HEADER_SETS": "Seznam sad hlaviček INTERFACE a PUBLIC cíle jen pro čtení (tj. všechny sady souborů s typem HEADERS). Soubory uvedené v těchto sadách hlaviček je možné nainstalovat a exportovat při instalaci a exportu.",
	"assets/variables.json.INTERFACE_HEADER_SETS_TO_VERIFY": "Slouží k určení, které sady záhlaví PUBLIC a INTERFACE cíle mají být ověřeny.",
	"assets/variables.json.INTERFACE_INCLUDE_DIRECTORIES": "Seznam požadavků na veřejné elementy property_name pro knihovnu",
	"assets/variables.json.INTERFACE_LINK_DEPENDS": "Další soubory veřejného rozhraní, na kterých závisí cílový binární soubor pro propojení",
	"assets/variables.json.INTERFACE_LINK_DIRECTORIES": "Seznam požadavků na veřejné elementy property_name pro knihovnu",
	"assets/variables.json.INTERFACE_LINK_LIBRARIES": "Seznam knihoven veřejného rozhraní pro knihovnu",
	"assets/variables.json.INTERFACE_LINK_LIBRARIES_DIRECT": "Seznam knihoven, které by příjemci této knihovny měli považovat za závislosti přímého propojení.",
	"assets/variables.json.INTERFACE_LINK_LIBRARIES_DIRECT_EXCLUDE": "Seznam knihoven, které by příjemci této knihovny neměli považovat za závislosti přímého propojení.",
	"assets/variables.json.INTERFACE_LINK_OPTIONS": "Seznam požadavků na veřejné elementy property_name pro knihovnu",
	"assets/variables.json.INTERFACE_POSITION_INDEPENDENT_CODE": "Určuje, jestli si spotřebitelé musí vytvořit cíl nezávislý na pozici.",
	"assets/variables.json.INTERFACE_PRECOMPILE_HEADERS": "Seznam souborů hlaviček rozhraní, které se mají předkompilovat do spotřebovávajících cílů",
	"assets/variables.json.INTERFACE_SOURCES": "Seznam zdrojů rozhraní, které se mají zkompilovat do spotřebovávaných cílů",
	"assets/variables.json.INTERFACE_SYSTEM_INCLUDE_DIRECTORIES": "Seznam adresářů zahrnutí veřejného systému pro knihovnu",
	"assets/variables.json.IOS_INSTALL_COMBINED": "Umožňuje sestavit kombinovaný cíl (zařízení a simulátor) při instalaci.",
	"assets/variables.json.ISPC_HEADER_DIRECTORY": "Umožňuje zadat relativní výstupní adresář pro hlavičky ISPC poskytnuté cílem.",
	"assets/variables.json.ISPC_HEADER_SUFFIX": "Umožňuje zadat výstupní příponu, která se bude používat pro hlavičky vygenerované pomocí ISPC poskytnuté cílem.",
	"assets/variables.json.ISPC_INSTRUCTION_SETS": "Seznam architektur instrukčních sad, pro které se má generovat kód",
	"assets/variables.json.JOB_POOL_COMPILE": "Pouze Ninja: fond použitý pro kompilaci",
	"assets/variables.json.JOB_POOL_LINK": "Pouze Ninja: fond použitý pro propojování",
	"assets/variables.json.JOB_POOL_PRECOMPILE_HEADER": "Jenom Ninja: fond použitý pro generování předkompilovaných hlaviček",
	"assets/variables.json.LANG_CLANG_TIDY": "Tato vlastnost je implementovaná jen v případě, že <LANG> je C, CXX, OBJC nebo OBJCXX.",
	"assets/variables.json.LANG_CLANG_TIDY_EXPORT_FIXES_DIR": "Tato vlastnost je implementována pouze v případě, že <LANG> je C, CXX, OBJC nebo OBJCXX a má účinek pouze při nastavení <LANG>_CLANG_TIDY.",
	"assets/variables.json.LANG_COMPILER_LAUNCHER": "Tato vlastnost je implementována jen v případě, že <LANG> je C, CXX, Fortran, HIP, ISPC, OBJC, OBJCXX nebo CUDA.",
	"assets/variables.json.LANG_CPPCHECK": "Tato vlastnost se podporuje, jenom když <LANG> je C nebo CXX.",
	"assets/variables.json.LANG_CPPLINT": "Tato vlastnost se podporuje, jenom když <LANG> je C nebo CXX.",
	"assets/variables.json.LANG_EXTENSIONS": "Varianty:",
	"assets/variables.json.LANG_INCLUDE_WHAT_YOU_USE": "Tato vlastnost se implementuje, jenom když <LANG> je C nebo CXX.",
	"assets/variables.json.LANG_LINKER_LAUNCHER": "Tato vlastnost je implementována jen v případě, že <LANG> je C, CXX, OBJC nebo OBJCXX.",
	"assets/variables.json.LANG_STANDARD": "Varianty:",
	"assets/variables.json.LANG_STANDARD_REQUIRED": "Varianty:",
	"assets/variables.json.LANG_VISIBILITY_PRESET": "Hodnota pro příznaky kompilace viditelnosti symbolů",
	"assets/variables.json.LIBRARY_OUTPUT_DIRECTORY": "Výstupní adresář, ve kterém se mají sestavit cílové soubory XXX",
	"assets/variables.json.LIBRARY_OUTPUT_DIRECTORY_CONFIG": "Výstupní adresář podle konfigurace pro cílové soubory LIBRARY (KNIHOVNA)",
	"assets/variables.json.LIBRARY_OUTPUT_NAME": "Název výstupu pro cílové soubory XXX",
	"assets/variables.json.LIBRARY_OUTPUT_NAME_CONFIG": "Výstupní název podle konfigurace pro cílové soubory LIBRARY (KNIHOVNA)",
	"assets/variables.json.LINKER_LANGUAGE": "Určuje jazyk, jehož kompilátor vyvolá linker.",
	"assets/variables.json.LINKER_TYPE": "Určete, který linker se použije pro krok propojení. Hodnota vlastnosti může používat výrazy generátoru <cmake-generator-expressions(7)>.",
	"assets/variables.json.LINK_DEPENDS": "Další soubory, na kterých závisí cílový binární soubor pro propojení",
	"assets/variables.json.LINK_DEPENDS_NO_SHARED": "Nastaví nezávislost na souborech propojené sdílené knihovny.",
	"assets/variables.json.LINK_FLAGS": "Další příznaky pro použití při propojování tohoto cíle, pokud je to sdílená knihovna, knihovna modulů nebo spustitelný soubor. Statické knihovny musí používat vlastnosti STATIC_LIBRARY_OPTIONS nebo STATIC_LIBRARY_FLAGS.",
	"assets/variables.json.LINK_FLAGS_CONFIG": "Příznaky linkeru podle konfigurace pro sdílenou (SHARED) knihovnu, modul (MODULE) nebo spustitelný soubor (EXECUTABLE) jako cíl",
	"assets/variables.json.LINK_INTERFACE_LIBRARIES": "Seznam knihoven veřejného rozhraní pro sdílenou knihovnu nebo spustitelný soubor",
	"assets/variables.json.LINK_INTERFACE_LIBRARIES_CONFIG": "Seznam knihoven veřejného rozhraní podle konfigurace pro cíl",
	"assets/variables.json.LINK_INTERFACE_MULTIPLICITY": "Počet opakování pro STATIC (STATICKÉ) knihovny s cyklickými závislostmi",
	"assets/variables.json.LINK_INTERFACE_MULTIPLICITY_CONFIG": "Počet opakování podle konfigurace pro cykly STATIC (STATICKÝCH) knihoven",
	"assets/variables.json.LINK_LIBRARIES": "Seznam závislostí přímých odkazů",
	"assets/variables.json.LINK_LIBRARIES_ONLY_TARGETS": "Vynuťte, aby položky odkazů, které mohou být cílovými názvy, byly ve skutečnosti existujícími cíli.",
	"assets/variables.json.LINK_LIBRARY_OVERRIDE": "Přepsání funkcí knihovny přidružených ke knihovnám z výrazů generátoru LINK_LIBRARY. To lze použít k řešení nekompatibilních funkcí knihovny, které vyplývají ze zadání různých funkcí pro stejnou knihovnu v různých výrazech generátoru LINK_LIBRARY.",
	"assets/variables.json.LINK_LIBRARY_OVERRIDE_LIBRARY": "Přepsání funkce knihovny spojené s <LIBRARY> z výrazů generátoru LINK_LIBRARY. Toto je možné použít k řešení nekompatibilních funkcí knihovny, které vyplývají ze zadání různých funkcí pro <LIBRARY> v různých výrazech generátoru LINK_LIBRARY.",
	"assets/variables.json.LINK_SEARCH_END_STATIC": "Zakončete propojovací řadu tak, aby se používaly statické systémové knihovny.",
	"assets/variables.json.LINK_SEARCH_START_STATIC": "Předpokládejte, že linker ve výchozím nastavení hledá statické knihovny.",
	"assets/variables.json.LINK_WHAT_YOU_USE": "Toto je logická možnost, která při nastavení na hodnotu TRUE automaticky spustí v cíli po propojení obsah proměnné CMAKE_LINK_WHAT_YOU_USE_CHECK. Kromě toho bude do cíle předán příznak linkeru CMAKE_<LANG>_LINK_WHAT_YOU_USE_FLAG s příkazem propojení tak, že se všechny knihovny zadané na příkazovém řádku propojí do cíle. Výsledkem bude propojení, který bude vytvářet seznam knihoven, které nebudou poskytovat žádné symboly používané tímto cílem, ale které jsou s ním propojené.",
	"assets/variables.json.LOCATION_CONFIG": "Vlastnost poskytující cílové umístění na disku, která je jen pro čtení",
	"assets/variables.json.MACHO_COMPATIBILITY_VERSION": "Jaké číslo verze kompatibility má tento cíl pro binární soubory Mach-O.",
	"assets/variables.json.MACHO_CURRENT_VERSION": "Jaké číslo aktuální verze má tento cíl pro binární soubory Mach-O.",
	"assets/variables.json.MACOSX_BUNDLE": "Umožňuje sestavit spustitelný soubor jako balíček aplikace v macOS nebo iOS.",
	"assets/variables.json.MACOSX_BUNDLE_INFO_PLIST": "Umožňuje zadat vlastní šablonu Info.plist pro balíček aplikace pro macOS a iOS.",
	"assets/variables.json.MACOSX_FRAMEWORK_INFO_PLIST": "Umožňuje zadat vlastní šablonu Info.plist pro architekturu macOS a iOS.",
	"assets/variables.json.MACOSX_RPATH": "Určuje, jestli je tento cíl na macOS nebo iOS umístěný za běhu s použitím rpaths.",
	"assets/variables.json.MANUALLY_ADDED_DEPENDENCIES": "Umožňuje získat ručně přidané závislosti na jiné cíle nejvyšší úrovně.",
	"assets/variables.json.MAP_IMPORTED_CONFIG_CONFIG": "Mapování z konfigurace projektu do konfigurace importovaného cíle",
	"assets/variables.json.MSVC_DEBUG_INFORMATION_FORMAT": "Při cílení na rozhraní ABI MSVC vyberte formát informací o ladění.",
	"assets/variables.json.MSVC_RUNTIME_LIBRARY": "Umožňuje vybrat knihovnu runtime MSVC pro použití kompilátory, které cílí na MSVC ABI.",
	"assets/variables.json.NAME": "Logický název pro cíl",
	"assets/variables.json.NO_SONAME": "Určuje, jestli se má nastavit název soname při propojování sdílené knihovny.",
	"assets/variables.json.NO_SYSTEM_FROM_IMPORTED": "Nepovažujte adresáře zahrnutí z rozhraní spotřebovaných importovaných cílů za systémové adresáře.",
	"assets/variables.json.OBJCXX_EXTENSIONS": "Logická hodnota určující, jestli se vyžadují rozšíření specifická pro kompilátor",
	"assets/variables.json.OBJCXX_STANDARD": "Standard jazyka ObjC++, jehož funkce jsou potřebné k sestavení tohoto cíle",
	"assets/variables.json.OBJCXX_STANDARD_REQUIRED": "Logická hodnota popisující, jestli se vyžaduje hodnota OBJCXX_STANDARD",
	"assets/variables.json.OBJC_EXTENSIONS": "Logická hodnota určující, jestli se vyžadují rozšíření specifická pro kompilátor",
	"assets/variables.json.OBJC_STANDARD": "Standard jazyka OBJC, jehož funkce jsou potřebné k sestavení tohoto cíle",
	"assets/variables.json.OBJC_STANDARD_REQUIRED": "Logická hodnota popisující, jestli se vyžaduje hodnota OBJC_STANDARD",
	"assets/variables.json.OPTIMIZE_DEPENDENCIES": "Aktivuje optimalizaci závislostí statických knihoven a knihoven objektů.",
	"assets/variables.json.OSX_ARCHITECTURES": "Architektury pro konkrétní cíle pro macOS",
	"assets/variables.json.OSX_ARCHITECTURES_CONFIG": "Binární architektury pro macOS a iOS podle konfigurace pro cíl",
	"assets/variables.json.OUTPUT_NAME": "Výstupní název pro cílové soubory",
	"assets/variables.json.OUTPUT_NAME_CONFIG": "Základní název cílového souboru podle konfigurace",
	"assets/variables.json.PCH_INSTANTIATE_TEMPLATES": "Když se tato vlastnost nastaví na true, možnosti kompilátoru pro předkompilované hlavičky bude obsahovat příznak, který při generování PCH vytvoří instance šablon, pokud se podporují. Tak se dá výrazně zkrátit doba kompilace. Podporováno v Clangu od verze 11.",
	"assets/variables.json.PCH_WARN_INVALID": "Pokud je tato vlastnost nastavena na hodnotu true, budou možnosti kompilátoru hlaviček pro předkompilaci obsahovat příznak kompilátoru, který by měl upozorňovat na neplatné předkompilované hlavičky, třeba -Winvalid-pch pro kompilátor GNU.",
	"assets/variables.json.PDB_NAME": "Výstupní název pro soubor .pdb symbolu ladění MS vygenerovaný linkerem pro spustitelný soubor nebo cíl sdílené knihovny",
	"assets/variables.json.PDB_NAME_CONFIG": "Výstupní název podle konfigurace pro soubor .pdb symbolu ladění MS vygenerovaný linkerem pro spustitelný soubor nebo cíl sdílené knihovny",
	"assets/variables.json.PDB_OUTPUT_DIRECTORY": "Výstupní adresář pro soubor .pdb symbolů ladění MS vygenerovaný linkerem pro spustitelný soubor nebo cíl sdílené knihovny",
	"assets/variables.json.PDB_OUTPUT_DIRECTORY_CONFIG": "Výstupní adresář podle konfigurace pro soubor .pdb symbolu ladění MS vygenerovaný linkerem pro spustitelný soubor nebo cíl sdílené knihovny",
	"assets/variables.json.POSITION_INDEPENDENT_CODE": "Určuje, jestli se má vytvořit cíl nezávislý na pozici.",
	"assets/variables.json.POST_INSTALL_SCRIPT": "Zastaralá podpora instalace",
	"assets/variables.json.PRECOMPILE_HEADERS": "Seznam souborů hlaviček k předkompilaci",
	"assets/variables.json.PRECOMPILE_HEADERS_REUSE_FROM": "Cíl, ze kterého se má znovu použít artefakt sestavení předkompilovaných hlaviček",
	"assets/variables.json.PREFIX": "Co je před názvem knihovny.",
	"assets/variables.json.PRE_INSTALL_SCRIPT": "Zastaralá podpora instalace",
	"assets/variables.json.PRIVATE_HEADER": "Umožňuje zadat soubory privátních hlaviček v cíli sdílené knihovny FRAMEWORK.",
	"assets/variables.json.PROJECT_LABEL": "Umožňuje změnit název cíle v rozhraní IDE.",
	"assets/variables.json.PUBLIC_HEADER": "Umožňuje zadat soubory veřejných hlaviček v cíli sdílené knihovny FRAMEWORK (ARCHITEKTURA).",
	"assets/variables.json.RESOURCE": "Umožňuje zadat soubory prostředků v možnosti FRAMEWORK (ARCHITEKTURA) nebo BUNDLE (SADA).",
	"assets/variables.json.RUNTIME_OUTPUT_DIRECTORY": "Výstupní adresář, ve kterém se mají sestavit cílové soubory XXX",
	"assets/variables.json.RUNTIME_OUTPUT_DIRECTORY_CONFIG": "Výstupní adresář podle konfigurace pro cílové soubory RUNTIME",
	"assets/variables.json.RUNTIME_OUTPUT_NAME": "Název výstupu pro cílové soubory XXX",
	"assets/variables.json.RUNTIME_OUTPUT_NAME_CONFIG": "Výstupní název podle konfigurace pro cílové soubory RUNTIME",
	"assets/variables.json.SKIP_BUILD_RPATH": "Měl by se příkaz rpaths použít pro strom sestavení.",
	"assets/variables.json.SOURCES": "Určuje seznam cest ke zdrojovým souborům pro cíl. Všechny následující příkazy se nastavují nebo přidávají do cílové vlastnosti SOURCES a představují obvyklý způsob, jak s ní manipulovat:",
	"assets/variables.json.SOVERSION": "Číslo verze ABI cíle sdílené knihovny",
	"assets/variables.json.STATIC_LIBRARY_FLAGS": "Příznaky archivátoru (nebo MSVC Librarian) pro cíl statické knihovny. Cíle, které jsou sdílené knihovny, moduly nebo spustitelné soubory, musí použít cílové vlastnosti LINK_OPTIONS nebo LINK_FLAGS.",
	"assets/variables.json.STATIC_LIBRARY_FLAGS_CONFIG": "Příznaky archivátoru (nebo MSVC Librarian) podle konfigurace pro cíl statické knihovny",
	"assets/variables.json.STATIC_LIBRARY_OPTIONS": "Příznaky archivátoru (nebo MSVC Librarian) pro cíl statické knihovny. Cíle, které jsou sdílené knihovny, moduly nebo spustitelné soubory, musí použít cílovou vlastnost LINK_OPTIONS.",
	"assets/variables.json.SUFFIX": "Co následuje za názvem cíle.",
	"assets/variables.json.Swift_COMPILATION_MODE": "Zadejte, jak Swift zkompiluje cíl.",
	"assets/variables.json.Swift_LANGUAGE_VERSION": "Tato vlastnost nastavuje jazykovou verzi pro zdroje Swift v cíli. Pokud není žádná zadaná, použije se jako výchozí CMAKE_Swift_LANGUAGE_VERSION, pokud je zadaná, jinak to bude nejnovější verze podporovaná kompilátorem.",
	"assets/variables.json.Swift_MODULE_DIRECTORY": "Umožňuje zadat výstupní adresář pro moduly Swift poskytnuté cílem.",
	"assets/variables.json.Swift_MODULE_NAME": "Tato vlastnost určuje název modulu Swift. Ve výchozím nastavení je to název cíle.",
	"assets/variables.json.TEST_LAUNCHER": "Ke spouštění spustitelných souborů použijte daný spouštěč. Tento příkaz bude přidán jako předpona k příkazům add_test pro spustitelné soubory cílového systému sestavení a je určen ke spuštění na hostitelském počítači.",
	"assets/variables.json.TRANSITIVE_COMPILE_PROPERTIES": "Vlastnosti, které výraz generátoru TARGET_PROPERTY na cíli a jeho závislých objektech vyhodnotí jako sjednocení hodnot získaných z přechodného uzavření závislostí odkazů, s výjimkou položek chráněných pomocí LINK_ONLY.",
	"assets/variables.json.TRANSITIVE_LINK_PROPERTIES": "Vlastnosti, které výraz generátoru TARGET_PROPERTY na cíli a jeho závislých objektech vyhodnotí jako sjednocení hodnot získaných z přechodného uzavření závislostí odkazů, včetně položek chráněných pomocí LINK_ONLY.",
	"assets/variables.json.UNITY_BUILD": "Pokud je tato vlastnost nastavena na hodnotu true, budou cílové zdrojové soubory zkombinovány do dávek za účelem rychlejší kompilace. To se provádí vytvořením (sady) zdrojů unity, které obsahují (#include) původní zdroje, a potom se tyto zdroje unity zkompilují místo originálů. Toto sestavení se nazývá Unity nebo Jumbo.",
	"assets/variables.json.UNITY_BUILD_BATCH_SIZE": "Určuje maximální počet zdrojových souborů, které mohou být zkombinovány do libovolného zdrojového souboru unity v případě, že jsou sestavení unity povoleny vlastností UNITY_BUILD cíle. Původní zdrojové soubory budou distribuovány v libovolném počtu zdrojových souborů unity tak, jak je nutné pro tento limit.",
	"assets/variables.json.UNITY_BUILD_CODE_AFTER_INCLUDE": "Fragment kódu, který je doslovně zahrnut funkcí UNITY_BUILD hned po každém příkazu #include ve vygenerovaných zdrojových souborech unity. Například:",
	"assets/variables.json.UNITY_BUILD_CODE_BEFORE_INCLUDE": "Fragment kódu, který je doslovně zahrnut funkcí UNITY_BUILD hned před každým příkazem #include ve vygenerovaných zdrojových souborech unity. Například:",
	"assets/variables.json.UNITY_BUILD_MODE": "CMake poskytuje různé algoritmy pro výběr, které zdroje jsou seskupené dohromady do bloku. Výběr se rozhoduje podle této vlastnosti, která má následující přijatelné hodnoty:",
	"assets/variables.json.UNITY_BUILD_UNIQUE_ID": "Název platného identifikátoru C, který se během sestavení Unity nastavuje na hodnotu jedinečnou pro každý soubor.",
	"assets/variables.json.VERIFY_INTERFACE_HEADER_SETS": "Slouží k ověření, zda všechny hlavičky v sadách hlaviček PUBLIC a INTERFACE cíle mohou být zahrnuty samostatně.",
	"assets/variables.json.VERSION": "Číslo verze cíle sdílené knihovny",
	"assets/variables.json.VISIBILITY_INLINES_HIDDEN": "Určuje, jestli se má přidat příznak kompilace, aby se skryly symboly vložených funkcí.",
	"assets/variables.json.VS_CONFIGURATION_TYPE": "Typ konfigurace projektu Visual Studio",
	"assets/variables.json.VS_DEBUGGER_COMMAND": "Nastaví příkaz místního ladicího programu pro cíle Visual Studio C++. Hodnota vlastnosti může používat výrazy generátoru <cmake-generator-expressions(7)>. To je definováno v <LocalDebuggerCommand> v souboru projektu Visual Studia. Tato vlastnost je inicializována hodnotou proměnné CMAKE_VS_DEBUGGER_COMMAND, pokud je nastavena při vytvoření cíle.",
	"assets/variables.json.VS_DEBUGGER_COMMAND_ARGUMENTS": "Nastaví argumenty příkazového řádku místního ladicího programu pro cíle Visual Studio C++. Hodnota vlastnosti může používat výrazy generátoru <cmake-generator-expressions(7)>. To je definováno v <LocalDebuggerCommandArguments> v souboru projektu Visual Studia. Tato vlastnost je inicializována hodnotou proměnné CMAKE_VS_DEBUGGER_COMMAND_ARGUMENTS, pokud je nastavena při vytvoření cíle.",
	"assets/variables.json.VS_DEBUGGER_ENVIRONMENT": "Nastaví místní prostředí ladicího programu pro cíle Visual Studio C++. Hodnota vlastnosti může používat výrazy generátoru <cmake-generator-expressions(7)>. To je definováno v <LocalDebuggerEnvironment> v souboru projektu Visual Studia. Tato vlastnost je inicializována hodnotou proměnné CMAKE_VS_DEBUGGER_ENVIRONMENT, pokud je nastavena při vytvoření cíle.",
	"assets/variables.json.VS_DEBUGGER_WORKING_DIRECTORY": "Nastaví pracovní adresář místního ladicího programu pro cíle Visual Studio C++. Hodnota vlastnosti může používat výrazy generátoru <cmake-generator-expressions(7)>. To je definováno v <LocalDebuggerWorkingDirectory> v souboru projektu Visual Studia. Tato vlastnost je inicializována hodnotou proměnné CMAKE_VS_DEBUGGER_WORKING_DIRECTORY, pokud je nastavena při vytvoření cíle.",
	"assets/variables.json.VS_DESKTOP_EXTENSIONS_VERSION": "Verze desktopových rozšíření pro Windows 10 sady Visual Studio",
	"assets/variables.json.VS_DOTNET_DOCUMENTATION_FILE": "Výstup dokumentace .NET pro projekt spravovaný sadou Visual Studio",
	"assets/variables.json.VS_DOTNET_REFERENCEPROP_refname_TAG_tagname": "Definuje vlastnost XML <tagname> pro odkaz na .NET <refname>.",
	"assets/variables.json.VS_DOTNET_REFERENCES": "Odkazy .NET na projekt spravovaný sadou Visual Studio",
	"assets/variables.json.VS_DOTNET_REFERENCES_COPY_LOCAL": "Nastaví vlastnost Copy Local pro všechny pomocné odkazy .NET v cíli.",
	"assets/variables.json.VS_DOTNET_REFERENCE_refname": "Odkaz .NET na projekt spravovaný sadou Visual Studio s názvem <refname> a cestou nápovědy",
	"assets/variables.json.VS_DOTNET_STARTUP_OBJECT": "Nastaví vlastnost spouštěcího objektu v cílech Visual Studio .NET. Hodnota vlastnosti definuje plný kvalifikovaný název třídy (včetně názvu balíčku), například: MyCompany.Package.MyStarterClass.",
	"assets/variables.json.VS_DOTNET_TARGET_FRAMEWORK_VERSION": "Zadejte verzi cílové architektury .NET.",
	"assets/variables.json.VS_DPI_AWARE": "Umožňuje nastavit Nástroj manifestu -> Vstup a výstup -> Rozpoznání nastavení DPI ve vlastnostech projektu cíle sady Visual Studio.",
	"assets/variables.json.VS_FILTER_PROPS": "Nastaví soubor props filtru, který se má zahrnout do souboru filtru projektu v jazyce C++ sady Visual Studio.",
	"assets/variables.json.VS_GLOBAL_KEYWORD": "Klíčové slovo projektu sady Visual Studio",
	"assets/variables.json.VS_GLOBAL_PROJECT_TYPES": "Typy projektů sady Visual Studio",
	"assets/variables.json.VS_GLOBAL_ROOTNAMESPACE": "Kořenový obor názvů projektu sady Visual Studio",
	"assets/variables.json.VS_GLOBAL_variable": "Globální proměnná specifická pro projekt sady Visual Studio",
	"assets/variables.json.VS_IOT_EXTENSIONS_VERSION": "Verze rozšíření sady Visual Studio pro Windows 10 IoT",
	"assets/variables.json.VS_IOT_STARTUP_TASK": "Průběžná úloha sady Visual Studio pro Windows 10 IoT na pozadí",
	"assets/variables.json.VS_JUST_MY_CODE_DEBUGGING": "Povolí možnost Pouze můj kód s ladicím programem Visual Studio.",
	"assets/variables.json.VS_KEYWORD": "Odebráno Kdysi určovalo klíčové slovo projektu sady Visual Studio pro generátor sady Visual Studio 9 2008 a starší, ale všechny tyto generátory byly odebrány.",
	"assets/variables.json.VS_MOBILE_EXTENSIONS_VERSION": "Verze rozšíření systému Windows 10 Mobile v sadě Visual Studio",
	"assets/variables.json.VS_NO_COMPILE_BATCHING": "Vypnutí dávkování kompilace pro cíl. Obvykle MSBuild volá kompilátor s více soubory c/cpp a kompilátor spouští podprocesy pro každý soubor, aby bylo sestavování paralelní. Pokud chcete, aby byl kompilátor volán vždy s jedním souborem, nastavte VS_NO_COMPILE_BATCHING na ON. Pokud je tento příznak nastaven, MSBuild vyvolá kompilátor vždy s jedním souborem c/cpp. Užitečné, pokud chcete použít nástroj, který nahradí kompilátor, například nějaký nástroj pro ukládání sestavení do mezipaměti.",
	"assets/variables.json.VS_NO_SOLUTION_DEPLOY": "Určuje, že cíl nemá být ve vygenerovaném řešení Visual Studio označen pro nasazení do zařízení se systémem Windows CE nebo Windows Phone.",
	"assets/variables.json.VS_PACKAGE_REFERENCES": "Odkazy na balíček sady Visual Studio pro nuget",
	"assets/variables.json.VS_PLATFORM_TOOLSET": "Má přednost před sadou nástrojů platformy, která se používá k sestavení cíle.",
	"assets/variables.json.VS_PROJECT_IMPORT": "Importy projektů spravovaných sadou Visual Studio",
	"assets/variables.json.VS_SCC_AUXPATH": "Pomocná cesta správy zdrojového kódu sady Visual Studio",
	"assets/variables.json.VS_SCC_LOCALPATH": "Místní cesta správy zdrojového kódu sady Visual Studio",
	"assets/variables.json.VS_SCC_PROJECTNAME": "Projekt správy zdrojového kódu sady Visual Studio",
	"assets/variables.json.VS_SCC_PROVIDER": "Poskytovatel správy zdrojového kódu sady Visual Studio",
	"assets/variables.json.VS_SDK_REFERENCES": "Odkazy na sadu SDK v projektu sady Visual Studio. Zadejte seznam středníkem oddělených odkazů na sadu SDK, které se mají přidat do vygenerovaného projektu sady Visual Studio, třeba Microsoft.AdMediatorWindows81, Version=1.0.",
	"assets/variables.json.VS_SOLUTION_DEPLOY": "Určuje, že má být cíl označen pro nasazení, pokud není cílen na Windows CE, Windows Phone nebo aplikaci pro Windows Store.",
	"assets/variables.json.VS_SOURCE_SETTINGS_tool": "Umožňuje nastavit metadata libovolné položky ve všech souborech, které nejsou sestaveny a používají nástroj <tool>.",
	"assets/variables.json.VS_USER_PROPS": "Nastavte soubor vlastností uživatele, který se zahrne do souboru projektu Visual Studio C++. Standardní cesta je $(UserRootDir)\\\\Microsoft.Cpp.$(Platform).user.props, která se ve většině případů shoduje s cestou %LOCALAPPDATA%\\\\Microsoft\\\\MSBuild\\\\v4.0\\\\Microsoft.Cpp.Win32.user.props nebo %LOCALAPPDATA%\\\\Microsoft\\\\MSBuild\\\\v4.0\\\\Microsoft.Cpp.x64.user.props.",
	"assets/variables.json.VS_USE_DEBUG_LIBRARIES": "Indikuje pro generátory sady Visual Studio, které konfigurace se považují za konfigurace ladění. To řídí nastavení UseDebugLibraries v každé konfiguraci souboru .vcxproj.",
	"assets/variables.json.VS_WINDOWS_TARGET_PLATFORM_MIN_VERSION": "Minimální verze cílové platformy Windows sady Visual Studio",
	"assets/variables.json.VS_WINRT_COMPONENT": "Označte cíl jako komponentu prostředí Windows Runtime pro generátor sady Visual Studio. Zkompilujte cíl s rozšířeními jazyka C++/CX pro prostředí Windows Runtime. Pro knihovny SHARED a MODULE tato možnost navíc definuje makro preprocesoru _WINRT_DLL.",
	"assets/variables.json.VS_WINRT_EXTENSIONS": "Zastaralé. Použijte místo toho VS_WINRT_COMPONENT. Daná vlastnost byla experimentální částečnou implementací této vlastnosti.",
	"assets/variables.json.VS_WINRT_REFERENCES": "Odkazy na metadata prostředí Windows Runtime projektu sady Visual Studio",
	"assets/variables.json.WATCOM_RUNTIME_LIBRARY": "Vyberte běhovou knihovnu Watcom pro použití kompilátory zaměřenými na rozhraní Watcom ABI.",
	"assets/variables.json.WIN32_EXECUTABLE": "Sestavte spustitelný soubor se vstupním bodem WinMain na Windows.",
	"assets/variables.json.WINDOWS_EXPORT_ALL_SYMBOLS": "Tato vlastnost je implementovaná jen pro nástroje kompatibilní s Microsoftem ve Windows.",
	"assets/variables.json.XCODE_ATTRIBUTE_an-attribute": "Nastavte cílové atributy pro Xcode přímo.",
	"assets/variables.json.XCODE_EMBED_FRAMEWORKS_CODE_SIGN_ON_COPY": "Umožňuje dát generátoru Xcode pokyn, aby pro všechny architektury a knihovny vložené pomocí vlastnosti XCODE_EMBED_FRAMEWORKS <XCODE_EMBED_<type>> podepisoval kód.",
	"assets/variables.json.XCODE_EMBED_FRAMEWORKS_REMOVE_HEADERS_ON_COPY": "Umožňuje dát generátoru Xcode pokyn, aby ze všech architektur vložených pomocí vlastnosti XCODE_EMBED_FRAMEWORKS <XCODE_EMBED_<type>> odebral hlavičky.",
	"assets/variables.json.XCODE_EMBED_type": "Instruujte generátor Xcode, aby vložil zadaný seznam položek do cílové sady. <type> určuje fázi sestavení pro vložení, která se má použít. Základní umístění každého typu <type> najdete v dokumentaci k Xcode.",
	"assets/variables.json.XCODE_EMBED_type_CODE_SIGN_ON_COPY": "Logická vlastnost používaná pouze generátorem Xcode. Určuje, jestli se má provádět podepisování kódu u položek vložených pomocí vlastnosti XCODE_EMBED_.",
	"assets/variables.json.XCODE_EMBED_type_PATH": "Tuto vlastnost používá pouze generátor Xcode. Když je definována, určuje relativní cestu, která se použije při vkládání položek určených v XCODE_EMBED_. Cesta je relativní vůči základnímu umístění fáze sestavení Embed XXX s přidruženým typem <type>. Základní umístění každého typu <type> najdete v dokumentaci k Xcode.",
	"assets/variables.json.XCODE_EMBED_type_REMOVE_HEADERS_ON_COPY": "Logická vlastnost používaná pouze generátorem Xcode. Určuje, jestli se mají odebrat hlavičky ze všech architektur vložených pomocí vlastnosti XCODE_EMBED_.",
	"assets/variables.json.XCODE_GENERATE_SCHEME": "Pokud je možnost povolena, vygeneruje generátor Xcode soubory schématu. Jsou užitečné pro vyvolání akcí analyzování, archivace, sestavení pro testování a testování z příkazového řádku.",
	"assets/variables.json.XCODE_LINK_BUILD_PHASE_MODE": "Když se používá generátor Xcode, knihovny, které se mají připojit, se zadávají v souboru projektu Xcode buď pomocí fáze sestavení Link Binary With Libraries (Propojit binární soubor s knihovnami), nebo přímo jako příznaky linkeru. To první umožňuje nástroji Xcode spravovat cesty sestavení, což může být zapotřebí při vytváření archivů Xcode. V takovém případě totiž může Xcode používat jiné cesty k běžnému sestavení.",
	"assets/variables.json.XCODE_PRODUCT_TYPE": "Nastavte atribut Xcode productType v jeho odkazu na cíl. CMake vypočítá výchozí hodnotu podle cílového typu, ale pomocí této vlastnosti je možné určit hodnotu explicitně.",
	"assets/variables.json.XCODE_SCHEME_ADDRESS_SANITIZER": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky povolit sanitizér adres.",
	"assets/variables.json.XCODE_SCHEME_ADDRESS_SANITIZER_USE_AFTER_RETURN": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky povolit detekce použití zásobníku po návratu.",
	"assets/variables.json.XCODE_SCHEME_ARGUMENTS": "Zadejte argumenty příkazového řádku, které by se měly přidat do části Argument vygenerovaného schématu Xcode.",
	"assets/variables.json.XCODE_SCHEME_DEBUG_AS_ROOT": "Určuje, jestli se má cíl ladit jako kořen.",
	"assets/variables.json.XCODE_SCHEME_DEBUG_DOCUMENT_VERSIONING": "Určuje, jestli se má povolit možnost Povolit ladění, když se v oddíle Možnosti vygenerovaného schématu Xcode používá prohlížeč verzí dokumentu.",
	"assets/variables.json.XCODE_SCHEME_DISABLE_MAIN_THREAD_CHECKER": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu Diagnostics zakázat Main Thread Checker.",
	"assets/variables.json.XCODE_SCHEME_DYNAMIC_LIBRARY_LOADS": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky povolit načítání dynamických knihoven.",
	"assets/variables.json.XCODE_SCHEME_DYNAMIC_LINKER_API_USAGE": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky povolit dynamické použití rozhraní API linkeru.",
	"assets/variables.json.XCODE_SCHEME_ENABLE_GPU_API_VALIDATION": "Hodnota vlastnosti pro Metal: Ověření rozhraní API v části Možnosti vygenerovaného schématu Xcode.",
	"assets/variables.json.XCODE_SCHEME_ENABLE_GPU_FRAME_CAPTURE_MODE": "Hodnota vlastnosti pro zachytávání snímků GPU v části Možnosti vygenerovaného schématu Xcode. Příklady hodnot jsou Metal a Disabled.",
	"assets/variables.json.XCODE_SCHEME_ENABLE_GPU_SHADER_VALIDATION": "Hodnota vlastnosti pro Metal: Ověření shaderu v části Možnosti vygenerovaného schématu Xcode.",
	"assets/variables.json.XCODE_SCHEME_ENVIRONMENT": "Zadejte proměnné prostředí, které by se měly přidat do části Argument vygenerovaného schématu Xcode.",
	"assets/variables.json.XCODE_SCHEME_EXECUTABLE": "Zadejte cestu ke spustitelnému souboru v části Info vygenerovaného schématu Xcode. Pokud se tato cesta nenastaví, generátor schématu vybere aktuální cíl, pokud je možné ho spustit.",
	"assets/variables.json.XCODE_SCHEME_GUARD_MALLOC": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky povolit možnost Guard Malloc.",
	"assets/variables.json.XCODE_SCHEME_LAUNCH_CONFIGURATION": "Nastavte konfiguraci sestavení tak, aby se spustil cíl.",
	"assets/variables.json.XCODE_SCHEME_LAUNCH_MODE": "Hodnota vlastnosti Launch v oddílu Informace vygenerovaného schématu Xcode.",
	"assets/variables.json.XCODE_SCHEME_MAIN_THREAD_CHECKER_STOP": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu Diagnostics u Main Thread Checkeru povolit možnost Pause při potížích.",
	"assets/variables.json.XCODE_SCHEME_MALLOC_GUARD_EDGES": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky povolit možnost Malloc Guard Edges.",
	"assets/variables.json.XCODE_SCHEME_MALLOC_SCRIBBLE": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky povolit možnost Malloc Scribble.",
	"assets/variables.json.XCODE_SCHEME_MALLOC_STACK": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky povolit zásobník funkce Malloc.",
	"assets/variables.json.XCODE_SCHEME_THREAD_SANITIZER": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky povolit sanitizér vláken.",
	"assets/variables.json.XCODE_SCHEME_THREAD_SANITIZER_STOP": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky u Thread Sanitizeru povolit možnost pozastavení při potížích.",
	"assets/variables.json.XCODE_SCHEME_UNDEFINED_BEHAVIOUR_SANITIZER": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky povolit Undefined Behavior Sanitizer.",
	"assets/variables.json.XCODE_SCHEME_UNDEFINED_BEHAVIOUR_SANITIZER_STOP": "Určuje, jestli se má ve vygenerovaném schématu Xcode v oddílu diagnostiky u Undefined Behavior Sanitizeru povolit možnost pozastavení při potížích.",
	"assets/variables.json.XCODE_SCHEME_WORKING_DIRECTORY": "Umožňuje určit pracovní adresář akcí spuštění a profilu ve vygenerovaném schématu Xcode. V případě, že hodnota obsahuje výrazy generátoru, jsou tyto vyhodnoceny.",
	"assets/variables.json.XCODE_SCHEME_ZOMBIE_OBJECTS": "Určuje, jestli se mají ve vygenerovaném schématu Xcode v oddílu diagnostiky povolit zombie objekty.",
	"assets/variables.json.XCODE_XCCONFIG": "Pokud je tato možnost nastavená, generátor Xcode zaregistruje zadaný soubor jako soubor XCConfig na úrovni cíle. Pro globální soubory XCConfig se podívejte na proměnnou CMAKE_XCODE_XCCONFIG.",
	"assets/variables.json.XCTEST": "Tento cíl je XCTest CFBundle na Macu."
}