/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"assets/commands.json.add_compile_definitions": "Dodaj definicje preprocesora na potrzeby kompilowania plików źródłowych.",
	"assets/commands.json.add_compile_options": "Dodaj opcje na potrzeby kompilowania plików źródłowych.",
	"assets/commands.json.add_custom_command": "Dodaj niestandardową regułę kompilacji do wygenerowanego systemu kompilacji.",
	"assets/commands.json.add_custom_target": "Dodaj element docelowy bez danych wyjściowych, dzięki czemu będzie zawsze kompilowany.",
	"assets/commands.json.add_definitions": "Dodaj flagi definicji -D na potrzeby kompilowania plików źródłowych.",
	"assets/commands.json.add_dependencies": "Dodaj zależność między elementami docelowymi najwyższego poziomu.",
	"assets/commands.json.add_executable": "Dodaj plik wykonywalny do projektu przy użyciu określonych plików źródłowych.",
	"assets/commands.json.add_library": "Dodaj bibliotekę do projektu przy użyciu określonych plików źródłowych.",
	"assets/commands.json.add_link_options": "Dodaj opcje do kroku łączenia dla elementów docelowych pliku wykonywalnego, biblioteki udostępnionej lub biblioteki modułu w bieżącym katalogu i poniżej, które zostały dodane po wywołaniu tego polecenia.",
	"assets/commands.json.add_subdirectory": "Dodaj podkatalog do kompilacji.",
	"assets/commands.json.add_test": "Dodaj do projektu test uruchamiany przez narzędzie ctest.",
	"assets/commands.json.aux_source_directory": "Znajdź wszystkie pliki źródłowe w katalogu.",
	"assets/commands.json.block": "Oceń grupę poleceń z dedykowaną zmienną i/lub zakresem zasad.",
	"assets/commands.json.break": "Wyjście z otaczającej pętli foreach lub while.",
	"assets/commands.json.build_command": "Pobierz wiersz polecenia w celu skompilowania bieżącego projektu. Przeznaczone głównie do użytku wewnętrznego przez moduł CTest.",
	"assets/commands.json.build_name": "Niedozwolone od wersji 3.0. Zobacz zasady CMP0036 narzędzia CMake.",
	"assets/commands.json.cmake_file_api": "Umożliwia interakcję z interfejsem API pliku narzędzia CMake <cmake-file-api(7)>.",
	"assets/commands.json.cmake_host_system_information": "Wykonywanie zapytań dotyczących różnych informacji o systemie hosta.",
	"assets/commands.json.cmake_language": "Wywołaj metaoperacje na poleceniach narzędzia CMake.",
	"assets/commands.json.cmake_minimum_required": "Wymagaj minimalnej wersji narzędzia CMake.",
	"assets/commands.json.cmake_parse_arguments": "Przeanalizuj argumenty funkcji lub makra.",
	"assets/commands.json.cmake_path": "To polecenie służy do manipulowania ścieżkami. Obsługiwane są tylko syntaktyczne aspekty ścieżek, nie dochodzi do żadnej interakcji z żadnym z bazowych systemów plików. Ścieżka może reprezentować nieistniejącą ścieżkę lub nawet ścieżkę, która nie może istnieć w bieżącym systemie plików lub na bieżącej platformie. W przypadku operacji, które wchodzą w interakcję z systemem plików, zobacz polecenie file.",
	"assets/commands.json.cmake_policy": "Zarządzaj ustawieniami zasad programu CMake. Zobacz podręcznik elementu cmake-polices, aby poznać zdefiniowane zasady.",
	"assets/commands.json.configure_file": "Kopiowanie pliku do innej lokalizacji i modyfikowanie jego zawartości.",
	"assets/commands.json.continue": "Kontynuuj do góry otaczającej instrukcji foreach lub pętli while.",
	"assets/commands.json.create_test_sourcelist": "Utwórz program sterownika testowego łączący wiele małych testów w jeden plik wykonywalny. Jest to przydatne podczas kompilowania statycznych plików wykonywalnych za pomocą dużych bibliotek w celu zmniejszenia całkowitego wymaganego rozmiaru.",
	"assets/commands.json.ctest_build": "Wykonaj krok Build narzędzia CTest jako klient pulpitu nawigacyjnego.",
	"assets/commands.json.ctest_configure": "Wykonaj krok Configure narzędzia CTest jako klient pulpitu nawigacyjnego.",
	"assets/commands.json.ctest_coverage": "Wykonaj krok Coverage narzędzia CTest jako klient pulpitu nawigacyjnego.",
	"assets/commands.json.ctest_empty_binary_directory": "opróżnia katalog plików binarnych",
	"assets/commands.json.ctest_memcheck": "Wykonaj krok MemCheck narzędzia CTest jako klient pulpitu nawigacyjnego.",
	"assets/commands.json.ctest_read_custom_files": "czytaj pliki CTestCustom.",
	"assets/commands.json.ctest_run_script": "uruchamia skrypt ctest -S",
	"assets/commands.json.ctest_sleep": "usypia na pewien czas",
	"assets/commands.json.ctest_start": "Uruchamia testowanie dla danego modelu",
	"assets/commands.json.ctest_submit": "Wykonaj krok Submit narzędzia CTest jako klient pulpitu nawigacyjnego.",
	"assets/commands.json.ctest_test": "Wykonaj krok Test narzędzia CTest jako klient pulpitu nawigacyjnego.",
	"assets/commands.json.ctest_update": "Wykonaj krok Update narzędzia CTest jako klient pulpitu nawigacyjnego.",
	"assets/commands.json.ctest_upload": "Przekaż pliki do serwera pulpitu nawigacyjnego jako klient pulpitu nawigacyjnego.",
	"assets/commands.json.define_property": "Zdefiniuj i udokumentuj właściwości niestandardowe.",
	"assets/commands.json.else": "Rozpoczyna część else bloku if.",
	"assets/commands.json.elseif": "Rozpoczyna część elseif bloku if.",
	"assets/commands.json.enable_language": "Włącz języki (CXX/C/OBJC/OBJCXX/Fortran/itp.)",
	"assets/commands.json.enable_testing": "Włącz testowanie dla bieżącego katalogu i poniżej niego.",
	"assets/commands.json.endblock": "Kończy listę poleceń w bloku i usuwa zakresy utworzone przez polecenie bloku.",
	"assets/commands.json.endforeach": "Kończy listę poleceń w bloku foreach.",
	"assets/commands.json.endfunction": "Kończy listę poleceń w bloku function.",
	"assets/commands.json.endif": "Kończy listę poleceń w bloku if.",
	"assets/commands.json.endmacro": "Kończy listę poleceń w bloku macro.",
	"assets/commands.json.endwhile": "Kończy listę poleceń w bloku while.",
	"assets/commands.json.execute_process": "Wykonaj jeden lub więcej procesów podrzędnych.",
	"assets/commands.json.exec_program": "Uruchom program wykonywalny podczas przetwarzania pliku CMakeList.txt.",
	"assets/commands.json.export": "Eksportuj elementy docelowe lub pakiety dla projektów zewnętrznych, aby używać ich bezpośrednio z drzewa kompilacji bieżącego projektu bez instalacji.",
	"assets/commands.json.export_library_dependencies": "Niedozwolone od wersji 3.0. Zobacz zasady CMP0033 narzędzia CMake.",
	"assets/commands.json.file": "Polecenie do manipulowania plikami.",
	"assets/commands.json.find_file": "To polecenie jest używane do znalezienia pełnej ścieżki do pliku o podanej nazwie.",
	"assets/commands.json.find_library": "To polecenie jest używane do znalezienia biblioteki.",
	"assets/commands.json.find_package": "Znajdź pakiet (zwykle dostarczany przez element zewnętrzny projektu) i załaduj szczegóły dotyczące jego pakietu. Wywołania tego polecenia mogą być również przechwytywane przez dostawców zależności .",
	"assets/commands.json.find_path": "To polecenie jest używane do odnalezienia katalogu zawierającego nazwany plik.",
	"assets/commands.json.find_program": "To polecenie jest używane do znalezienia programu.",
	"assets/commands.json.fltk_wrap_ui": "Utwórz otoki interfejsów użytkownika pakietu narzędzi FLTK.",
	"assets/commands.json.foreach": "Oszacuj grupę poleceń dla każdej wartości na liście.",
	"assets/commands.json.function": "Rozpocznij rejestrowanie funkcji dla późniejszego wywołania jako polecenie.",
	"assets/commands.json.get_cmake_property": "Pobierz właściwość globalną wystąpienia narzędzia CMake.",
	"assets/commands.json.get_directory_property": "Pobierz właściwość zakresu DIRECTORY.",
	"assets/commands.json.get_filename_component": "Pobierz określony składnik pełnej nazwy pliku.",
	"assets/commands.json.get_property": "Pobierz właściwość.",
	"assets/commands.json.get_source_file_property": "Pobierz właściwość pliku źródłowego.",
	"assets/commands.json.get_target_property": "Pobierz właściwość z elementu docelowego.",
	"assets/commands.json.get_test_property": "Pobierz właściwość testu.",
	"assets/commands.json.if": "Warunkowo wykonaj grupę poleceń.",
	"assets/commands.json.include": "Załaduj i uruchom kod narzędzia CMake z pliku lub modułu.",
	"assets/commands.json.include_directories": "Dodaj katalogi plików dołączanych do kompilacji.",
	"assets/commands.json.include_external_msproject": "Dołącz zewnętrzny plik projektu Microsoft Project w obszarze roboczym.",
	"assets/commands.json.include_guard": "Zapewnia ochronę plików nagłówkowych dla pliku aktualnie przetwarzanego przez narzędzie CMake.",
	"assets/commands.json.include_regular_expression": "Ustaw wyrażenie regularne używane do sprawdzania zależności.",
	"assets/commands.json.install": "Określ reguły do uruchomienia w czasie instalacji.",
	"assets/commands.json.install_files": "To polecenie zostało zastąpione przez polecenie install. Udostępniono je w celu zapewnienia zgodności ze starszym kodem narzędzia CMake. Formularz FILES jest bezpośrednio zastępowany formularzem FILES polecenia install. Formularz regexp można wyrazić bardziej przystępnie przy użyciu formularza GLOB polecenia file.",
	"assets/commands.json.install_programs": "To polecenie zostało zastąpione przez polecenie install. Udostępniono je w celu zapewnienia zgodności ze starszym kodem narzędzia CMake. Formularz FILES jest bezpośrednio zastępowany formularzem PROGRAMS polecenia install. Formularz regexp można wyrazić bardziej przystępnie przy użyciu formularza GLOB polecenia file.",
	"assets/commands.json.install_targets": "To polecenie zostało zastąpione przez polecenie install. Udostępniono je w celu zapewnienia zgodności ze starszym kodem narzędzia CMake.",
	"assets/commands.json.link_directories": "Dodaj katalogi, w których konsolidator będzie szukać bibliotek.",
	"assets/commands.json.link_libraries": "Połącz biblioteki ze wszystkimi elementami docelowymi dodanymi później.",
	"assets/commands.json.list": "Operacje na listach rozdzielonych średnikami.",
	"assets/commands.json.load_cache": "Załaduj wartości z pamięci podręcznej narzędzia CMake innego projektu.",
	"assets/commands.json.load_command": "Niedozwolone od wersji 3.0. Zobacz zasady CMP0031 narzędzia CMake.",
	"assets/commands.json.macro": "Rozpocznij rejestrowanie makra dla późniejszego wywołania jako polecenie",
	"assets/commands.json.make_directory": "Tworzy określony katalog. Należy podać pełne ścieżki. Zostaną również utworzone wszystkie katalogi nadrzędne, które nie istnieją. Używaj ostrożnie.",
	"assets/commands.json.mark_as_advanced": "Oznacz zmienne w pamięci podręcznej narzędzia cmake jako zaawansowane.",
	"assets/commands.json.math": "Oblicz wyrażenie matematyczne.",
	"assets/commands.json.message": "Zarejestruj komunikat.",
	"assets/commands.json.option": "Podaj wartość logiczną, którą użytkownik może opcjonalnie wybrać.",
	"assets/commands.json.output_required_files": "Niedozwolone od wersji 3.0. Zobacz zasady CMP0032 narzędzia CMake.",
	"assets/commands.json.project": "Ustaw nazwę projektu.",
	"assets/commands.json.qt_wrap_cpp": "Ręcznie utwórz otoki platformy Qt.",
	"assets/commands.json.qt_wrap_ui": "Ręcznie utwórz otoki interfejsów użytkownika platformy Qt.",
	"assets/commands.json.remove": "Usuwa element VALUE ze zmiennej VAR. Jest to zwykle używane do usuwania wpisów z wektora (np. listy rozdzielanej średnikami). Element VALUE jest rozwinięty.",
	"assets/commands.json.remove_definitions": "Usuń flagi definicji -D dodane przez polecenie add_definitions.",
	"assets/commands.json.return": "Wróć z pliku, katalogu lub funkcji.",
	"assets/commands.json.separate_arguments": "Przekształć argumenty wiersza polecenia w listę rozdzieloną średnikami.",
	"assets/commands.json.set": "Ustaw zmienną normalną, pamięci podręcznej lub środowiska na podaną wartość. Zobacz dokumentację zmiennych cmake-language(7) w celu uzyskania informacji o zakresach i interakcji normalnych zmiennych i wpisów pamięci podręcznej.",
	"assets/commands.json.set_directory_properties": "Ustaw właściwości bieżącego katalogu i podkatalogów.",
	"assets/commands.json.set_property": "Ustaw właściwość o podanej nazwie w danym zakresie.",
	"assets/commands.json.set_source_files_properties": "Pliki źródłowe mogą mieć właściwości wpływające na sposób ich kompilacji.",
	"assets/commands.json.set_target_properties": "Elementy docelowe mogą mieć właściwości, które wpływają na sposób ich kompilacji.",
	"assets/commands.json.set_tests_properties": "Ustaw właściwość testów.",
	"assets/commands.json.site_name": "Ustaw daną zmienną na nazwę komputera.",
	"assets/commands.json.source_group": "Zdefiniuj grupowanie na potrzeby generowania plików źródłowych w projekcie środowiska IDE. Istnieją dwa różne podpisy do tworzenia grup źródłowych.",
	"assets/commands.json.string": "Operacje na ciągach.",
	"assets/commands.json.subdirs": "Dodaj listę podkatalogów do kompilacji.",
	"assets/commands.json.subdir_depends": "Niedozwolone od wersji 3.0. Zobacz zasady CMP0029 narzędzia CMake.",
	"assets/commands.json.target_compile_definitions": "Dodaj definicje kompilacji do elementu docelowego.",
	"assets/commands.json.target_compile_features": "Dodaj oczekiwane funkcje kompilatora do elementu docelowego.",
	"assets/commands.json.target_compile_options": "Dodaj opcje kompilacji do elementu docelowego.",
	"assets/commands.json.target_include_directories": "Dodaj katalogi plików nagłówkowych do elementu docelowego.",
	"assets/commands.json.target_link_directories": "Dodaj katalogi łączenia do elementu docelowego.",
	"assets/commands.json.target_link_libraries": "Określ biblioteki lub flagi do użycia podczas łączenia podanego elementu docelowego i/lub jego zależności. Wymagania dotyczące użycia z elementów docelowych dołączanej biblioteki będą propagowane. Wymagania dotyczące użycia zależności elementu docelowego wpływają na kompilację jego własnych źródeł.",
	"assets/commands.json.target_link_options": "Dodaj opcje do kroku konsolidacji dla elementu docelowego pliku wykonywalnego, biblioteki udostępnionej lub biblioteki modułu.",
	"assets/commands.json.target_precompile_headers": "Dodaj listę plików nagłówkowych do wstępnej kompilacji.",
	"assets/commands.json.target_sources": "Dodaj źródła do elementu docelowego.",
	"assets/commands.json.try_compile": "Spróbuj skompilować jakiś kod.",
	"assets/commands.json.try_run": "Spróbuj skompilować, a następnie uruchomić jakiś kod.",
	"assets/commands.json.unset": "Cofnij ustawienie zmiennej, zmiennej pamięci podręcznej lub zmiennej środowiskowej.",
	"assets/commands.json.use_mangled_mesa": "Niedozwolone od wersji 3.0. Zobacz zasady CMP0030 narzędzia CMake.",
	"assets/commands.json.utility_source": "Niedozwolone od wersji 3.0. Zobacz zasady CMP0034 narzędzia CMake.",
	"assets/commands.json.variable_requires": "Niedozwolone od wersji 3.0. Zobacz zasady CMP0035 narzędzia CMake.",
	"assets/commands.json.variable_watch": "Obserwuj zmiany zmiennej narzędzia CMake.",
	"assets/commands.json.while": "Oceń grupę poleceń, gdy warunek jest spełniony",
	"assets/commands.json.write_file": "Pierwszy argument to nazwa pliku, a pozostałe argumenty są komunikatami do zapisu. Jeśli zostanie określony argument APPEND, komunikat zostanie dołączony."
}