/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"assets/variables.json.ANDROID": "Ustaw wartość 1, jeśli system docelowy (CMAKE_SYSTEM_NAME) to Android.",
	"assets/variables.json.APPLE": "Ustaw na wartość True, jeśli systemem docelowym jest platforma firmy Apple (macOS, iOS, tvOS, visionOS lub watchOS).",
	"assets/variables.json.BORLAND": "Wartość true, jeśli jest używany kompilator firmy Borland.",
	"assets/variables.json.BSD": "Ustaw wartość ciągu, gdy system docelowy to BSD. Ta wartość może być jedną z następujących wartości: DragonFlyBSD, FreeBSD, OpenBSD lub NetBSD.",
	"assets/variables.json.BUILD_SHARED_LIBS": "Poinformuj add_library, aby domyślnie wybierała biblioteki WSPÓŁDZIELONE zamiast bibliotek STATYCZNYCH, gdy są wywoływane bez jawnego typu biblioteki.",
	"assets/variables.json.CACHE": "Operator do odczytywania zmiennych pamięci podręcznej.",
	"assets/variables.json.CMAKE_ABSOLUTE_DESTINATION_FILES": "Lista plików zainstalowanych przy użyciu ścieżki określonej przez właściwość ABSOLUTE DESTINATION.",
	"assets/variables.json.CMAKE_ADD_CUSTOM_COMMAND_DEPENDS_EXPLICIT_ONLY": "Określa, czy domyślnie włączyć opcję DEPENDS_EXPLICIT_ONLY w add_custom_command.",
	"assets/variables.json.CMAKE_ADSP_ROOT": "Gdy :ref:`Cross Compiling for ADSP SHARC/Blackfin`, ta zmienna przechowuje ścieżkę bezwzględną do najnowszej instalacji CCES lub VDSP++. Katalog powinien zawierać kompilatory cc21k.exe i ccblkfn.exe. Ta opcja zostanie ustawiona automatycznie, jeśli zostanie znaleziona domyślna instalacja programu CCES lub VDSP++.",
	"assets/variables.json.CMAKE_AIX_EXPORT_ALL_SYMBOLS": "Wartość domyślna właściwości AIX_EXPORT_ALL_SYMBOLS elementu docelowego. Ta zmienna jest używana do inicjowania właściwości dla każdego elementu docelowego podczas jego tworzenia.",
	"assets/variables.json.CMAKE_ANDROID_ANT_ADDITIONAL_OPTIONS": "Wartość domyślna właściwości docelowej ANDROID_ANT_ADDITIONAL_OPTIONS. Zobacz dokumentację tej właściwości docelowej, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_ANDROID_API": "Podczas kompilowania skrośnego dla systemu Android za pomocą programu NVIDIA Nsight Tegra Visual Studio Edition tę zmienną można ustawić w celu określenia wartości domyślnej właściwości docelowej ANDROID_API. Zobacz dokumentację tej właściwości docelowej, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_ANDROID_API_MIN": "Wartość domyślna właściwości docelowej ANDROID_API_MIN. Zobacz dokumentację tej właściwości docelowej, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_ANDROID_ARCH": "Podczas kompilowania skrośnego dla systemu Android za pomocą programu NVIDIA Nsight Tegra Visual Studio Edition tę zmienną można ustawić w celu określenia wartości domyślnej właściwości docelowej ANDROID_ARCH. Zobacz dokumentację tej właściwości docelowej, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_ANDROID_ARCH_ABI": "Podczas kompilowania skrośnego dla systemu Android ta zmienna określa architekturę docelową i interfejs ABI do użycia. Prawidłowe wartości to:",
	"assets/variables.json.CMAKE_ANDROID_ARM_MODE": "Jeśli podczas kompilowania skośnego dla systemu Android właściwość CMAKE_ANDROID_ARCH_ABI jest ustawiona na jedną z architektur armeabi, ustaw dla właściwości CMAKE_ANDROID_ARM_MODE wartość ON, aby określić jako platformę docelową 32-bitowe procesory ARM (-marm). W przeciwnym razie wartość domyślna określa jako platformę docelową 16-bitowe procesory Thumb (-mthumb).",
	"assets/variables.json.CMAKE_ANDROID_ARM_NEON": "Jeśli podczas kompilowania skrośnego dla systemu Android właściwość CMAKE_ANDROID_ARCH_ABI jest ustawiona na wartość armeabi-v7a, ustaw właściwość CMAKE_ANDROID_ARM_NEON na wartość ON, aby określić jako platformę docelową urządzenie z architekturą ARM NEON.",
	"assets/variables.json.CMAKE_ANDROID_ASSETS_DIRECTORIES": "Wartość domyślna właściwości docelowej ANDROID_ASSETS_DIRECTORIES. Zobacz dokumentację tej właściwości docelowej, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_ANDROID_EXCEPTIONS": "Podczas kompilowania skrośnego dla systemu Android za pomocą zestawu NDK można ustawić tę zmienną, aby określić, czy wyjątki są włączone.",
	"assets/variables.json.CMAKE_ANDROID_GUI": "Wartość domyślna właściwości docelowej ANDROID_GUI dla plików wykonywalnych. Zobacz dokumentację tej właściwości docelowej, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_ANDROID_JAR_DEPENDENCIES": "Wartość domyślna właściwości docelowej ANDROID_JAR_DEPENDENCIES. Zobacz dokumentację tej właściwości docelowej, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_ANDROID_JAR_DIRECTORIES": "Wartość domyślna właściwości docelowej ANDROID_JAR_DIRECTORIES. Zobacz dokumentację tej właściwości docelowej, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_ANDROID_JAVA_SOURCE_DIR": "Wartość domyślna właściwości docelowej ANDROID_JAVA_SOURCE_DIR. Zobacz dokumentację tej właściwości docelowej, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_ANDROID_NATIVE_LIB_DEPENDENCIES": "Wartość domyślna właściwości docelowej ANDROID_NATIVE_LIB_DEPENDENCIES. Zobacz dokumentację tej właściwości docelowej, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_ANDROID_NATIVE_LIB_DIRECTORIES": "Wartość domyślna właściwości docelowej ANDROID_NATIVE_LIB_DIRECTORIES. Zobacz dokumentację tej właściwości docelowej, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_ANDROID_NDK": "Podczas kompilowania krzyżowego dla systemu Android za pomocą zestawu NDK ta zmienna przechowuje bezwzględną ścieżkę katalogu głównego zestawu NDK. Katalog musi zawierać podkatalog platform z katalogami android-<api>.",
	"assets/variables.json.CMAKE_ANDROID_NDK_DEPRECATED_HEADERS": "Podczas kompilowania skrośnego dla systemu Android za pomocą zestawu NDK można ustawić tę zmienną, aby określić, czy mają być używane przestarzałe pliki nagłówkowe dla poszczególnych poziomów interfejsu API zamiast ujednoliconych plików nagłówkowych.",
	"assets/variables.json.CMAKE_ANDROID_NDK_TOOLCHAIN_HOST_TAG": "Podczas kompilowania skrośnego dla systemu Android za pomocą zestawu NDK ta zmienna zawiera „tag hosta” zestawu NDK używany do utworzenia ścieżki wstępnie skompilowanych łańcuchów narzędzi uruchamianych na hoście.",
	"assets/variables.json.CMAKE_ANDROID_NDK_TOOLCHAIN_VERSION": "Podczas kompilowania skrośnego dla systemu Android za pomocą zestawu NDK można ustawić tę zmienną, aby określić wersję łańcucha narzędzi do użycia jako kompilator.",
	"assets/variables.json.CMAKE_ANDROID_NDK_VERSION": "Podczas kompilowania skrośnego dla systemu Android za pomocą zestawu NDK i przy użyciu zestawu Android NDK w wersji 11 lub nowszej ta zmienna jest udostępniana przez narzędzie CMake do raportowania numeru wersji zestawu NDK.",
	"assets/variables.json.CMAKE_ANDROID_PROCESS_MAX": "Wartość domyślna właściwości docelowej ANDROID_PROCESS_MAX. Zobacz dokumentację tej właściwości docelowej, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_ANDROID_PROGUARD": "Wartość domyślna właściwości docelowej ANDROID_PROGUARD. Zobacz dokumentację tej właściwości docelowej, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_ANDROID_PROGUARD_CONFIG_PATH": "Wartość domyślna właściwości docelowej ANDROID_PROGUARD_CONFIG_PATH. Zobacz dokumentację tej właściwości docelowej, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_ANDROID_RTTI": "Podczas kompilowania skrośnego dla systemu Android za pomocą zestawu NDK można ustawić tę zmienną, aby określić, czy informacje RTTI są włączone.",
	"assets/variables.json.CMAKE_ANDROID_SECURE_PROPS_PATH": "Wartość domyślna właściwości docelowej ANDROID_SECURE_PROPS_PATH. Zobacz dokumentację tej właściwości docelowej, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_ANDROID_SKIP_ANT_STEP": "Wartość domyślna właściwości docelowej ANDROID_SKIP_ANT_STEP. Zobacz dokumentację tej właściwości docelowej, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_ANDROID_STANDALONE_TOOLCHAIN": "Podczas kompilowania skrośnego dla systemu Android za pomocą autonomicznego łańcucha narzędzi ta zmienna przechowuje bezwzględną ścieżkę katalogu głównego łańcucha narzędzi. Określony katalog musi zawierać podkatalog sysroot.",
	"assets/variables.json.CMAKE_ANDROID_STL_TYPE": "Podczas kompilowania skrośnego dla systemu Android za pomocą programu NVIDIA Nsight Tegra Visual Studio Edition tę zmienną można ustawić w celu określenia wartości domyślnej właściwości docelowej ANDROID_STL_TYPE. Zobacz dokumentację tej właściwości docelowej, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_APPBUNDLE_PATH": "Rozdzielona średnikami lista katalogów określająca ścieżkę wyszukiwania dla pakietów aplikacji systemu macOS używaną przez polecenia find_program i find_package.",
	"assets/variables.json.CMAKE_APPLE_SILICON_PROCESSOR": "W przypadku hostów z układem Apple Silicon i systemem macOS należy ustawić tę zmienną, aby poinformować narzędzie CMake o architekturze, która ma być używana dla elementu CMAKE_HOST_SYSTEM_PROCESSOR. Wartość musi być równa arm64 lub x86_64.",
	"assets/variables.json.CMAKE_AR": "Nazwa narzędzia do archiwizacji dla bibliotek statycznych.",
	"assets/variables.json.CMAKE_ARCHIVE_OUTPUT_DIRECTORY": "Miejsce, w którym podczas kompilacji zostaną umieszczone wszystkie pliki docelowe określone przez właściwość ARCHIVE.",
	"assets/variables.json.CMAKE_ARCHIVE_OUTPUT_DIRECTORY_CONFIG": "Miejsce, w którym podczas kompilacji pod kątem konkretnej konfiguracji zostaną umieszczone wszystkie pliki docelowe określone przez właściwość ARCHIVE.",
	"assets/variables.json.CMAKE_ARGC": "Liczba argumentów wiersza polecenia przekazanych do programu CMake w trybie skryptu.",
	"assets/variables.json.CMAKE_ARGV0": "Argument wiersza polecenia przekazany do programu CMake w trybie skryptu.",
	"assets/variables.json.CMAKE_AUTOGEN_BETTER_GRAPH_MULTI_CONFIG": "Ta zmienna służy do inicjowania właściwości AUTOGEN_BETTER_GRAPH_MULTI_CONFIG we wszystkich obiektach docelowych podczas ich tworzenia. Sprawdź właściwości elementu docelowego, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_AUTOGEN_COMMAND_LINE_LENGTH_MAX": "Limit długości wiersza polecenia dla elementów docelowych autogen, tj. moc lub uic, który wyzwala użycie plików odpowiedzi w systemie Windows zamiast przekazywania wszystkich argumentów do wiersza polecenia.",
	"assets/variables.json.CMAKE_AUTOGEN_ORIGIN_DEPENDS": "Przełącznik do przekierowania zależności docelowych źródeł do odpowiednich elementów docelowych <ORIGIN>_autogen.",
	"assets/variables.json.CMAKE_AUTOGEN_PARALLEL": "Liczba równoległych procesów moc lub uic do uruchomienia przez funkcje AUTOMOC i AUTOUIC.",
	"assets/variables.json.CMAKE_AUTOGEN_USE_SYSTEM_INCLUDE": "Ta zmienna służy do inicjowania właściwości AUTOGEN_USE_SYSTEM_INCLUDE we wszystkich elementach docelowych podczas ich tworzenia. Sprawdź właściwości elementu docelowego, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_AUTOGEN_VERBOSE": "Ustawia poziom szczegółowości dla funkcji AUTOMOC, AUTOUIC i AUTORCC. Dodatnia liczba całkowita lub wartość logiczna true umożliwia generatorom AUTO* umieszczenie w danych wyjściowych dodatkowych informacji dotyczących przetwarzania.",
	"assets/variables.json.CMAKE_AUTOMOC": "Określa, czy program moc jest obsługiwany automatycznie dla elementów docelowych platformy Qt.",
	"assets/variables.json.CMAKE_AUTOMOC_COMPILER_PREDEFINES": "Ta zmienna jest używana do inicjowania właściwości AUTOMOC_COMPILER_PREDEFINES dla wszystkich elementów docelowych. Zobacz dokumentację właściwości docelowej, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_AUTOMOC_DEPEND_FILTERS": "Filtruj definicje używane przez funkcję CMAKE_AUTOMOC do wyodrębniania z kodu źródłowego nazw plików będących dodatkowymi zależnościami pliku moc.",
	"assets/variables.json.CMAKE_AUTOMOC_EXECUTABLE": "Ta zmienna jest używana do inicjowania właściwości AUTOMOC_EXECUTABLE dla wszystkich elementów docelowych. Sprawdź właściwości elementu docelowego, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_AUTOMOC_MACRO_NAMES": "Lista rozdzielonych średnikami nazw makr używanych przez funkcję CMAKE_AUTOMOC do określenia, czy plik z kodem C++ wymaga przetworzenia przez program moc.",
	"assets/variables.json.CMAKE_AUTOMOC_MOC_OPTIONS": "Dodatkowe opcje programu moc w przypadku użycia właściwości CMAKE_AUTOMOC.",
	"assets/variables.json.CMAKE_AUTOMOC_PATH_PREFIX": "Określa, czy generować opcję prefiksu ścieżki -p dla programu moc na elementach docelowych platformy Qt z włączoną wartością logiczną AUTOMOC.",
	"assets/variables.json.CMAKE_AUTOMOC_RELAXED_MODE": "Przełącz między trybami ścisłym i swobodnym programu automoc.",
	"assets/variables.json.CMAKE_AUTORCC": "Określa, czy program rcc jest obsługiwany automatycznie dla elementów docelowych platformy Qt.",
	"assets/variables.json.CMAKE_AUTORCC_EXECUTABLE": "Ta zmienna jest używana do inicjowania właściwości AUTORCC_EXECUTABLE dla wszystkich elementów docelowych. Sprawdź właściwości elementu docelowego, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_AUTORCC_OPTIONS": "Dodatkowe opcje programu rcc w przypadku użycia właściwości CMAKE_AUTORCC.",
	"assets/variables.json.CMAKE_AUTOUIC": "Określa, czy program uic jest obsługiwany automatycznie dla elementów docelowych platformy Qt.",
	"assets/variables.json.CMAKE_AUTOUIC_EXECUTABLE": "Ta zmienna jest używana do inicjowania właściwości AUTOUIC_EXECUTABLE dla wszystkich elementów docelowych. Sprawdź właściwości elementu docelowego, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_AUTOUIC_OPTIONS": "Dodatkowe opcje programu uic w przypadku użycia właściwości CMAKE_AUTOUIC.",
	"assets/variables.json.CMAKE_AUTOUIC_SEARCH_PATHS": "Lista ścieżek wyszukiwania używana przez funkcję CMAKE_AUTOUIC na potrzeby wyszukiwania dołączonych plików ui.",
	"assets/variables.json.CMAKE_BACKWARDS_COMPATIBILITY": "Przestarzałe. Zobacz dokumentację zasad CMP0001 programu CMake.",
	"assets/variables.json.CMAKE_BINARY_DIR": "Ścieżka najwyższego poziomu drzewa kompilacji.",
	"assets/variables.json.CMAKE_BUILD_RPATH": "Rozdzielona średnikami lista pozycji ścieżki środowiska uruchomieniowego (RPATH) do dodania do plików binarnych łączonych w drzewie kompilacji (dotyczy obsługiwanych platform). Pozycje nie będą używane dla plików binarnych w drzewie instalacji. Zobacz też dokumentację zmiennej CMAKE_INSTALL_RPATH.",
	"assets/variables.json.CMAKE_BUILD_RPATH_USE_ORIGIN": "Określa, czy używać ścieżek względnych dla ścieżki RPATH kompilacji.",
	"assets/variables.json.CMAKE_BUILD_TOOL": "Ta zmienna istnieje tylko na potrzeby zapewnienia zgodności z poprzednimi wersjami. Zawiera tę samą wartość co właściwość CMAKE_MAKE_PROGRAM, której należy użyć.",
	"assets/variables.json.CMAKE_BUILD_TYPE": "Określa typ kompilacji w generatorach z pojedynczą konfiguracją (np. Generatory plików reguł programu Makefile lub Ninja). Typowe wartości to Debug, Release, RelWithDebInfo i MinSizeRel, ale można również zdefiniować niestandardowe typy kompilacji.",
	"assets/variables.json.CMAKE_BUILD_WITH_INSTALL_NAME_DIR": "Określa, czy używać właściwości INSTALL_NAME_DIR dla elementów docelowych w drzewie kompilacji.",
	"assets/variables.json.CMAKE_BUILD_WITH_INSTALL_RPATH": "Użyj ścieżki instalacji dla właściwości RPATH.",
	"assets/variables.json.CMAKE_CACHEFILE_DIR": "Ta zmienna jest używana wewnętrznie przez narzędzie CMake i nie może zostać ustawiona podczas pierwszej konfiguracji drzewa kompilacji. Gdy jest ustawiona, ma taką samą wartość jak CMAKE_BINARY_DIR. Użyj zamiast niej tej zmiennej.",
	"assets/variables.json.CMAKE_CACHE_MAJOR_VERSION": "Wersja główna programu CMake użytego do utworzenia pliku CMakeCache.txt",
	"assets/variables.json.CMAKE_CACHE_MINOR_VERSION": "Wersja pomocnicza programu CMake użytego do utworzenia pliku CMakeCache.txt",
	"assets/variables.json.CMAKE_CACHE_PATCH_VERSION": "Wersja poprawki programu CMake użytego do utworzenia pliku CMakeCache.txt",
	"assets/variables.json.CMAKE_CFG_INTDIR": "Odwołanie czasu kompilacji do podkatalogu wyjściowego dla konfiguracji.",
	"assets/variables.json.CMAKE_CLANG_VFS_OVERLAY": "Podczas kompilowania skrośnego dla systemu Windows za pomocą narzędzia clang-cl ta zmienna może być ścieżką bezwzględną wskazującą plik yaml wirtualnego systemu plików narzędzia clang, co umożliwi narzędziu clang-cl rozpoznawanie nazw nagłówków systemu Windows w systemie plików z rozróżnianiem wielkości liter.",
	"assets/variables.json.CMAKE_CL_64": "Niezalecane. Zamiast tego użyj właściwości CMAKE_SIZEOF_VOID_P.",
	"assets/variables.json.CMAKE_CODEBLOCKS_COMPILER_ID": "Zmień identyfikator kompilatora w wygenerowanych plikach projektu środowiska CodeBlocks.",
	"assets/variables.json.CMAKE_CODEBLOCKS_EXCLUDE_EXTERNAL_FILES": "Zmień sposób tworzenia plików projektu przez generator środowiska CodeBlocks.",
	"assets/variables.json.CMAKE_CODELITE_USE_TARGETS": "Zmień sposób tworzenia plików projektu przez generator środowiska CodeLite.",
	"assets/variables.json.CMAKE_COLOR_DIAGNOSTICS": "Włącz diagnostykę kolorów w całym środowisku.",
	"assets/variables.json.CMAKE_COLOR_MAKEFILE": "Włącz kolory dla danych wyjściowych podczas używania generatorów plików Makefile.",
	"assets/variables.json.CMAKE_COMMAND": "Pełna ścieżka pliku wykonywalnego programu cmake.",
	"assets/variables.json.CMAKE_COMPILER_2005": "Użycie kompilatora Visual Studio 2005 firmy Microsoft",
	"assets/variables.json.CMAKE_COMPILER_IS_GNUCC": "Wartość True (Prawda), jeśli kompilator języka C ma wartość GNU.",
	"assets/variables.json.CMAKE_COMPILER_IS_GNUCXX": "Wartość True (Prawda), jeśli kompilator języka C++ (CXX) ma wartość GNU.",
	"assets/variables.json.CMAKE_COMPILER_IS_GNUG77": "Wartość True (Prawda), jeśli kompilator Fortran ma wartość GNU.",
	"assets/variables.json.CMAKE_COMPILE_PDB_OUTPUT_DIRECTORY": "Katalog wyjściowy plików pdb symboli debugowania firmy Microsoft wygenerowanych przez kompilator podczas kompilowania plików źródłowych.",
	"assets/variables.json.CMAKE_COMPILE_PDB_OUTPUT_DIRECTORY_CONFIG": "Katalog wyjściowy określony dla konfiguracji i zawierający pliki pdb symboli debugowania firmy Microsoft wygenerowane przez kompilator podczas kompilowania plików źródłowych.",
	"assets/variables.json.CMAKE_COMPILE_WARNING_AS_ERROR": "Określ, czy ostrzeżenia podczas kompilacji mają być traktowane jako błędy.",
	"assets/variables.json.CMAKE_CONFIGURATION_TYPES": "Określa dostępne typy kompilacji (konfiguracje) w generatorach z wieloma konfiguracjami (np. Visual Studio, Xcode lub Ninja Multi-Config) jako listę rozdzielaną średnikami. Typowe wpisy to Debug, Release, RelWithDebInfo i MinSizeRel, ale można również zdefiniować niestandardowe typy kompilacji.",
	"assets/variables.json.CMAKE_CONFIG_POSTFIX": "Domyślny sufiks nazwy pliku dla bibliotek w ramach konfiguracji <CONFIG>.",
	"assets/variables.json.CMAKE_CPACK_COMMAND": "Pełna ścieżka polecenia cpack zainstalowanego z programem CMake.",
	"assets/variables.json.CMAKE_CROSSCOMPILING": "Ta zmienna jest ustawiana przez narzędzie CMake w celu wskazywania, czy jest kompilowana skrośnie, ale weź pod uwagę ograniczenia omówione poniżej.",
	"assets/variables.json.CMAKE_CROSSCOMPILING_EMULATOR": "Ta zmienna jest używana tylko wtedy, gdy właściwość CMAKE_CROSSCOMPILING ma wartość ON. Powinna ona wskazywać polecenie w systemie hosta, które może uruchomić plik wykonywalny skompilowany dla systemu docelowego.",
	"assets/variables.json.CMAKE_CROSS_CONFIGS": "Określa rozdzielaną średnikami listę konfiguracji dostępnych ze wszystkich plików build-<Config>.ninja w generatorze Ninja Multi-Config. Ta zmienna aktywuje tryb konfiguracji krzyżowej. Elementy docelowe z każdej konfiguracji określonej w tej zmiennej mogą być kompilowane z dowolnego pliku build-<Config>.ninja. Polecenia niestandardowe będą używać konfiguracji natywnej dla pliku build-<Config>.ninja. Jeśli zostanie ustawiona na wartość „all”, wszystkie konfiguracje z właściwości CMAKE_CONFIGURATION_TYPES będą konfiguracjami krzyżowymi. Jeśli nie jest określona lub jest pusta, każdy plik build-<Config>.ninja będzie zawierać tylko reguły kompilacji dla własnej konfiguracji.",
	"assets/variables.json.CMAKE_CTEST_ARGUMENTS": "Ustaw rodzielaną średnikami listę argumentów wiersza polecenia do przekazania do narzędzia ctest podczas uruchamiania testów za pośrednictwem elementu docelowego testu (lub polecenia RUN_TESTS) wygenerowanego systemu kompilacji.",
	"assets/variables.json.CMAKE_CTEST_COMMAND": "Pełna ścieżka polecenia ctest zainstalowanego z programem CMake.",
	"assets/variables.json.CMAKE_CUDA_ARCHITECTURES": "Wartość domyślna właściwości CUDA_ARCHITECTURES elementów docelowych.",
	"assets/variables.json.CMAKE_CUDA_COMPILE_FEATURES": "Lista funkcji znanych kompilatorowi języka CUDA",
	"assets/variables.json.CMAKE_CUDA_EXTENSIONS": "Wartość domyślna dla właściwości docelowej CUDA_EXTENSIONS, jeśli ustawiona podczas tworzenia obiektu docelowego.",
	"assets/variables.json.CMAKE_CUDA_HOST_COMPILER": "To jest oryginalna nazwa specyficzna dla języka CUDA dla bardziej ogólnej zmiennej CMAKE_<LANG>_HOST_COMPILER. Zobacz ten ostatni, aby uzyskać szczegółowe informacje.",
	"assets/variables.json.CMAKE_CUDA_RESOLVE_DEVICE_SYMBOLS": "Wartość domyślna właściwości CUDA_RESOLVE_DEVICE_SYMBOLS obiektu docelowego po zdefiniowaniu. Domyślnie ta zmienna nie jest zdefiniowana.",
	"assets/variables.json.CMAKE_CUDA_RUNTIME_LIBRARY": "Wybierz bibliotekę środowiska wykonawczego CUDA do użycia podczas kompilowania i konsolidowania kodu języka CUDA. Ta zmienna jest używana do inicjowania właściwości CUDA_RUNTIME_LIBRARY we wszystkich elementach docelowych podczas ich tworzenia.",
	"assets/variables.json.CMAKE_CUDA_SEPARABLE_COMPILATION": "Wartość domyślna właściwości docelowej CUDA_SEPARABLE_COMPILATION. Ta zmienna jest używana do inicjowania właściwości każdego elementu docelowego podczas jego tworzenia.",
	"assets/variables.json.CMAKE_CUDA_STANDARD": "Wartość domyślna dla właściwości docelowej CUDA_STANDARD, jeśli jest ustawiona podczas tworzenia obiektu docelowego.",
	"assets/variables.json.CMAKE_CUDA_STANDARD_REQUIRED": "Wartość domyślna dla właściwości docelowej CUDA_STANDARD_REQUIRED, jeśli jest ustawiona podczas tworzenia obiektu docelowego.",
	"assets/variables.json.CMAKE_CUDA_TOOLKIT_INCLUDE_DIRECTORIES": "Po włączeniu języka CUDA jest to rozdzielona średnikami lista katalogów plików dołączanych udostępnionych przez zestaw CUDA Toolkit. Wartość może być przydatna w przypadku plików źródłowych języka C++ na potrzeby dołączania plików nagłówkowych technologii CUDA.",
	"assets/variables.json.CMAKE_CURRENT_BINARY_DIR": "Ścieżka aktualnie przetwarzanego katalogu plików binarnych.",
	"assets/variables.json.CMAKE_CURRENT_FUNCTION": "W przypadku wykonywania kodu wewnątrz funkcji ta zmienna zawiera nazwę bieżącej funkcji. Może to być przydatne w przypadku komunikatów diagnostycznych i debugowania.",
	"assets/variables.json.CMAKE_CURRENT_FUNCTION_LIST_DIR": "W przypadku wykonywania kodu wewnątrz funkcji ta zmienna zawiera pełen katalog listy plików, która definiuje bieżącą funkcję.",
	"assets/variables.json.CMAKE_CURRENT_FUNCTION_LIST_FILE": "W przypadku wykonywania kodu wewnątrz funkcji ta zmienna zawiera pełną ścieżkę do listy plików, która definiuje bieżącą funkcję.",
	"assets/variables.json.CMAKE_CURRENT_FUNCTION_LIST_LINE": "W przypadku wykonywania kodu wewnątrz funkcji ta zmienna zawiera numer wiersza na liście plików, w której została zdefiniowana bieżąca funkcja.",
	"assets/variables.json.CMAKE_CURRENT_LIST_DIR": "Pełny katalog aktualnie przetwarzanego pliku listfile.",
	"assets/variables.json.CMAKE_CURRENT_LIST_FILE": "Pełna ścieżka aktualnie przetwarzanego pliku listfile.",
	"assets/variables.json.CMAKE_CURRENT_LIST_LINE": "Numer wiersza aktualnie przetwarzanego pliku.",
	"assets/variables.json.CMAKE_CURRENT_SOURCE_DIR": "Ścieżka aktualnie przetwarzanego katalogu źródłowego.",
	"assets/variables.json.CMAKE_CXX_COMPILER_IMPORT_STD": "Lista standardowych poziomów języka C++, dla których istnieje obsługa importu standardowego dla bieżącego łańcucha narzędzi języka C++. Obsługa języka C++<NN> może zostać wykryta przy użyciu <NN> predykatu IN_LIST CMAKE_CXX_COMPILER_IMPORT_STD z poleceniem if.",
	"assets/variables.json.CMAKE_CXX_COMPILE_FEATURES": "Lista funkcji znanych kompilatorowi języka C++",
	"assets/variables.json.CMAKE_CXX_EXTENSIONS": "Wartość domyślna dla właściwości docelowej CXX_EXTENSIONS, jeśli jest ustawiona podczas tworzenia obiektu docelowego.",
	"assets/variables.json.CMAKE_CXX_MODULE_STD": "Określa, czy dodać cele narzędzi jako zależności do elementów docelowych z co najmniej cxx_std_23.",
	"assets/variables.json.CMAKE_CXX_SCAN_FOR_MODULES": "Określa, czy skanować pliki źródłowe języka C++ pod kątem zależności modułu.",
	"assets/variables.json.CMAKE_CXX_STANDARD": "Wartość domyślna dla właściwości docelowej CXX_STANDARD, jeśli jest ustawiona podczas tworzenia obiektu docelowego.",
	"assets/variables.json.CMAKE_CXX_STANDARD_REQUIRED": "Wartość domyślna dla właściwości docelowej CXX_STANDARD_REQUIRED, jeśli jest ustawiona podczas tworzenia obiektu docelowego.",
	"assets/variables.json.CMAKE_C_COMPILE_FEATURES": "Lista funkcji znanych kompilatorowi języka C",
	"assets/variables.json.CMAKE_C_EXTENSIONS": "Wartość domyślna dla właściwości docelowej C_EXTENSIONS, jeśli jest ustawiona podczas tworzenia obiektu docelowego.",
	"assets/variables.json.CMAKE_C_STANDARD": "Wartość domyślna dla właściwości docelowej C_STANDARD, jeśli jest ustawiona podczas tworzenia obiektu docelowego.",
	"assets/variables.json.CMAKE_C_STANDARD_REQUIRED": "Wartość domyślna dla właściwości docelowej C_STANDARD_REQUIRED, jeśli jest ustawiona podczas tworzenia obiektu docelowego.",
	"assets/variables.json.CMAKE_DEBUG_POSTFIX": "Sprawdź zmienną CMAKE_<CONFIG>_POSTFIX.",
	"assets/variables.json.CMAKE_DEBUG_TARGET_PROPERTIES": "Włącza śledzenie danych wyjściowych dla właściwości docelowych.",
	"assets/variables.json.CMAKE_DEFAULT_BUILD_TYPE": "Określa konfigurację, która ma być domyślnie używana w pliku build.ninja w generatorze Ninja Multi-Config. Jeśli ta zmienna jest określona, plik build.ninja będzie domyślnie używać reguł kompilacji z pliku build-<Config>.ninja. W ramach tej konfiguracji używane są wszystkie polecenia niestandardowe. Jeśli zmienna nie jest określona, zamiast tego będzie używany pierwszy element z właściwości CMAKE_CONFIGURATION_TYPES.",
	"assets/variables.json.CMAKE_DEFAULT_CONFIGS": "Określa rozdzielaną średnikami listę konfiguracji do skompilowania dla elementu docelowego w pliku build.ninja, jeśli nie określono sufiksu :<Config> w generatorze Ninja Multi-Config. Jeśli jest ustawiona na wartość „all”, używane będą wszystkie konfiguracje z właściwości CMAKE_CROSS_CONFIGS. Jeśli nie jest określona, wartością domyślną jest CMAKE_DEFAULT_BUILD_TYPE.",
	"assets/variables.json.CMAKE_DEPENDS_IN_PROJECT_ONLY": "Jeśli ma wartość TRUE w katalogu, system kompilacji utworzony przez generatory plików Makefile jest skonfigurowany pod kątem uwzględniania tylko zależności od plików źródłowych występujących w katalogach plików źródłowych lub binarnych. Zmiany wprowadzone w plikach źródłowych poza tymi katalogami nie powodują ponownego kompilowania.",
	"assets/variables.json.CMAKE_DEPENDS_USE_COMPILER": "W przypadku generatorów plików reguł programu make zależności źródłowe są teraz generowane przez sam kompilator (dla wybranych kompilatorów). Definiując tę zmienną z wartością FALSE, możesz przywrócić starsze zachowanie (tj. używać narzędzia CMAKE do odnajdywania zależności).",
	"assets/variables.json.CMAKE_DIRECTORY_LABELS": "Określ etykiety dla bieżącego katalogu.",
	"assets/variables.json.CMAKE_DISABLE_FIND_PACKAGE_PackageName": "Zmienna umożliwiająca wyłączenie wywołań funkcji find_package.",
	"assets/variables.json.CMAKE_DISABLE_PRECOMPILE_HEADERS": "Wartość domyślna dla właściwości DISABLE_PRECOMPILE_HEADERS elementów docelowych.",
	"assets/variables.json.CMAKE_DLL_NAME_WITH_SOVERSION": "Ta zmienna jest używana do inicjowania właściwości DLL_NAME_WITH_SOVERSION w elementach docelowych biblioteki udostępnionej dla platformy systemu Windows, która jest wybierana, gdy zmienna WIN32 jest ustawiona.",
	"assets/variables.json.CMAKE_DL_LIBS": "Nazwa biblioteki zawierającej funkcje dlopen i dlclose.",
	"assets/variables.json.CMAKE_DOTNET_SDK": "Wartość domyślna właściwości DOTNET_SDK elementów docelowych.",
	"assets/variables.json.CMAKE_DOTNET_TARGET_FRAMEWORK": "Wartość domyślna właściwości DOTNET_TARGET_FRAMEWORK elementów docelowych.",
	"assets/variables.json.CMAKE_DOTNET_TARGET_FRAMEWORK_VERSION": "Wartość domyślna właściwości DOTNET_TARGET_FRAMEWORK_VERSION elementów docelowych.",
	"assets/variables.json.CMAKE_ECLIPSE_GENERATE_LINKED_RESOURCES": "Ta zmienna pamięci podręcznej jest używana przez generator projektów środowiska Eclipse. Zobacz opis elementu cmake-generators.",
	"assets/variables.json.CMAKE_ECLIPSE_GENERATE_SOURCE_PROJECT": "Ta zmienna pamięci podręcznej jest używana przez generator projektów środowiska Eclipse. Zobacz opis elementu cmake-generators.",
	"assets/variables.json.CMAKE_ECLIPSE_MAKE_ARGUMENTS": "Ta zmienna pamięci podręcznej jest używana przez generator projektów środowiska Eclipse. Zobacz opis elementu cmake-generators.",
	"assets/variables.json.CMAKE_ECLIPSE_RESOURCE_ENCODING": "Ta zmienna pamięci podręcznej informuje generator projektu Eclipse CDT4, aby ustawić kodowanie zasobów na daną wartość w wygenerowanych plikach projektu. Jeśli nie zostanie podana wartość, kodowanie nie zostanie ustawione.",
	"assets/variables.json.CMAKE_ECLIPSE_VERSION": "Ta zmienna pamięci podręcznej jest używana przez generator projektów środowiska Eclipse. Zobacz opis elementu cmake-generators.",
	"assets/variables.json.CMAKE_EDIT_COMMAND": "Pełna ścieżka do elementu cmake-gui lub ccmake. Zdefiniowane tylko dla generatorów plików reguł programu Makefile i generatorów Ninja, gdy nie są używane żadne dodatkowe generatory.",
	"assets/variables.json.CMAKE_ENABLE_EXPORTS": "Określ, czy pliki wykonywalne eksportują symbole dla ładowalnych modułów.",
	"assets/variables.json.CMAKE_ERROR_DEPRECATED": "Określa, czy dla przestarzałych funkcji są zgłaszane błędy.",
	"assets/variables.json.CMAKE_ERROR_ON_ABSOLUTE_INSTALL_DESTINATION": "Zażądaj od skryptu cmake_install.cmake zgłaszania błędu po napotkaniu pliku z właściwością INSTALL DESTINATION określającą ścieżkę bezwzględną.",
	"assets/variables.json.CMAKE_EXECUTABLE_ENABLE_EXPORTS": "Określ, czy pliki wykonywalne eksportują symbole dla ładowalnych modułów.",
	"assets/variables.json.CMAKE_EXECUTABLE_SUFFIX": "Sufiks plików wykonywalnych na tej platformie.",
	"assets/variables.json.CMAKE_EXECUTABLE_SUFFIX_LANG": "Sufiks, który ma być używany na końcu nazwy pliku wykonywalnego architektury docelowej kompilatora <LANG>, jeśli istnieje.",
	"assets/variables.json.CMAKE_EXECUTE_PROCESS_COMMAND_ECHO": "Jeśli dla tej zmiennej zostanie ustawiona wartość STDERR, STDOUT lub NONE, polecenia w wywołaniach execute_process będa wypisywane do właściwości stderr lub stdout albo nie będą wypisywane wcale.",
	"assets/variables.json.CMAKE_EXE_LINKER_FLAGS": "Flagi konsolidatora do użycia na potrzeby tworzenia plików wykonywalnych.",
	"assets/variables.json.CMAKE_EXE_LINKER_FLAGS_CONFIG": "Flagi do użycia podczas łączenia pliku wykonywalnego.",
	"assets/variables.json.CMAKE_EXE_LINKER_FLAGS_CONFIG_INIT": "Wartość używana do inicjowania pozycji pamięci podręcznej CMAKE_EXE_LINKER_FLAGS_ podczas pierwszego konfigurowania drzewa kompilacji. Tę zmienną ma ustawić plik łańcucha narzędzi. Program CMake może dołączyć zawartość na początku lub na końcu wartości na podstawie środowiska i platformy docelowej.",
	"assets/variables.json.CMAKE_EXE_LINKER_FLAGS_INIT": "Wartość używana do inicjowania pozycji pamięci podręcznej CMAKE_EXE_LINKER_FLAGS podczas pierwszego konfigurowania drzewa kompilacji. Tę zmienną ma ustawić plik łańcucha narzędzi. Program CMake może dołączyć zawartość na początku lub na końcu wartości na podstawie środowiska i platformy docelowej.",
	"assets/variables.json.CMAKE_EXPORT_COMPILE_COMMANDS": "Włącz/wyłącz dane wyjściowe poleceń kompilacji podczas generowania.",
	"assets/variables.json.CMAKE_EXPORT_FIND_PACKAGE_NAME": "Inicjuje wartość EXPORT_FIND_PACKAGE_NAME.",
	"assets/variables.json.CMAKE_EXPORT_NO_PACKAGE_REGISTRY": "Wyłącz polecenie eksportowania, gdy zasady CMP0090 nie mają ustawienia NEW.",
	"assets/variables.json.CMAKE_EXPORT_PACKAGE_REGISTRY": "Włącza polecenie eksportu, gdy zasady CMP0090 mają ustawienie NEW.",
	"assets/variables.json.CMAKE_EXTRA_GENERATOR": "Dodatkowy generator używany do kompilowania projektu. Zobacz dokumentację elementu cmake-generators.",
	"assets/variables.json.CMAKE_EXTRA_SHARED_LIBRARY_SUFFIXES": "Dodatkowe sufiksy udostępnionych bibliotek.",
	"assets/variables.json.CMAKE_FIND_APPBUNDLE": "Ta zmienna wpływa na to, jak polecenia find_* wybierają między pakietami aplikacji systemu macOS a składnikami pakietów typu unix.",
	"assets/variables.json.CMAKE_FIND_DEBUG_MODE": "Wypisuj dodatkowe informacje o znajdowaniu wywołania dla następujących poleceń do błędu standardowego:",
	"assets/variables.json.CMAKE_FIND_FRAMEWORK": "Ta zmienna wpływa na to, jak polecenia find_* wybierają między strukturami systemu macOS a składnikami pakietów typu unix.",
	"assets/variables.json.CMAKE_FIND_LIBRARY_CUSTOM_LIB_SUFFIX": "Określ element <suffix>, aby wskazać, że polecenie find_library ma wyszukiwać najpierw w katalogu lib<suffix>, a potem we wszystkich zwykle przeszukiwanych katalogach lib.",
	"assets/variables.json.CMAKE_FIND_LIBRARY_PREFIXES": "Prefiksy do dołączenia na początku podczas wyszukiwania bibliotek.",
	"assets/variables.json.CMAKE_FIND_LIBRARY_SUFFIXES": "Sufiksy do dołączenia na końcu podczas wyszukiwania bibliotek.",
	"assets/variables.json.CMAKE_FIND_NO_INSTALL_PREFIX": "Wyklucz wartości zmiennych CMAKE_INSTALL_PREFIX i CMAKE_STAGING_PREFIX z właściwości CMAKE_SYSTEM_PREFIX_PATH. Program CMake domyślnie dodaje prefiksy celu projektu do właściwości CMAKE_SYSTEM_PREFIX_PATH na potrzeby obsługi kompilowania serii zależnych pakietów i instalowania ich w ramach wspólnego prefiksu. Ustaw właściwość CMAKE_FIND_NO_INSTALL_PREFIX na wartość TRUE, aby uniknąć tego zachowania.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_NAME": "Zdefiniowane przez polecenie find_package podczas ładowania modułu find w celu zarejestrowania nazwy pakietu określonej przez obiekt wywołujący. Zobacz dokumentację polecenia, aby uzyskać szczegółowe informacje.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_NO_PACKAGE_REGISTRY": "Domyślnie ta zmienna nie jest ustawiona. Jeśli nie zostanie ustawiona właściwość CMAKE_FIND_USE_PACKAGE_REGISTRY ani CMAKE_FIND_PACKAGE_NO_PACKAGE_REGISTRY, funkcja find_package() użyje rejestru pakietów użytkownika, chyba że zostanie podana opcja NO_CMAKE_PACKAGE_REGISTRY.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_NO_SYSTEM_PACKAGE_REGISTRY": "Domyślnie ta zmienna nie jest ustawiona. Jeśli nie zostanie ustawiona właściwość CMAKE_FIND_USE_SYSTEM_PACKAGE_REGISTRY ani CMAKE_FIND_PACKAGE_NO_SYSTEM_PACKAGE_REGISTRY, funkcja find_package() użyje systemowego rejestru pakietów, chyba że zostanie podana opcja NO_CMAKE_SYSTEM_PACKAGE_REGISTRY.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_PREFER_CONFIG": "Poinstruuj funkcję find_package, aby wypróbowała tryb „Config” przed trybem „Module”, jeśli nie określono żadnego trybu.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_REDIRECTS_DIR": "Ta zmienna tylko do odczytu określa katalog, który polecenie find_package najpierw sprawdzi przed wyszukaniem w innym miejscu pliku modułu lub pliku pakietu konfiguracji. Plik pakietu konfiguracji w tym katalogu zawsze będzie znajdować się według preferencji każdego innego pliku modułu Find lub pliku pakietu konfiguracji.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_RESOLVE_SYMLINKS": "Ustaw na wartość TRUE, aby poinstruować wywołania funkcji find_package, aby rozpoznawały linki symboliczne w wartości zmiennej <PackageName>_DIR.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_SORT_DIRECTION": "Kierunek sortowania używany przez właściwość CMAKE_FIND_PACKAGE_SORT_ORDER. Może on przyjąć jedną z następujących wartości:",
	"assets/variables.json.CMAKE_FIND_PACKAGE_SORT_ORDER": "Domyślna kolejność sortowania pakietów znalezionych za pomocą funkcji find_package. Może przyjąć jedną z następujących wartości:",
	"assets/variables.json.CMAKE_FIND_PACKAGE_TARGETS_GLOBAL": "Ustawienie wartości TRUE podwyższa poziom wszystkich zaimportowanych elementów docelowych odnalezionych przez find_package do zakresu GLOBALNEGO.",
	"assets/variables.json.CMAKE_FIND_PACKAGE_WARN_NO_MODULE": "Nakazuje funkcji find_package zgłoszenie ostrzeżenia w przypadku wywołania bez trybu jawnego.",
	"assets/variables.json.CMAKE_FIND_ROOT_PATH": "Lista rozdzielonych średnikami ścieżek głównych dla wyszukiwania w systemie plików.",
	"assets/variables.json.CMAKE_FIND_ROOT_PATH_MODE_INCLUDE": "Ta zmienna określa, czy właściwości CMAKE_FIND_ROOT_PATH i CMAKE_SYSROOT są używane przez polecenia FIND_XXX.",
	"assets/variables.json.CMAKE_FIND_ROOT_PATH_MODE_LIBRARY": "Ta zmienna określa, czy właściwości CMAKE_FIND_ROOT_PATH i CMAKE_SYSROOT są używane przez polecenia FIND_XXX.",
	"assets/variables.json.CMAKE_FIND_ROOT_PATH_MODE_PACKAGE": "Ta zmienna określa, czy właściwości CMAKE_FIND_ROOT_PATH i CMAKE_SYSROOT są używane przez polecenia FIND_XXX.",
	"assets/variables.json.CMAKE_FIND_ROOT_PATH_MODE_PROGRAM": "Ta zmienna określa, czy właściwości CMAKE_FIND_ROOT_PATH i CMAKE_SYSROOT są używane przez polecenia FIND_XXX.",
	"assets/variables.json.CMAKE_FIND_USE_CMAKE_ENVIRONMENT_PATH": "Steruje domyślnym zachowaniem następujących poleceń dotyczącym tego, czy mają być wyszukiwane ścieżki podane przez zmienne środowiskowe specyficzne dla narzędzia CMake:",
	"assets/variables.json.CMAKE_FIND_USE_CMAKE_PATH": "Steruje domyślnym zachowaniem następujących poleceń dotyczącym tego, czy mają być wyszukiwane ścieżki podane przez zmienne pamięci podręcznej specyficzne dla narzędzia CMake:",
	"assets/variables.json.CMAKE_FIND_USE_CMAKE_SYSTEM_PATH": "Steruje domyślnym zachowaniem następujących poleceń dotyczącym tego, czy mają być wyszukiwane ścieżki podane przez zmienne narzędzia CMake specyficzne dla platformy:",
	"assets/variables.json.CMAKE_FIND_USE_INSTALL_PREFIX": "Określa domyślne zachowanie następujących poleceń dotyczące tego, czy mają być przeszukiwane lokalizacje w zmiennych CMAKE_INSTALL_PREFIX i CMAKE_STAGING_PREFIX.",
	"assets/variables.json.CMAKE_FIND_USE_PACKAGE_REGISTRY": "Steruje domyślnym zachowaniem polecenia find_package dotyczącym tego, czy mają być wyszukiwane ścieżki podane przez rejestr pakietów użytkownika:",
	"assets/variables.json.CMAKE_FIND_USE_PACKAGE_ROOT_PATH": "Określa domyślne zachowanie następujących poleceń dotyczącym tego, czy mają być wyszukiwane ścieżki podane przez zmienne <PackageName>_ROOT:",
	"assets/variables.json.CMAKE_FIND_USE_SYSTEM_ENVIRONMENT_PATH": "Steruje domyślnym zachowaniem następujących poleceń dotyczącym tego, czy mają być wyszukiwane ścieżki podane przez standardowe zmienne środowiskowe systemu:",
	"assets/variables.json.CMAKE_FIND_USE_SYSTEM_PACKAGE_REGISTRY": "Steruje przeszukiwaniem systemowego rejestru pakietów przez polecenie find_package.",
	"assets/variables.json.CMAKE_FOLDER": "Ustaw nazwę folderu. Służy ona do organizowania elementów docelowych w środowisku IDE.",
	"assets/variables.json.CMAKE_Fortran_FORMAT": "Ustaw na wartość FIXED lub FREE, aby wskazać układ kodu źródłowego w języku Fortran.",
	"assets/variables.json.CMAKE_Fortran_MODDIR_DEFAULT": "Domyślny katalog wyjściowy modułu dla języka Fortran.",
	"assets/variables.json.CMAKE_Fortran_MODDIR_FLAG": "Flaga języka Fortran dla katalogu wyjściowego modułu.",
	"assets/variables.json.CMAKE_Fortran_MODOUT_FLAG": "Flaga języka Fortran włączająca dane wyjściowe modułu.",
	"assets/variables.json.CMAKE_Fortran_MODULE_DIRECTORY": "Katalog wyjściowy modułu języka Fortran.",
	"assets/variables.json.CMAKE_Fortran_PREPROCESS": "Wartość domyślna dla właściwości Fortran_PREPROCESS elementów docelowych.",
	"assets/variables.json.CMAKE_FRAMEWORK": "Wartość domyślna dla właściwości FRAMEWORK elementów docelowych.",
	"assets/variables.json.CMAKE_FRAMEWORK_MULTI_CONFIG_POSTFIX_CONFIG": "Domyślny sufiks nazyw pliku platformu w konfiguracji <CONFIG> podczas korzystania z generatora wielu konfiguracji.",
	"assets/variables.json.CMAKE_FRAMEWORK_PATH": "Rozdzielona średnikami lista katalogów określająca ścieżkę wyszukiwania dla struktur systemu macOS i używana przez polecenia find_library, find_package, find_path i find_file.",
	"assets/variables.json.CMAKE_GENERATOR": "Generator użyty do skompilowania projektu. Zobacz dokumentację elementu cmake-generators.",
	"assets/variables.json.CMAKE_GENERATOR_INSTANCE": "Specyfikacja wystąpienia specyficznego dla generatora dostarczona przez użytkownika.",
	"assets/variables.json.CMAKE_GENERATOR_PLATFORM": "Specyfikacja platformy docelowej specyficznej dla generatora dostarczona przez użytkownika.",
	"assets/variables.json.CMAKE_GENERATOR_TOOLSET": "Specyfikacja natywnego zestawu narzędzi systemu kompilacji dostarczona przez użytkownika.",
	"assets/variables.json.CMAKE_GHS_NO_SOURCE_GROUP_FILE": "Wartość logiczna ON / OFF do kontrolowania, czy plik projektu dla obiektu docelowego powinien być pojedynczym plikiem, czy wieloma plikami. Więcej informacji można znaleźć w opisie właściwości GHS_NO_SOURCE_GROUP_FILE.",
	"assets/variables.json.CMAKE_GLOBAL_AUTOGEN_TARGET": "Przełącz, aby włączyć generowanie globalnego elementu docelowego autogen.",
	"assets/variables.json.CMAKE_GLOBAL_AUTOGEN_TARGET_NAME": "Zmień nazwę globalnego elementu docelowego autogen.",
	"assets/variables.json.CMAKE_GLOBAL_AUTORCC_TARGET": "Przełącz, aby włączyć generowanie globalnego elementu docelowego autorcc.",
	"assets/variables.json.CMAKE_GLOBAL_AUTORCC_TARGET_NAME": "Zmień nazwę globalnego elementu docelowego autorcc.",
	"assets/variables.json.CMAKE_GNUtoMS": "Konwertuj biblioteki importu GNU (dll.a) na format MS (lib).",
	"assets/variables.json.CMAKE_HIP_ARCHITECTURES": "Lista architektur procesorów GPU, dla których ma zostać wygenerowany kod urządzenia. Nazwy architektur są interpretowane na podstawie zmiennej CMAKE_HIP_PLATFORM.",
	"assets/variables.json.CMAKE_HIP_COMPILE_FEATURES": "Lista funkcji znanych kompilatorowi testu HIP",
	"assets/variables.json.CMAKE_HIP_EXTENSIONS": "Wartość domyślna właściwość wartości docelowej HIP_EXTENSIONS, jeśli jest ustawiona podczas tworzenia elementu docelowego.",
	"assets/variables.json.CMAKE_HIP_PLATFORM": "Platforma procesora GPU, dla której mają zostać skompilowane źródła języka HIP.",
	"assets/variables.json.CMAKE_HIP_STANDARD": "Wartość domyślna właściwości wartości docelowej HIP_STANDARD, jeśli jest ustawiona podczas tworzenia elementu docelowego.",
	"assets/variables.json.CMAKE_HIP_STANDARD_REQUIRED": "Wartość domyślna właściwości docelowej HIP_STANDARD_REQUIRED, jeśli jest ustawiona podczas tworzenia obiektu docelowego.",
	"assets/variables.json.CMAKE_HOME_DIRECTORY": "Ścieżka najwyższego elementu drzewa źródła. Taka sama jak w przypadku właściwości CMAKE_SOURCE_DIR.",
	"assets/variables.json.CMAKE_HOST_APPLE": "Wartość true dla systemów operacyjnych macOS firmy Apple.",
	"assets/variables.json.CMAKE_HOST_BSD": "Ustaw wartość ciągu, gdy system hosta to BSD. Ta wartość może być jedną z następujących wartości: DragonFlyBSD, FreeBSD, OpenBSD lub NetBSD.",
	"assets/variables.json.CMAKE_HOST_LINUX": "Ustaw wartość true, gdy system hosta to Linux.",
	"assets/variables.json.CMAKE_HOST_SOLARIS": "Wartość true dla systemów operacyjnych Solaris firmy Oracle.",
	"assets/variables.json.CMAKE_HOST_SYSTEM": "Nazwa złożona systemu operacyjnego, w którym jest uruchomiony program CMake.",
	"assets/variables.json.CMAKE_HOST_SYSTEM_NAME": "Nazwa systemu operacyjnego, w którym jest uruchomiony program CMake.",
	"assets/variables.json.CMAKE_HOST_SYSTEM_PROCESSOR": "Nazwa procesora, na którym jest uruchomiony program CMake.",
	"assets/variables.json.CMAKE_HOST_SYSTEM_VERSION": "Wersja systemu operacyjnego, w którym jest uruchomiony program CMake.",
	"assets/variables.json.CMAKE_HOST_UNIX": "Wartość true dla systemu operacyjnego UNIX i podobnych systemów operacyjnych.",
	"assets/variables.json.CMAKE_HOST_WIN32": "Wartość true, jeśli w systemie hosta jest uruchomiony system Windows, w tym 64-bitowy system Windows i pakiet MSYS.",
	"assets/variables.json.CMAKE_IGNORE_PATH": "Rozdzielana średnikami lista katalogów, które mają być ignorowane przez różne operacje znajdowania... () polecenia.",
	"assets/variables.json.CMAKE_IGNORE_PREFIX_PATH": "Rozdzielana średnikami lista prefiksów wyszukiwania do zignorowania przez polecenia find_program, find_library, find_file i find_path. Prefiksy są również ignorowane przez tryb konfiguracji polecenia find_package (nie ma to wpływu na tryb modułu). Aby zamiast tego zignorować określone katalogi, zobacz CMAKE_IGNORE_NONPREFIX_VAR.",
	"assets/variables.json.CMAKE_IMPORT_LIBRARY_PREFIX": "Prefiks łączonych bibliotek importu.",
	"assets/variables.json.CMAKE_IMPORT_LIBRARY_SUFFIX": "Sufiks łączonych bibliotek importu.",
	"assets/variables.json.CMAKE_INCLUDE_CURRENT_DIR": "Automatycznie dodaj bieżące katalogi źródłowy i kompilacji do ścieżki dołączania.",
	"assets/variables.json.CMAKE_INCLUDE_CURRENT_DIR_IN_INTERFACE": "Automatycznie dodaj bieżące katalogi źródłowy i kompilacji do właściwości INTERFACE_INCLUDE_DIRECTORIES elementu docelowego.",
	"assets/variables.json.CMAKE_INCLUDE_DIRECTORIES_BEFORE": "Określa, czy w funkcji include_directories katalogi są domyślnie dołączane na początku, czy na końcu.",
	"assets/variables.json.CMAKE_INCLUDE_DIRECTORIES_PROJECT_BEFORE": "Określa, czy jest wymuszane umieszczanie katalogów dołączania na początku.",
	"assets/variables.json.CMAKE_INCLUDE_PATH": "Rozdzielona średnikami lista katalogów określająca ścieżkę wyszukiwania dla poleceń find_file i find_path. Domyślnie jest ona pusta i zamierzone jest jej ustawianie przez projekt.",
	"assets/variables.json.CMAKE_INSTALL_DEFAULT_COMPONENT_NAME": "Składnik domyślny używany w poleceniach install.",
	"assets/variables.json.CMAKE_INSTALL_DEFAULT_DIRECTORY_PERMISSIONS": "Uprawnienia domyślne dla katalogów tworzonych niejawnie podczas instalacji plików za pomocą poleceń install i file.",
	"assets/variables.json.CMAKE_INSTALL_MESSAGE": "Określ poziom szczegółowości dla kodu skryptu instalacji generowanego za pomocą polecenia install (przy użyciu polecenia file). Dla nowo zainstalowanych lub nowo zaktualizowanych ścieżek instalacja może wyświetlić komunikaty podobne do następujących:",
	"assets/variables.json.CMAKE_INSTALL_NAME_DIR": "Nazwa katalogu dla zainstalowanych elementów docelowych na platformach Apple.",
	"assets/variables.json.CMAKE_INSTALL_PREFIX": "Katalog instalacji używany przez polecenie install.",
	"assets/variables.json.CMAKE_INSTALL_PREFIX_INITIALIZED_TO_DEFAULT": "Program CMake ustawia tę zmienną na wartość TRUE zaraz po zainicjowaniu właściwości CMAKE_INSTALL_PREFIX do wartości domyślnej — zwykle przy pierwszym uruchomieniu programu CMake w ramach nowego drzewa kompilacji, a zmienna środowiskowa CMAKE_INSTALL_PREFIX nie jest ustawiona podczas pierwszego uruchomienia narzędzia CMake. Umożliwia to zmianę wartości domyślnej przez kod projektu bez przesłaniania wartości podanej przez użytkownika:",
	"assets/variables.json.CMAKE_INSTALL_REMOVE_ENVIRONMENT_RPATH": "Ustawia wartość domyślną określającą, czy w trakcie instalacji mają być usuwane ścieżki rpath zdefiniowane przez łańcuch narzędzi.",
	"assets/variables.json.CMAKE_INSTALL_RPATH": "Ścieżka rpath do użycia dla zainstalowanych elementów docelowych.",
	"assets/variables.json.CMAKE_INSTALL_RPATH_USE_LINK_PATH": "Dodaj ścieżki do ścieżki rpath dla wyszukiwania konsolidatora i zainstalowanych elementów.",
	"assets/variables.json.CMAKE_INTERNAL_PLATFORM_ABI": "Wewnętrzna zmienna, która może ulec zmianie.",
	"assets/variables.json.CMAKE_INTERPROCEDURAL_OPTIMIZATION": "Wartość domyślna dla właściwości INTERPROCEDURAL_OPTIMIZATION elementów docelowych.",
	"assets/variables.json.CMAKE_INTERPROCEDURAL_OPTIMIZATION_CONFIG": "Wartość domyślna dla właściwości INTERPROCEDURAL_OPTIMIZATION_ elementów docelowych.",
	"assets/variables.json.CMAKE_IOS_INSTALL_COMBINED": "Wartość domyślna dla właściwości IOS_INSTALL_COMBINED elementów docelowych.",
	"assets/variables.json.CMAKE_ISPC_HEADER_DIRECTORY": "Katalog wyjściowy nagłówków wygenerowany przez kompilator ISPC.",
	"assets/variables.json.CMAKE_ISPC_HEADER_SUFFIX": "Sufiks wyjściowy, który ma być używany na potrzeby nagłówków wygenerowanych przez kompilator ISPC.",
	"assets/variables.json.CMAKE_ISPC_INSTRUCTION_SETS": "Wartość domyślna właściwości ISPC_INSTRUCTION_SETS elementów docelowych.",
	"assets/variables.json.CMAKE_JOB_POOLS": "Jeśli właściwość globalna JOB_POOLS nie jest ustawiona, wartość tej zmiennej jest używana zamiast właściwości JOB_POOLS. Zobacz opis właściwości JOB_POOLS, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_JOB_POOL_COMPILE": "Ta zmienna jest używana do inicjowania właściwości JOB_POOL_COMPILE dla wszystkich elementów docelowych. Zobacz opis właściwości JOB_POOL_COMPILE, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_JOB_POOL_LINK": "Ta zmienna jest używana do inicjowania właściwości JOB_POOL_LINK dla wszystkich elementów docelowych. Zobacz opis właściwości JOB_POOL_LINK, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_JOB_POOL_PRECOMPILE_HEADER": "Ta zmienna jest używana do inicjowania właściwości JOB_POOL_PRECOMPILE_HEADER dla wszystkich elementów docelowych. Zobacz opis właściwości JOB_POOL_PRECOMPILE_HEADER, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_KATE_FILES_MODE": "Ta zmienna pamięci podręcznej jest używana przez generator projektu Kate i kontrolki określające, w jakim trybie zostanie ustawiony wpis plików w pliku projektu. Zobacz generatory cmake-generators.",
	"assets/variables.json.CMAKE_KATE_MAKE_ARGUMENTS": "Ta zmienna pamięci podręcznej jest używana przez generator projektu Kate. Zobacz generatory cmake-generators.",
	"assets/variables.json.CMAKE_LANG_ANDROID_TOOLCHAIN_MACHINE": "W przypadku kompilacji krzyżowej dla systemu Android ta zmienna zawiera nazwę maszyny pakietu binutils łańcucha narzędzi (np. gcc-dumpmachine). Pakiet binutils ma zwykle w nazwie prefiks <machine>.",
	"assets/variables.json.CMAKE_LANG_ANDROID_TOOLCHAIN_PREFIX": "Podczas kompilacji skrośnej dla systemu Android ta zmienna zawiera ścieżkę bezwzględną stanowiącą prefiks kompilatora GNU łańcucha narzędzi i jego pakietu binutils.",
	"assets/variables.json.CMAKE_LANG_ANDROID_TOOLCHAIN_SUFFIX": "Podczas kompilacji skrośnej dla systemu Android ta zmienna zawiera sufiks platformy hosta dla kompilatora GNU łańcucha narzędzi i jego pakietu binutils.",
	"assets/variables.json.CMAKE_LANG_ARCHIVE_APPEND": "Zmienna reguły na potrzeby dołączania do archiwum statycznego.",
	"assets/variables.json.CMAKE_LANG_ARCHIVE_CREATE": "Zmienna reguły na potrzeby tworzenia nowego archiwum statycznego.",
	"assets/variables.json.CMAKE_LANG_ARCHIVE_FINISH": "Zmienna reguły na potrzeby kończenia istniejącego archiwum statycznego.",
	"assets/variables.json.CMAKE_LANG_BYTE_ORDER": "Kolejność bajtów architektury docelowego kompilatora języka <LANG>, jeśli jest znana. Jeśli jest zdefiniowana i nie jest pusta, wartością jest jeden z następujących elementów:",
	"assets/variables.json.CMAKE_LANG_CLANG_TIDY": "Wartość domyślna dla właściwości <LANG>_CLANG_TIDY elementu docelowego, jeśli element <LANG> ma wartość C, CXX, OBJC lub OBJCXX.",
	"assets/variables.json.CMAKE_LANG_CLANG_TIDY_EXPORT_FIXES_DIR": "Wartość domyślna właściwości <LANG>_CLANG_TIDY_EXPORT_FIXES_DIR obiektu docelowego, gdy <LANG> to C, CXX, OBJC lub OBJCXX.",
	"assets/variables.json.CMAKE_LANG_COMPILER": "Pełna ścieżka kompilatora dla właściwości LANG.",
	"assets/variables.json.CMAKE_LANG_COMPILER_ABI": "Wewnętrzna zmienna, która może ulec zmianie.",
	"assets/variables.json.CMAKE_LANG_COMPILER_AR": "Otoka polecenia ar dodająca odpowiednią opcję --plugin dla kompilatora.",
	"assets/variables.json.CMAKE_LANG_COMPILER_ARCHITECTURE_ID": "Wewnętrzna zmienna, która może ulec zmianie.",
	"assets/variables.json.CMAKE_LANG_COMPILER_EXTERNAL_TOOLCHAIN": "Zewnętrzny łańcuch narzędzi na potrzeby kompilacji skrośnej, jeśli jest obsługiwana.",
	"assets/variables.json.CMAKE_LANG_COMPILER_FRONTEND_VARIANT": "Ciąg identyfikacyjny wariantu frontonu kompilatora.",
	"assets/variables.json.CMAKE_LANG_COMPILER_ID": "Ciąg identyfikacyjny kompilatora.",
	"assets/variables.json.CMAKE_LANG_COMPILER_LAUNCHER": "Wartość domyślna dla właściwości <LANG>_COMPILER_LAUNCHER elementu docelowego. Ta zmienna służy do inicjowania właściwości każdego elementu docelowego podczas jego tworzenia. Jest to wykonywane tylko wtedy, gdy właściwość <LANG> ma wartość C, CXX, Fortran, HIP, ISPC, OBJC, OBJCXX lub CUDA.",
	"assets/variables.json.CMAKE_LANG_COMPILER_LINKER": "Pełna ścieżka do konsolidatora dla języka LANG.",
	"assets/variables.json.CMAKE_LANG_COMPILER_LINKER_FRONTEND_VARIANT": "Ciąg identyfikacyjny wariantu frontonu konsolidatora.",
	"assets/variables.json.CMAKE_LANG_COMPILER_LINKER_ID": "Ciąg identyfikacyjny konsolidatora.",
	"assets/variables.json.CMAKE_LANG_COMPILER_LINKER_VERSION": "Ciąg wersji konsolidatora.",
	"assets/variables.json.CMAKE_LANG_COMPILER_LOADED": "Zdefiniowane jako wartość true, jeśli język jest włączony.",
	"assets/variables.json.CMAKE_LANG_COMPILER_PREDEFINES_COMMAND": "Polecenie wyświetlające definicje wstępne kompilatora.",
	"assets/variables.json.CMAKE_LANG_COMPILER_RANLIB": "Otoka polecenia ranlib dodająca odpowiednią opcję --plugin dla kompilatora.",
	"assets/variables.json.CMAKE_LANG_COMPILER_TARGET": "Element docelowy kompilacji skrośnej, jeśli jest obsługiwana.",
	"assets/variables.json.CMAKE_LANG_COMPILER_VERSION": "Ciąg wersji kompilatora.",
	"assets/variables.json.CMAKE_LANG_COMPILER_VERSION_INTERNAL": "Wewnętrzna zmienna, która może ulec zmianie.",
	"assets/variables.json.CMAKE_LANG_COMPILE_OBJECT": "Zmienna reguły na potrzeby kompilowania pojedynczego pliku obiektu.",
	"assets/variables.json.CMAKE_LANG_CPPCHECK": "Wartość domyślna dla właściwości <LANG>_CPPCHECK elementu docelowego. Ta zmienna jest używana do inicjowania właściwości dla każdego elementu docelowego podczas jego tworzenia. Jest to wykonywane tylko wtedy, gdy element <LANG> ma wartość C lub CXX.",
	"assets/variables.json.CMAKE_LANG_CPPLINT": "Wartość domyślna dla właściwości <LANG>_CPPLINT elementu docelowego. Ta zmienna jest używana do inicjowania właściwości dla każdego elementu docelowego podczas jego tworzenia. Jest to wykonywane tylko wtedy, gdy element <LANG> ma wartość C lub CXX.",
	"assets/variables.json.CMAKE_LANG_CREATE_SHARED_LIBRARY": "Zmienna reguły na potrzeby tworzenia udostępnionej biblioteki.",
	"assets/variables.json.CMAKE_LANG_CREATE_SHARED_MODULE": "Zmienna reguły na potrzeby tworzenia udostępnionego modułu.",
	"assets/variables.json.CMAKE_LANG_CREATE_STATIC_LIBRARY": "Zmienna reguły na potrzeby tworzenia biblioteki statycznej.",
	"assets/variables.json.CMAKE_LANG_EXTENSIONS": "Odmiany są następujące:",
	"assets/variables.json.CMAKE_LANG_EXTENSIONS_DEFAULT": "Domyślny tryb rozszerzeń kompilatora. Używana jako domyślna właściwość wartości docelowej <LANG>_EXTENSIONS, gdy CMAKE_<LANG>_EXTENSIONS nie jest ustawiona (zobacz CMP0128).",
	"assets/variables.json.CMAKE_LANG_FLAGS": "Flagi obejmujące szeroki zakres języków dla języka <LANG> używanego podczas kompilowania pod kątem wszystkich konfiguracji. Te flagi zostaną przekazane do wszystkich wywołań kompilatora. Obejmuje to wywołania kompilujące dyski oraz te łączące dyski.",
	"assets/variables.json.CMAKE_LANG_FLAGS_CONFIG": "Flagi obejmujące szeroki zakres języków dla języka <LANG> używanego podczas kompilowania pod kątem konfiguracji <CONFIG>. Te flagi zostaną przekazane do wszystkich wywołań kompilatora w odpowiedniej konfiguracji. Obejmuje to wywołania kompilujące dyski oraz te łączące dyski.",
	"assets/variables.json.CMAKE_LANG_FLAGS_CONFIG_INIT": "Wartość używana do inicjowania wpisu pamięci podręcznej CMAKE_<LANG>_FLAGS_ podczas pierwszego konfigurowania drzewa kompilacji dla języka <LANG>. Zamierzone jest, aby ta zmienna była ustawiania przez plik łańcucha narzędzi. Program CMake może dołączyć zawartość na początku lub na końcu wartości na podstawie środowiska i platformy docelowej.",
	"assets/variables.json.CMAKE_LANG_FLAGS_DEBUG": "Ta zmienna to wariant zmiennej CMAKE_<LANG>_FLAGS_ na potrzeby opcji Debug.",
	"assets/variables.json.CMAKE_LANG_FLAGS_DEBUG_INIT": "Ta zmienna to wariant zmiennej CMAKE_<LANG>_FLAGS_<CONFIG>_INIT na potrzeby opcji Debug.",
	"assets/variables.json.CMAKE_LANG_FLAGS_INIT": "Wartość używana do inicjowania wpisu pamięci podręcznej CMAKE_<LANG>_FLAGS podczas pierwszego konfigurowania drzewa kompilacji dla języka <LANG>. Ta zmienna powinna być ustawiona przez plik łańcucha narzędzi. Narzędzie CMake może dołączyć zawartość na początku lub na końcu wartości na podstawie środowiska i platformy docelowej. Na przykład zawartość zmiennej środowiska xxxFLAGS zostanie dodana na początku, gdzie xxx będzie specyficzna dla języka, ale nie koniecznie taka sama jak właściwość <LANG> (np. CXXFLAGS dla języka CXX, FFLAGS dla języka Fortran itd.). Ta wartość jest fragmentem ciągu wiersza polecenia. Z tego powodu wiele opcji należy rozdzielać spacjami, a opcje ze spacjami powinny być ujęte w cudzysłów.",
	"assets/variables.json.CMAKE_LANG_FLAGS_MINSIZEREL": "Ta zmienna to wariant zmiennej CMAKE_<LANG>_FLAGS_ na potrzeby opcji MinSizeRel.",
	"assets/variables.json.CMAKE_LANG_FLAGS_MINSIZEREL_INIT": "Ta zmienna to wariant zmiennej CMAKE_<LANG>_FLAGS_<CONFIG>_INIT na potrzeby opcji MinSizeRel.",
	"assets/variables.json.CMAKE_LANG_FLAGS_RELEASE": "Ta zmienna to wariant zmiennej CMAKE_<LANG>_FLAGS_ na potrzeby opcji Release.",
	"assets/variables.json.CMAKE_LANG_FLAGS_RELEASE_INIT": "Ta zmienna to wariant zmiennej CMAKE_<LANG>_FLAGS_<CONFIG>_INIT na potrzeby opcji Release.",
	"assets/variables.json.CMAKE_LANG_FLAGS_RELWITHDEBINFO": "Ta zmienna to wariant zmiennej CMAKE_<LANG>_FLAGS_ na potrzeby opcji RelWithDebInfo.",
	"assets/variables.json.CMAKE_LANG_FLAGS_RELWITHDEBINFO_INIT": "Ta zmienna to wariant zmiennej CMAKE_<LANG>_FLAGS_<CONFIG>_INIT na potrzeby opcji RelWithDebInfo.",
	"assets/variables.json.CMAKE_LANG_HOST_COMPILER": "Ta zmienna jest dostępna, gdy <LANG> ma wartość CUDA lub HIP.",
	"assets/variables.json.CMAKE_LANG_IGNORE_EXTENSIONS": "Rozszerzenia plików, które mają być ignorowane przez kompilację.",
	"assets/variables.json.CMAKE_LANG_IMPLICIT_INCLUDE_DIRECTORIES": "Katalogi, które kompilator przeszukuje niejawnie w poszukiwaniu plików nagłówkowych.",
	"assets/variables.json.CMAKE_LANG_IMPLICIT_LINK_DIRECTORIES": "Wykryta niejawna ścieżka wyszukiwania konsolidatora dla języka <LANG>.",
	"assets/variables.json.CMAKE_LANG_IMPLICIT_LINK_FRAMEWORK_DIRECTORIES": "Wykryta niejawna ścieżka wyszukiwania struktury konsolidatora dla języka <LANG>.",
	"assets/variables.json.CMAKE_LANG_IMPLICIT_LINK_LIBRARIES": "Niejawne biblioteki łączenia i flagi wykryte dla języka <LANG>.",
	"assets/variables.json.CMAKE_LANG_INCLUDE_WHAT_YOU_USE": "Wartość domyślna właściwości <LANG>_INCLUDE_WHAT_YOU_USE elementu docelowego. Ta zmienna jest używana do inicjowania właściwości dla każdego elementu docelowego podczas jego tworzenia. Jest to wykonywane tylko wtedy, gdy element <LANG> ma wartość C lub CXX.",
	"assets/variables.json.CMAKE_LANG_LIBRARY_ARCHITECTURE": "Wykryta nazwa katalogu bibliotek architektury docelowej dla języka <LANG>.",
	"assets/variables.json.CMAKE_LANG_LINKER_LAUNCHER": "Wartość domyślna właściwości <LANG>_LINKER_LAUNCHER elementu docelowego. Ta zmienna jest używana do inicjowania właściwości każdego elementu docelowego podczas jego tworzenia. Jest to wykonywane tylko wtedy, gdy właściwość <LANG> ma wartość C, CXX, OBJC lub OBJCXX.",
	"assets/variables.json.CMAKE_LANG_LINKER_PREFERENCE": "Wewnętrzna zmienna, która może ulec zmianie.",
	"assets/variables.json.CMAKE_LANG_LINKER_PREFERENCE_PROPAGATES": "Wewnętrzna zmienna, która może ulec zmianie.",
	"assets/variables.json.CMAKE_LANG_LINKER_WRAPPER_FLAG": "Definiuje składnię opcji sterownika kompilatora na potrzeby przekazywania opcji do narzędzia konsolidatora. Będzie ona używana do tłumaczenia prefiksu LINKER: w opcjach łączenia (zobacz dokumentację funkcji add_link_options i target_link_options).",
	"assets/variables.json.CMAKE_LANG_LINKER_WRAPPER_FLAG_SEP": "Ta zmienna jest używana w połączeniu ze zmienną CMAKE_<LANG>_LINKER_WRAPPER_FLAG do formatowania prefiksu LINKER: w opcjach łączenia (zobacz dokumentację funkcji add_link_options i target_link_options).",
	"assets/variables.json.CMAKE_LANG_LINK_EXECUTABLE": "Zmienna reguły dotycząca łączenia pliku wykonywalnego.",
	"assets/variables.json.CMAKE_LANG_LINK_GROUP_USING_FEATURE": "Ta zmienna definiuje sposób łączenia grupy bibliotek dla określonej funkcji <FEATURE> gdy jest używane wyrażenie generatora LINK_GROUP, a język linku dla obiektu docelowego to <LANG>. Aby ta zmienna miała jakikolwiek wpływ, skojarzona zmienna CMAKE_<LANG>_LINK_GROUP_USING_<FEATURE>_SUPPORTED musi mieć wartość true.",
	"assets/variables.json.CMAKE_LANG_LINK_GROUP_USING_FEATURE_SUPPORTED": "Ta zmienna określa, czy funkcja <FEATURE> jest obsługiwana dla języka linku <LANG>. Jeśli ta zmienna ma wartość true, funkcja <FEATURE> musi być zdefiniowana przez CMAKE_<LANG>_LINK_GROUP_USING_, a bardziej ogólne zmienne CMAKE_LINK_GROUP_USING_<FEATURE>_SUPPORTED i CMAKE_LINK_GROUP_USING_ nie są używane.",
	"assets/variables.json.CMAKE_LANG_LINK_LIBRARY_FEATURE_ATTRIBUTES": "Ta zmienna definiuje semantykę określonej biblioteki linków <FEATURE> podczas łączenia z językiem linku <LANG>. Ma pierwszeństwo przed CMAKE_LINK_LIBRARY_<FEATURE>_ATTRIBUTES jeśli ta zmienna jest również zdefiniowana dla tej samej funkcji <FEATURE>, ale w przeciwnym razie ma podobne skutki. Aby uzyskać szczegółowe informacje, zobacz CMAKE_LINK_LIBRARY_<FEATURE>_ATTRIBUTES.",
	"assets/variables.json.CMAKE_LANG_LINK_LIBRARY_FILE_FLAG": "Flaga specyficzna dla języka do użycia na potrzeby łączenia biblioteki określonej przez ścieżkę jej pliku.",
	"assets/variables.json.CMAKE_LANG_LINK_LIBRARY_FLAG": "Flaga do użycia na potrzeby łączenia biblioteki do biblioteki udostępnionej lub pliku wykonywalnego.",
	"assets/variables.json.CMAKE_LANG_LINK_LIBRARY_SUFFIX": "Specyficzny dla języka sufiks łączonych bibliotek.",
	"assets/variables.json.CMAKE_LANG_LINK_LIBRARY_USING_FEATURE": "Ta zmienna definiuje sposób łączenia biblioteki lub struktury dla określonej funkcji <FEATURE> gdy jest używane wyrażenie generatora LINK_LIBRARY, a język linku dla elementu docelowego to <LANG>. Aby ta zmienna miała jakikolwiek efekt, skojarzona zmienna CMAKE_<LANG>_LINK_LIBRARY_USING_<FEATURE>_SUPPORTED musi mieć wartość true.",
	"assets/variables.json.CMAKE_LANG_LINK_LIBRARY_USING_FEATURE_SUPPORTED": "Ustaw wartość TRUE, jeśli funkcja <FEATURE>, zgodnie ze zmienną CMAKE_<LANG>_LINK_LIBRARY_USING_, jest obsługiwana dla języka konsolidatora <LANG>.",
	"assets/variables.json.CMAKE_LANG_LINK_WHAT_YOU_USE_FLAG": "Flaga konsolidatora, która ma być używana do konfigurowania konsolidatora, aby wszystkie określone biblioteki w wierszu polecenia były połączone z elementem docelowym.",
	"assets/variables.json.CMAKE_LANG_OUTPUT_EXTENSION": "Rozszerzenie dla danych wyjściowych kompilacji pojedynczego pliku.",
	"assets/variables.json.CMAKE_LANG_PLATFORM_ID": "Wewnętrzna zmienna, która może ulec zmianie.",
	"assets/variables.json.CMAKE_LANG_SIMULATE_ID": "Ciąg identyfikacyjny „symulowanego” kompilatora.",
	"assets/variables.json.CMAKE_LANG_SIMULATE_VERSION": "Ciąg wersji „symulowanego” kompilatora.",
	"assets/variables.json.CMAKE_LANG_SIZEOF_DATA_PTR": "Rozmiar typów wskaźnika do danych dla języka <LANG>.",
	"assets/variables.json.CMAKE_LANG_SOURCE_FILE_EXTENSIONS": "Rozszerzenia plików źródłowych dla danego języka.",
	"assets/variables.json.CMAKE_LANG_STANDARD": "Odmiany są następujące:",
	"assets/variables.json.CMAKE_LANG_STANDARD_DEFAULT": "Domyślny standard kompilatora dla języka <LANG>. Puste, jeśli kompilator nie ma koncepcji poziomów standardowych.",
	"assets/variables.json.CMAKE_LANG_STANDARD_INCLUDE_DIRECTORIES": "Katalogi dołączania do zastosowania dla każdego pliku źródłowego kompilowanego przy użyciu kompilatora języka <LANG>. Mają to być systemowe katalogi dołączania wymagane przez język na bieżącej platformie. Te katalogi są zawsze umieszczane na końcu ścieżki dołączania przekazywanej do kompilatora.",
	"assets/variables.json.CMAKE_LANG_STANDARD_LATEST": "Ta zmienna reprezentuje minimum między najnowszą wersją standardu dla języka <LANG>, który jest obsługiwany przez bieżący kompilator, a najnowszą wersją obsługiwaną przez narzędzie CMake. Jej wartość zostanie ustawiona na jedną z obsługiwanych wartości odpowiadającej właściwości docelowej <LANG>_STANDARD; zapoznaj się z dokumentacją tej właściwości, aby uzyskać listę obsługiwanych języków.",
	"assets/variables.json.CMAKE_LANG_STANDARD_LIBRARIES": "Biblioteki łączone z każdym plikiem wykonywalnym i udostępniona biblioteka łączona dla języka <LANG>. Mają to być biblioteki systemowe wymagane przez język na bieżącej platformie.",
	"assets/variables.json.CMAKE_LANG_STANDARD_REQUIRED": "Odmiany są następujące:",
	"assets/variables.json.CMAKE_LANG_USING_LINKER_MODE": "Steruje to sposobem interpretacji wartości zmiennej CMAKE_<LANG>_USING_LINKER_. Obsługiwane wartości trybu konsolidatora to:",
	"assets/variables.json.CMAKE_LANG_USING_LINKER_TYPE": "Ta zmienna definiuje sposób określania konsolidatora <TYPE> dla kroku linku zgodnie ze zmienną CMAKE_LINKER_TYPE lub właściwością docelową LINKER_TYPE. W zależności od wartości zmiennej CMAKE_<LANG>_USING_LINKER_MODE CMAKE_<LANG>_USING_LINKER_<TYPE> może zawierać flagi kompilatora dla kroku linku lub flagi, które mają zostać nadane bezpośrednio narzędziu konsolidatora.",
	"assets/variables.json.CMAKE_LANG_VISIBILITY_PRESET": "Wartość domyślna właściwości <LANG>_VISIBILITY_PRESET elementu docelowego podczas tworzenia elementu docelowego.",
	"assets/variables.json.CMAKE_LIBRARY_ARCHITECTURE": "Nazwa katalogu bibliotek architektury docelowej, jeśli została wykryta.",
	"assets/variables.json.CMAKE_LIBRARY_ARCHITECTURE_REGEX": "Wyrażenie regularne pasujące do możliwych nazw katalogu bibliotek architektury docelowej.",
	"assets/variables.json.CMAKE_LIBRARY_OUTPUT_DIRECTORY": "Miejsce, w którym podczas kompilowania mają zostać umieszczone pliki docelowe określone przez właściwość LIBRARY.",
	"assets/variables.json.CMAKE_LIBRARY_OUTPUT_DIRECTORY_CONFIG": "Miejsce, w którym podczas kompilowania mają zostać umieszczone pliki docelowe określone przez właściwość LIBRARY dla konkretnej konfiguracji.",
	"assets/variables.json.CMAKE_LIBRARY_PATH": "Rozdzielona średnikami lista katalogów określająca ścieżkę wyszukiwania dla polecenia find_library. Domyślnie jest ona pusta i zamierzone jest jej ustawianie przez projekt.",
	"assets/variables.json.CMAKE_LIBRARY_PATH_FLAG": "Flaga do użycia w celu dodania ścieżki wyszukiwania bibliotek do kompilatora.",
	"assets/variables.json.CMAKE_LINKER_TYPE": "Określ, który konsolidator będzie używany dla kroku linku.",
	"assets/variables.json.CMAKE_LINK_DEF_FILE_FLAG": "Flaga konsolidatora do użycia w celu określenia pliku def na potrzeby tworzenia biblioteki dll.",
	"assets/variables.json.CMAKE_LINK_DEPENDS_NO_SHARED": "Określa, czy pominąć zależności łączenia dla plików udostępnionej biblioteki.",
	"assets/variables.json.CMAKE_LINK_DEPENDS_USE_LINKER": "W przypadku generatorów Makefile i Ninja zależności linków są teraz, w zakresie wyboru konsolidatorów, generowane przez samego konsolidatora. Definiując tę zmienną z wartością FALSE, możesz dezaktywować tę funkcję.",
	"assets/variables.json.CMAKE_LINK_DIRECTORIES_BEFORE": "Określa, czy domyślnie umieścić katalogi na początku, czy na końcu w funkcji link_directories.",
	"assets/variables.json.CMAKE_LINK_GROUP_USING_FEATURE": "Ta zmienna definiuje sposób łączenia grupy bibliotek dla określonej funkcji <FEATURE> gdy jest używane wyrażenie generatora LINK_GROUP. Aby ta zmienna miała jakikolwiek efekt, należy spełnić oba następujące warunki:",
	"assets/variables.json.CMAKE_LINK_GROUP_USING_FEATURE_SUPPORTED": "Ta zmienna określa, czy funkcja <FEATURE> jest obsługiwana niezależnie od języka linku. Jeśli ta zmienna ma wartość true, funkcja <FEATURE> musi być zdefiniowana przez CMAKE_LINK_GROUP_USING_.",
	"assets/variables.json.CMAKE_LINK_INTERFACE_LIBRARIES": "Wartość domyślna dla właściwości LINK_INTERFACE_LIBRARIES elementów docelowych.",
	"assets/variables.json.CMAKE_LINK_LIBRARIES_ONLY_TARGETS": "Ustaw tę zmienną, aby zainicjować właściwość LINK_LIBRARIES_ONLY_TARGETS niezaimportowanych elementów docelowych podczas ich tworzenia. Ustawienie wartości true umożliwia dodatkowe sprawdzenie, czy wszystkie elementy nazwane przez target_link_libraries, które mogą być nazwami docelowymi, są w rzeczywistości nazwami istniejących elementów docelowych. Zobacz dokumentację właściwości docelowej, aby uzyskać szczegółowe informacje.",
	"assets/variables.json.CMAKE_LINK_LIBRARY_FEATURE_ATTRIBUTES": "Ta zmienna definiuje zachowanie określonej biblioteki linków <FEATURE>. Określa, w jaki sposób funkcja <FEATURE> współdziała z innymi funkcjami, kiedy ma zostać zastosowana funkcja <FEATURE> oraz aspekty sposobu obsługi funkcji <FEATURE> podczas składania końcowego wiersza polecenia konsolidatora przez narzędzie CMake (np. deduplikacji).",
	"assets/variables.json.CMAKE_LINK_LIBRARY_FILE_FLAG": "Flagi do użycia na potrzeby łączenia biblioteki określonej przez ścieżkę jej pliku.",
	"assets/variables.json.CMAKE_LINK_LIBRARY_FLAG": "Flaga do użycia na potrzeby łączenia biblioteki do pliku wykonywalnego.",
	"assets/variables.json.CMAKE_LINK_LIBRARY_SUFFIX": "Sufiks łączonych bibliotek.",
	"assets/variables.json.CMAKE_LINK_LIBRARY_USING_FEATURE": "Ta zmienna definiuje sposób łączenia biblioteki lub struktury dla określonej funkcji <FEATURE>, gdy jest używane wyrażenie generatora LINK_LIBRARY. Aby ta zmienna miała jakikolwiek efekt, należy spełnić oba następujące warunki:",
	"assets/variables.json.CMAKE_LINK_LIBRARY_USING_FEATURE_SUPPORTED": "Ustaw wartość TRUE, jeśli funkcja <FEATURE>, zgodnie z definicją w zmiennej CMAKE_LINK_LIBRARY_USING_, jest obsługiwana niezależnie od języka konsolidatora.",
	"assets/variables.json.CMAKE_LINK_SEARCH_END_STATIC": "Zakończ polecenie łączenia tak, aby zostały użyte statyczne biblioteki systemowe.",
	"assets/variables.json.CMAKE_LINK_SEARCH_START_STATIC": "Przyjmij, że konsolidator domyślnie szuka bibliotek statycznych.",
	"assets/variables.json.CMAKE_LINK_WHAT_YOU_USE": "Wartość domyślna właściwości LINK_WHAT_YOU_USE elementu docelowego. Ta zmienna jest używana do inicjowania właściwości dla każdego elementu docelowego podczas jego tworzenia.",
	"assets/variables.json.CMAKE_LINK_WHAT_YOU_USE_CHECK": "Definiuje polecenie wykonywane po kroku linku w celu sprawdzenia użycia bibliotek. To sprawdzenie jest obecnie zdefiniowane tylko na platformach ELF z wartością ldd -u -r.",
	"assets/variables.json.CMAKE_MACOSX_BUNDLE": "Wartość domyślna dla właściwości MACOSX_BUNDLE elementów docelowych.",
	"assets/variables.json.CMAKE_MACOSX_RPATH": "Określa, czy używać ścieżek rpath w systemach macOS i iOS.",
	"assets/variables.json.CMAKE_MAJOR_VERSION": "Pierwszy składnik numeru wersji zmiennej CMAKE_VERSION.",
	"assets/variables.json.CMAKE_MAKE_PROGRAM": "Narzędzie, które może uruchomić natywny system kompilacji. Wartość może być pełną ścieżką pliku wykonywalnego lub samą nazwą narzędzia, jeśli znajduje się ono na ścieżce określonej przez właściwość PATH.",
	"assets/variables.json.CMAKE_MAP_IMPORTED_CONFIG_CONFIG": "Wartość domyślna dla właściwości MAP_IMPORTED_CONFIG_ elementów docelowych.",
	"assets/variables.json.CMAKE_MATCH_COUNT": "Liczba dopasowań za pomocą ostatniego wyrażenia regularnego.",
	"assets/variables.json.CMAKE_MATCH_n": "Grupa przechwytywania <n> dopasowana przez ostatnie wyrażenie regularne dla grup od 0 do 9. Grupa 0 to całe dopasowanie. Grupy od 1 do 9 to wyrażenia podrzędne przechwycone za pomocą składni ().",
	"assets/variables.json.CMAKE_MAXIMUM_RECURSION_DEPTH": "Maksymalna głębokość rekursji dla skryptów narzędzia CMake. Powinna zostać ustawiona w wierszu polecenia z parametrem -DCMAKE_MAXIMUM_RECURSION_DEPTH=<x> lub w pliku CMakeLists.txt przez projekty wymagające dużej głębokości rekursji. Projekty, które ustawiają tę zmienną, powinny udostępniać użytkownikowi sposób jej zastąpienia. Na przykład:",
	"assets/variables.json.CMAKE_MESSAGE_CONTEXT": "Po włączeniu przez opcję wiersza polecenia cmake --log-context lub zmienną CMAKE_MESSAGE_CONTEXT_SHOW, polecenie wiadomości konwertuje listę CMAKE_MESSAGE_CONTEXT na rozdzielony kropkami ciąg otoczony nawiasami kwadratowymi i dołącza go przed każdym wierszem dla komunikatów o poziomach dziennika NOTICE i poniżej.",
	"assets/variables.json.CMAKE_MESSAGE_CONTEXT_SHOW": "Ustawienie tej zmiennej na wartość true włącza wyświetlanie kontekstu z każdym wierszem zarejestrowanym za pomocą polecenia message (zobacz opis właściwości CMAKE_MESSAGE_CONTEXT, aby dowiedzieć się, jak określa się sam kontekst).",
	"assets/variables.json.CMAKE_MESSAGE_INDENT": "Polecenie message łączy ciągi z tej listy oraz dołącza wynikowy ciąg do każdego wiersza komunikatu dla poziomów dziennika NOTICE i poniżej.",
	"assets/variables.json.CMAKE_MESSAGE_LOG_LEVEL": "Gdy zostanie ustawiona, ta zmienna określa poziom rejestrowania używany przez polecenie wiadomości. Prawidłowe wartości są takie same jak w przypadku opcji wiersza polecenia --log-level <cmake --log-level> programu CMake. Jeśli ta zmienna zostanie ustawiona i zostanie podana opcja wiersza polecenia --log-level <cmake --log-level>, opcja wiersza polecenia będzie miała pierwszeństwo.",
	"assets/variables.json.CMAKE_MFC_FLAG": "Użyj biblioteki MFC dla pliku wykonywalnego lub dll.",
	"assets/variables.json.CMAKE_MINIMUM_REQUIRED_VERSION": "Wersja <min> narzędzia CMAKE nadana ostatniemu wywołaniu polecenia cmake_minimum_required w bieżącym zakresie zmiennych lub dowolnym nadrzędnym zakresie zmiennych.",
	"assets/variables.json.CMAKE_MINOR_VERSION": "Drugi składnik numeru wersji zmiennej CMAKE_VERSION.",
	"assets/variables.json.CMAKE_MODULE_LINKER_FLAGS": "Flagi konsolidatora do użycia na potrzeby tworzenia modułów.",
	"assets/variables.json.CMAKE_MODULE_LINKER_FLAGS_CONFIG": "Flagi do użycia podczas łączenia modułu.",
	"assets/variables.json.CMAKE_MODULE_LINKER_FLAGS_CONFIG_INIT": "Wartość używana do inicjowania pozycji pamięci podręcznej CMAKE_MODULE_LINKER_FLAGS_ podczas pierwszego konfigurowania drzewa kompilacji. Tę zmienną ma ustawić plik łańcucha narzędzi. Program CMake może dołączyć zawartość na początku lub na końcu wartości na podstawie środowiska i platformy docelowej.",
	"assets/variables.json.CMAKE_MODULE_LINKER_FLAGS_INIT": "Wartość używana do inicjowania pozycji pamięci podręcznej CMAKE_MODULE_LINKER_FLAGS podczas pierwszego konfigurowania drzewa kompilacji. Tę zmienną ma ustawić plik łańcucha narzędzi. Program CMake może dołączyć zawartość na początku lub na końcu wartości na podstawie środowiska i platformy docelowej.",
	"assets/variables.json.CMAKE_MODULE_PATH": "Rozdzielana średnikami lista katalogów reprezentowana przy użyciu ukośnika, określająca ścieżkę wyszukiwania dla modułów narzędzia CMake do załadowania przez polecenia include lub find_package przed sprawdzeniem modułów domyślnych, które są dostarczane z narzędziem CMake. Domyślnie jest pusta. Jest ona przeznaczona do ustawiania przez projekt.",
	"assets/variables.json.CMAKE_MSVCIDE_RUN_PATH": "Dodatkowe lokalizacje określone przez właściwość PATH, które mają być używane podczas wykonywania polecenia add_custom_command lub add_custom_target w ramach korzystania z generatora programu Visual Studio 12 2013 (lub nowszego). Umożliwia to uruchamianie poleceń i używanie bibliotek dll, o których środowisko IDE nie ma informacji.",
	"assets/variables.json.CMAKE_MSVC_DEBUG_INFORMATION_FORMAT": "Wybierz format informacji debugowania MSVC przeznaczony dla usługi MSVC ABI. Ta zmienna służy do inicjowania właściwości MSVC_DEBUG_INFORMATION_FORMAT we wszystkich obiektach docelowych podczas ich tworzenia. Jest ona również propagowana przez wywołania polecenia try_compile do projektu testowego.",
	"assets/variables.json.CMAKE_MSVC_RUNTIME_LIBRARY": "Wybierz bibliotekę środowiska uruchomieniowego MSVC do użycia przez kompilatory przeznaczone dla interfejsu ABI środowiska MSVC. Ta zmienna jest używana do inicjowania właściwości MSVC_RUNTIME_LIBRARY we wszystkich elementach docelowych podczas ich tworzenia. Jest ona również propagowana przez wywołania polecenia try_compile w projekcie testu.",
	"assets/variables.json.CMAKE_NETRC": "Ta zmienna jest używana do inicjowania opcji NETRC dla pliku i poleceń pliku. Zobacz dokumentację tych poleceń, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_NETRC_FILE": "Ta zmienna jest używana do inicjowania opcji NETRC_FILE dla pliku i poleceń pliku. Zobacz dokumentację tych poleceń, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_NINJA_OUTPUT_PATH_PREFIX": "Poinformuj generatory Ninja, aby dodały prefiks do każdej ścieżki danych wyjściowych w pliku build.ninja. Końcowy ukośnik jest dołączany do prefiksu, jeśli go brakuje.",
	"assets/variables.json.CMAKE_NOT_USING_CONFIG_FLAGS": "Pomiń flagi _BUILD_TYPE, jeśli wartość to true.",
	"assets/variables.json.CMAKE_NO_BUILTIN_CHRPATH": "Nie używaj wbudowanego edytora binarnego do naprawiania ścieżek wyszukiwania biblioteki środowiska uruchomieniowego podczas instalacji.",
	"assets/variables.json.CMAKE_NO_SYSTEM_FROM_IMPORTED": "Wartość domyślna dla właściwości NO_SYSTEM_FROM_IMPORTED elementów docelowych.",
	"assets/variables.json.CMAKE_OBJCXX_EXTENSIONS": "Wartość domyślna dla właściwości docelowej OBJCXX_EXTENSIONS, jeśli jest ustawiona podczas tworzenia obiektu docelowego.",
	"assets/variables.json.CMAKE_OBJCXX_STANDARD": "Wartość domyślna dla właściwości docelowej OBJCXX_STANDARD, jeśli jest ustawiona podczas tworzenia obiektu docelowego.",
	"assets/variables.json.CMAKE_OBJCXX_STANDARD_REQUIRED": "Wartość domyślna dla właściwości docelowej OBJCXX_STANDARD_REQUIRED, jeśli jest ustawiona podczas tworzenia obiektu docelowego.",
	"assets/variables.json.CMAKE_OBJC_EXTENSIONS": "Wartość domyślna dla właściwości docelowej OBJC_EXTENSIONS, jeśli jest ustawiona podczas tworzenia obiektu docelowego.",
	"assets/variables.json.CMAKE_OBJC_STANDARD": "Wartość domyślna dla właściwości docelowej OBJC_STANDARD, jeśli jest ustawiona podczas tworzenia obiektu docelowego.",
	"assets/variables.json.CMAKE_OBJC_STANDARD_REQUIRED": "Wartość domyślna dla właściwości docelowej OBJC_STANDARD_REQUIRED, jeśli jest ustawiona podczas tworzenia obiektu docelowego.",
	"assets/variables.json.CMAKE_OBJECT_PATH_MAX": "Maksymalna długość pełnej ścieżki pliku obiektu dozwolona przez natywne narzędzia do kompilowania.",
	"assets/variables.json.CMAKE_OPTIMIZE_DEPENDENCIES": "Inicjuje właściwość OPTIMIZE_DEPENDENCIES elementu docelowego.",
	"assets/variables.json.CMAKE_OSX_ARCHITECTURES": "Architektury specyficzne dla elementu docelowego w przypadku systemów macOS i iOS.",
	"assets/variables.json.CMAKE_OSX_DEPLOYMENT_TARGET": "Określ minimalną wersję platformy docelowej (np. macOS lub iOS), na której pliki binarne mają zostać wdrożone. Program CMake używa wartości tej zmiennej dla flagi -mmacosx-version-min lub jej odpowiednika dla danej platformy docelowej. W przypadku starszych wersji środowiska Xcode dostarczanych z wieloma zestawami SDK systemu macOS ta zmienna ułatwia także wybranie zestawu SDK, jeśli właściwość CMAKE_OSX_SYSROOT nie jest ustawiona.",
	"assets/variables.json.CMAKE_OSX_SYSROOT": "Określ lokalizację lub nazwę zestawu SDK platformy macOS do użycia. Program CMake używa tej wartości do obliczenia wartości flagi -isysroot lub równoważnej oraz aby ułatwić poleceniom find_* znalezienie plików w zestawie SDK.",
	"assets/variables.json.CMAKE_PARENT_LIST_FILE": "Pełna ścieżka pliku programu CMake, który dołączył bieżący plik.",
	"assets/variables.json.CMAKE_PATCH_VERSION": "Trzeci składnik numeru wersji zmiennej CMAKE_VERSION.",
	"assets/variables.json.CMAKE_PCH_INSTANTIATE_TEMPLATES": "Ta zmienna jest używana do inicjowania właściwości PCH_INSTANTIATE_TEMPLATES elementów docelowych podczas ich tworzenia.",
	"assets/variables.json.CMAKE_PCH_WARN_INVALID": "Ta zmienna jest używana do inicjowania właściwości PCH_WARN_INVALID elementów docelowych podczas ich tworzenia.",
	"assets/variables.json.CMAKE_PDB_OUTPUT_DIRECTORY": "Katalog wyjściowy dla plików pdb symboli debugowania firmy Microsoft wygenerowanych przez konsolidator dla elementów docelowych pliku wykonywalnego i udostępnionej biblioteki.",
	"assets/variables.json.CMAKE_PDB_OUTPUT_DIRECTORY_CONFIG": "Katalog wyjściowy dotyczący konfiguracji dla plików pdb symboli debugowania firmy Microsoft wygenerowanych przez konsolidator dla elementów docelowych pliku wykonywalnego i udostępnionej biblioteki.",
	"assets/variables.json.CMAKE_PLATFORM_NO_VERSIONED_SONAME": "Ta zmienna służy do globalnego kontrolowania, czy właściwości VERSION i SOVERSION elementu docelowego powinny być używane dla bibliotek udostępnionych. W przypadku ustawienia wartości true dodawanie informacji o wersji do każdego elementu docelowego biblioteki udostępnionej jest wyłączone.",
	"assets/variables.json.CMAKE_POLICY_DEFAULT_CMPNNNN": "Wartość domyślna zasad CMP<NNNN> programu CMake, jeśli nie ustawiono inaczej.",
	"assets/variables.json.CMAKE_POLICY_WARNING_CMPNNNN": "Jawnie włącz lub wyłącz ostrzeżenie, gdy zasady CMake CMP<NNNN> nie zostały jawnie ustawione przez cmake_policy lub niejawnie przez cmake_minimum_required. Ma to znaczenie tylko w przypadku zasad, które domyślnie nie ostrzegają:",
	"assets/variables.json.CMAKE_POSITION_INDEPENDENT_CODE": "Wartość domyślna dla właściwości POSITION_INDEPENDENT_CODE elementów docelowych.",
	"assets/variables.json.CMAKE_PREFIX_PATH": "Rozdzielona średnikami lista katalogów określających prefiksy instalacji przeszukiwane przez polecenia find_package, find_program, find_library, find_file i find_path. Każde polecenie powoduje dodanie odpowiednich podkatalogów (takich jak bin, lib lub include) w sposób określony w jego dokumentacji.",
	"assets/variables.json.CMAKE_PROGRAM_PATH": "Rozdzielona średnikami lista katalogów określająca ścieżkę wyszukiwania dla polecenia find_program. Domyślnie jest ona pusta i zamierzone jest jej ustawianie przez projekt.",
	"assets/variables.json.CMAKE_PROJECT_DESCRIPTION": "Opis projektu najwyższego poziomu.",
	"assets/variables.json.CMAKE_PROJECT_HOMEPAGE_URL": "Adres URL strony głównej projektu najwyższego poziomu.",
	"assets/variables.json.CMAKE_PROJECT_INCLUDE": "Plik języka narzędzia CMake do uwzględnienia jako ostatni krok wszystkich wywołań poleceń projektu. Jest to przeznaczone do wprowadzania kodu niestandardowego do kompilacji projektu bez modyfikowania ich źródła. Zobacz iniekcję kodu, aby uzyskać bardziej szczegółową dyskusję na temat plików potencjalnie uwzględnionych podczas wywołania projektu.",
	"assets/variables.json.CMAKE_PROJECT_INCLUDE_BEFORE": "Plik języka narzędzia CMake do uwzględnienia jako pierwszy krok wszystkich wywołań poleceń projektu. Jest to przeznaczone do wprowadzania kodu niestandardowego do kompilacji projektu bez modyfikowania ich źródła. Zobacz iniekcję kodu, aby uzyskać bardziej szczegółową dyskusję na temat plików potencjalnie uwzględnionych podczas wywołania projektu.",
	"assets/variables.json.CMAKE_PROJECT_NAME": "Nazwa projektu najwyższego poziomu.",
	"assets/variables.json.CMAKE_PROJECT_PROJECT-NAME_INCLUDE": "Plik języka narzędzia CMake do uwzględnienia jako ostatni krok wszystkich wywołań poleceń projektu, które określają <PROJECT-NAME> jako nazwę projektu. Jest to przeznaczone do wprowadzania kodu niestandardowego do kompilacji projektu bez modyfikowania ich źródła. Zobacz iniekcję kodu, aby uzyskać bardziej szczegółową dyskusję na temat plików potencjalnie uwzględnionych podczas wywołania projektu.",
	"assets/variables.json.CMAKE_PROJECT_PROJECT-NAME_INCLUDE_BEFORE": "Plik języka narzędzia CMake do uwzględnienia jako pierwszy krok wszystkich wywołań poleceń projektu, które określają <PROJECT-NAME> jako nazwę projektu. Jest to przeznaczone do wprowadzania kodu niestandardowego do kompilacji projektu bez modyfikowania ich źródła. Zobacz iniekcję kodu, aby uzyskać bardziej szczegółową dyskusję na temat plików potencjalnie uwzględnionych podczas wywołania projektu.",
	"assets/variables.json.CMAKE_PROJECT_TOP_LEVEL_INCLUDES": "Rozdzielana średnikami lista plików języka narzędzia CMake do uwzględnienia w ramach pierwszego wywołania projektu. Pliki zostaną uwzględnione natychmiast po odczytaniu pliku łańcucha narzędzi (jeśli został określony), a zmienne platformy zostały ustawione, ale przed włączeniem jakichkolwiek języków. W związku z tym zmienne specyficzne dla języka, w tym elementy, takie jak CMAKE_<LANG>_COMPILER, mogą nie być ustawione. Zobacz iniekcję kodu, aby uzyskać bardziej szczegółową dyskusję na temat plików potencjalnie uwzględnionych podczas wywołania projektu.",
	"assets/variables.json.CMAKE_PROJECT_VERSION": "Wersja projektu najwyższego poziomu.",
	"assets/variables.json.CMAKE_PROJECT_VERSION_MAJOR": "Wersja główna projektu najwyższego poziomu.",
	"assets/variables.json.CMAKE_PROJECT_VERSION_MINOR": "Wersja podrzędna projektu najwyższego poziomu.",
	"assets/variables.json.CMAKE_PROJECT_VERSION_PATCH": "Wersja poprawki projektu najwyższego poziomu.",
	"assets/variables.json.CMAKE_PROJECT_VERSION_TWEAK": "Wersja strojenia projektu najwyższego poziomu.",
	"assets/variables.json.CMAKE_RANLIB": "Nazwa narzędzia do wprowadzania losowości w bibliotekach statycznych.",
	"assets/variables.json.CMAKE_REQUIRE_FIND_PACKAGE_PackageName": "Zmienna umożliwiająca wykonywanie wywołania find_package jako WYMAGANE.",
	"assets/variables.json.CMAKE_ROOT": "Katalog instalacji dla uruchamiania programu cmake.",
	"assets/variables.json.CMAKE_RULE_MESSAGES": "Określ, czy dla każdej reguły programu make ma być zgłaszany komunikat.",
	"assets/variables.json.CMAKE_RUNTIME_OUTPUT_DIRECTORY": "Miejsce, w którym podczas kompilowania mają zostać umieszczone pliki docelowe określone przez właściwość RUNTIME.",
	"assets/variables.json.CMAKE_RUNTIME_OUTPUT_DIRECTORY_CONFIG": "Miejsce, w którym podczas kompilowania mają zostać umieszczone pliki docelowe określone przez właściwość RUNTIME przeznaczone dla konkretnej konfiguracji.",
	"assets/variables.json.CMAKE_SCRIPT_MODE_FILE": "Pełna ścieżka obecnie przetwarzanego pliku skryptu cmake -P.",
	"assets/variables.json.CMAKE_SHARED_LIBRARY_ENABLE_EXPORTS": "Określ, czy biblioteka udostępniona generuje plik importu.",
	"assets/variables.json.CMAKE_SHARED_LIBRARY_PREFIX": "Prefiks łączonych udostępnionych bibliotek.",
	"assets/variables.json.CMAKE_SHARED_LIBRARY_SUFFIX": "Sufiks łączonych bibliotek udostępnionych.",
	"assets/variables.json.CMAKE_SHARED_LINKER_FLAGS": "Flagi konsolidatora do użycia na potrzeby tworzenia udostępnionych bibliotek.",
	"assets/variables.json.CMAKE_SHARED_LINKER_FLAGS_CONFIG": "Flagi do użycia podczas łączenia udostępnionej biblioteki.",
	"assets/variables.json.CMAKE_SHARED_LINKER_FLAGS_CONFIG_INIT": "Wartość używana do inicjowania pozycji pamięci podręcznej CMAKE_SHARED_LINKER_FLAGS_ podczas pierwszego konfigurowania drzewa kompilacji. Tę zmienną ma ustawić plik łańcucha narzędzi. Program CMake może dołączyć zawartość na początku lub na końcu wartości na podstawie środowiska i platformy docelowej.",
	"assets/variables.json.CMAKE_SHARED_LINKER_FLAGS_INIT": "Wartość używana do inicjowania pozycji pamięci podręcznej CMAKE_SHARED_LINKER_FLAGS podczas pierwszego konfigurowania drzewa kompilacji. Tę zmienną ma ustawić plik łańcucha narzędzi. Program CMake może dołączyć zawartość na początku lub na końcu wartości na podstawie środowiska i platformy docelowej.",
	"assets/variables.json.CMAKE_SHARED_MODULE_PREFIX": "Prefiks łączonych modułów ładowalnych.",
	"assets/variables.json.CMAKE_SHARED_MODULE_SUFFIX": "Sufiks łączonych bibliotek udostępnionych.",
	"assets/variables.json.CMAKE_SIZEOF_VOID_P": "Rozmiar wskaźnika typu void.",
	"assets/variables.json.CMAKE_SKIP_BUILD_RPATH": "Nie uwzględniaj ścieżek RPATH w drzewie kompilacji.",
	"assets/variables.json.CMAKE_SKIP_INSTALL_ALL_DEPENDENCY": "Skonfiguruj cel install jako niezależny od celu all.",
	"assets/variables.json.CMAKE_SKIP_INSTALL_RPATH": "Nie uwzględniaj ścieżek RPATH w drzewie instalacji.",
	"assets/variables.json.CMAKE_SKIP_INSTALL_RULES": "Określa, czy wyłączyć generowanie reguł instalacji.",
	"assets/variables.json.CMAKE_SKIP_RPATH": "Jeśli wartość to true, nie dodawaj informacji o ścieżce czasu wykonywania.",
	"assets/variables.json.CMAKE_SKIP_TEST_ALL_DEPENDENCY": "Określ, czy cel testu zależy od wszystkich elementów docelowych.",
	"assets/variables.json.CMAKE_SOURCE_DIR": "Ścieżka do najwyższego poziomu drzewa źródła.",
	"assets/variables.json.CMAKE_STAGING_PREFIX": "Tę zmienną można ustawić na ścieżkę instalacji podczas kompilowania skrośnego. Może to być przydatne, jeśli ścieżka we właściwości CMAKE_SYSROOT jest tylko do odczytu, a w przeciwnym razie należy pozostawić zmienną bez zmian.",
	"assets/variables.json.CMAKE_STATIC_LIBRARY_PREFIX": "Prefiks dla bibliotek statycznych, z którymi się łączysz.",
	"assets/variables.json.CMAKE_STATIC_LIBRARY_SUFFIX": "Sufiks dla bibliotek statycznych, z którymi się łączysz.",
	"assets/variables.json.CMAKE_STATIC_LINKER_FLAGS": "Flagi używane do tworzenia bibliotek statycznych. Te flagi zostaną przekazane do archiwizatora podczas tworzenia biblioteki statycznej.",
	"assets/variables.json.CMAKE_STATIC_LINKER_FLAGS_CONFIG": "Flagi używane do tworzenia bibliotek statycznych. Te flagi zostaną przekazane do archiwizatora podczas tworzenia biblioteki statycznej w konfiguracji <CONFIG>.",
	"assets/variables.json.CMAKE_STATIC_LINKER_FLAGS_CONFIG_INIT": "Wartość używana do zainicjowania wpisu pamięci podręcznej CMAKE_STATIC_LINKER_FLAGS_ przy pierwszym skonfigurowaniu drzewa kompilacji. Ta zmienna jest przeznaczona do ustawiania przez plik łańcucha narzędzi. Narzędzie CMake może poprzedzić wartość zawartością lub dołączyć zawartość do wartości na podstawie środowiska i platformy docelowej.",
	"assets/variables.json.CMAKE_STATIC_LINKER_FLAGS_INIT": "Wartość używana do zainicjowania wpisu pamięci podręcznej CMAKE_STATIC_LINKER_FLAGS przy pierwszym skonfigurowaniu drzewa kompilacji. Ta zmienna jest przeznaczona do ustawiania przez plik łańcucha narzędzi. Narzędzie CMake może poprzedzić wartość zawartością lub dołączyć zawartość do wartości na podstawie środowiska i platformy docelowej.",
	"assets/variables.json.CMAKE_SUBLIME_TEXT_2_ENV_SETTINGS": "Ta zmienna zawiera listę zmiennych środowiskowych w postaci listy tokenów o składni var=value.",
	"assets/variables.json.CMAKE_SUBLIME_TEXT_2_EXCLUDE_BUILD_TREE": "Jeśli ta zmienna przyjmuje wartość ON na końcu pliku CMakeLists.txt najwyższego poziomu, dodatkowy generator Sublime Text 2 wyklucza drzewo kompilacji z pliku .sublime-project, jeśli znajduje się on wewnątrz drzewa źródła.",
	"assets/variables.json.CMAKE_SUPPRESS_REGENERATION": "Jeśli właściwość CMAKE_SUPPRESS_REGENERATION ma wartość OFF, co jest ustawieniem domyślnym, narzędzie CMake dodaje specjalny element docelowy, od którego zależne są wszystkie elementy docelowe, i który sprawdza system kompilacji i opcjonalnie ponownie uruchamia narzędzie CMake w celu ponownego wygenerowania systemu kompilacji w przypadku zmiany źródła specyfikacji elementu docelowego.",
	"assets/variables.json.CMAKE_Swift_COMPILATION_MODE": "Określ sposób kompilowania elementu docelowego przez program Swift. Ta zmienna jest używana do inicjowania właściwości Swift_COMPILATION_MODE w obiektach docelowych podczas ich tworzenia.",
	"assets/variables.json.CMAKE_Swift_LANGUAGE_VERSION": "Ustaw numer wersji języka Swift. Jeśli nie zostanie ustawiona, zakłada się, że jest to najstarsza wersja dostępna w wersji środowiska Xcode hosta:",
	"assets/variables.json.CMAKE_Swift_MODULE_DIRECTORY": "Katalog wyjściowy modułu języka Swift.",
	"assets/variables.json.CMAKE_Swift_NUM_THREADS": "Liczba wątków dla kompilacji równoległej dla elementów docelowych języka Swift.",
	"assets/variables.json.CMAKE_SYSROOT": "Ścieżka do przekazania do kompilatora we fladze --sysroot.",
	"assets/variables.json.CMAKE_SYSROOT_COMPILE": "Ścieżka do przekazania do kompilatora we fladze --sysroot podczas kompilowania plików źródłowych. Jest taka sama jak właściwość CMAKE_SYSROOT, ale jest używana tylko w przypadku kompilowania źródeł, a nie łączenia.",
	"assets/variables.json.CMAKE_SYSROOT_LINK": "Ścieżka do przekazania do kompilatora we fladze --sysroot podczas łączenia. Jest taka sama jak właściwość CMAKE_SYSROOT, ale jest używana tylko w przypadku łączenia, a nie kompilowania źródeł.",
	"assets/variables.json.CMAKE_SYSTEM": "Nazwa złożona systemu operacyjnego, dla którego narzędzie CMake kompiluje kod.",
	"assets/variables.json.CMAKE_SYSTEM_APPBUNDLE_PATH": "Ścieżka wyszukiwania dla pakietów aplikacji systemu macOS używana przez polecenia find_program i find_package. Domyślnie zawiera standardowe katalogi dla bieżącego systemu. Nie jest przeznaczona do modyfikowania przez projekt — do tego służy właściwość CMAKE_APPBUNDLE_PATH.",
	"assets/variables.json.CMAKE_SYSTEM_FRAMEWORK_PATH": "Ścieżka wyszukiwania dla struktur systemu macOS używana przez polecenia find_library, find_package, find_path i find_file. Domyślnie zawiera standardowe katalogi dla bieżącego systemu. Nie jest przeznaczona do modyfikowania przez projekt — do tego służy właściwość CMAKE_APPBUNDLE_PATH.",
	"assets/variables.json.CMAKE_SYSTEM_IGNORE_PATH": "Rozdzielana średnikami lista katalogów, które mają być ignorowane przez różne operacje znajdowania... () polecenia.",
	"assets/variables.json.CMAKE_SYSTEM_IGNORE_PREFIX_PATH": "Rozdzielana średnikami lista prefiksów wyszukiwania do zignorowania przez polecenia find_program, find_library, find_file i find_path. Prefiksy są również ignorowane przez tryb konfiguracji polecenia find_package (nie ma to wpływu na tryb modułu). Aby zamiast tego zignorować określone katalogi, zobacz CMAKE_IGNORE_NONPREFIX_VAR.",
	"assets/variables.json.CMAKE_SYSTEM_INCLUDE_PATH": "Rozdzielana średnikami lista katalogów określająca ścieżkę wyszukiwania dla poleceń find_file i find_path. Domyślnie zawiera standardowe katalogi dla bieżącego systemu. Nie jest przeznaczona do modyfikowania przez projekt — do tego służy zmienna CMAKE_INCLUDE_PATH. Zobacz też zmienną CMAKE_SYSTEM_PREFIX_PATH.",
	"assets/variables.json.CMAKE_SYSTEM_LIBRARY_PATH": "Rozdzielana średnikami lista katalogów określająca ścieżkę wyszukiwania dla polecenia find_library. Domyślnie zawiera standardowe katalogi dla bieżącego systemu. Nie jest przeznaczona do modyfikowania przez projekt — do tego służy zmienna CMAKE_LIBRARY_PATH. Zobacz też zmienną CMAKE_SYSTEM_PREFIX_PATH.",
	"assets/variables.json.CMAKE_SYSTEM_NAME": "Nazwa systemu operacyjnego, dla którego program CMake wykona kompilację. Zobacz zmienną CMAKE_SYSTEM_VERSION dla wersji systemu operacyjnego.",
	"assets/variables.json.CMAKE_SYSTEM_PREFIX_PATH": "Rozdzielona średnikami lista katalogów określających prefiksy instalacji przeszukiwane przez polecenia find_package, find_program, find_library, find_file i find_path. Każde polecenie powoduje dodanie odpowiednich podkatalogów (takich jak bin, lib lub include) w sposób określony w jego dokumentacji.",
	"assets/variables.json.CMAKE_SYSTEM_PROCESSOR": "W przypadku kompilowania innego niż skrośne ta zmienna ma taką samą wartość jak zmienna CMAKE_HOST_SYSTEM_PROCESSOR. W wielu przypadkach będzie zgodna z architekturą docelową kompilacji, ale nie jest to gwarantowane. (Np. w systemie Windows hostem może być architektura AMD64 nawet w przypadku korzystania z kompilatora MSVC cl z 32-bitową architekturą docelową).",
	"assets/variables.json.CMAKE_SYSTEM_PROGRAM_PATH": "Rozdzielana średnikami lista katalogów określających ścieżkę wyszukiwania dla polecenia find_program. Domyślnie zawiera standardowe katalogi dla bieżącego systemu. Nie jest przeznaczona do modyfikowania przez projekt — do tego służy zmienna CMAKE_PROGRAM_PATH. Zobacz też zmienną CMAKE_SYSTEM_PREFIX_PATH.",
	"assets/variables.json.CMAKE_SYSTEM_VERSION": "Wersja systemu operacyjnego, dla którego program CMake wykona kompilację. Zobacz zmienną CMAKE_SYSTEM_NAME dla nazwy systemu operacyjnego.",
	"assets/variables.json.CMAKE_TASKING_TOOLSET": "Wybierz zestaw narzędzi zadaniowych, który udostępnia kompilator",
	"assets/variables.json.CMAKE_TEST_LAUNCHER": "Ta zmienna jest używana do inicjowania właściwości docelowej TEST_LAUNCHER obiektów docelowych plików wykonywalnych podczas ich tworzenia. Służy do określania modułu uruchamiania dla uruchomionych testów dodawanych przez polecenie add_test, które uruchamiają element docelowy pliku wykonywalnego.",
	"assets/variables.json.CMAKE_TLS_CAINFO": "Określ wartość domyślną opcji TLS_CAINFO poleceń plików i plików. Domyślnie nie jest on ustawiony.",
	"assets/variables.json.CMAKE_TLS_VERIFY": "Określ wartość domyślną opcji TLS_VERIFY poleceń plików i plików. Jeśli ta zmienna nie jest ustawiona, polecenia sprawdzają zmienną środowiskową CMAKE_TLS_VERIFY. Jeśli żadna z nich nie jest ustawiona, wartość domyślna jest wyłączona.",
	"assets/variables.json.CMAKE_TLS_VERSION": "Określ wartość domyślną opcji TLS_VERSION poleceń plików i plików. Jeśli ta zmienna nie jest ustawiona, polecenia sprawdzają zmienną środowiskową CMAKE_TLS_VERSION.",
	"assets/variables.json.CMAKE_TOOLCHAIN_FILE": "Ścieżka do pliku łańcucha narzędzi dostarczonego do narzędzia CMake.",
	"assets/variables.json.CMAKE_TRY_COMPILE_CONFIGURATION": "Konfiguracja kompilacji używana dla projektów try_compile i try_run.",
	"assets/variables.json.CMAKE_TRY_COMPILE_NO_PLATFORM_VARIABLES": "Ustaw wartość true, aby w poleceniu try_compile nie propagować żadnych zmiennych platformy do projektu testowego.",
	"assets/variables.json.CMAKE_TRY_COMPILE_PLATFORM_VARIABLES": "Lista zmiennych, które podpis pliku źródłowego polecenia try_compile musi propagować do projektu testowego, aby miał tę samą platformę docelową, co projekt hosta.",
	"assets/variables.json.CMAKE_TRY_COMPILE_TARGET_TYPE": "Typ elementu docelowego generowanego dla wywołań polecenia try_compile przy użyciu podpisu pliku źródłowego. Prawidłowe wartości:",
	"assets/variables.json.CMAKE_TWEAK_VERSION": "Zdefiniowana jako 0 w celu zgodności z kodem napisanym dla starszych wersji narzędzia CMake, które mogą mieć zdefiniowane wyższe wartości.",
	"assets/variables.json.CMAKE_UNITY_BUILD": "Ta zmienna jest używana do inicjowania właściwości UNITY_BUILD elementów docelowych podczas ich tworzenia. Ustawienie wartości true włącza kompilację masową wielu źródeł w obrębie każdego elementu docelowego. Ta funkcja jest znana jako kompilacja Unity lub Jumbo.",
	"assets/variables.json.CMAKE_UNITY_BUILD_BATCH_SIZE": "Ta zmienna jest używana do inicjowania właściwości UNITY_BUILD_BATCH_SIZE elementów docelowych podczas ich tworzenia. Określa domyślny górny limit liczby plików źródłowych, które mogą być łączone w dowolnym pojedynczym pliku źródłowym aparatu Unity, gdy kompilacje Unity są włączone dla elementu docelowego.",
	"assets/variables.json.CMAKE_UNITY_BUILD_UNIQUE_ID": "Ta zmienna jest używana do inicjowania właściwości UNITY_BUILD_UNIQUE_ID obiektów docelowych podczas ich tworzenia. Określa nazwę unikatowego identyfikatora generowanego dla pliku w ramach kompilowania za pomocą aparatu Unity.",
	"assets/variables.json.CMAKE_USER_MAKE_RULES_OVERRIDE": "Określ plik narzędzia CMake, który przesłania informacje o platformie.",
	"assets/variables.json.CMAKE_USER_MAKE_RULES_OVERRIDE_LANG": "Określ plik narzędzia CMake, który przesłania informacje o platformie dla języka <LANG>.",
	"assets/variables.json.CMAKE_USE_RELATIVE_PATHS": "Ta zmienna nie ma żadnego efektu. Częściowo zaimplementowany efekt, który miała w poprzednich wersjach, został usunięty w narzędziu CMake 3.4.",
	"assets/variables.json.CMAKE_VERBOSE_MAKEFILE": "Włącz pełne dane wyjściowe z kompilacji pliku Makefile.",
	"assets/variables.json.CMAKE_VERIFY_INTERFACE_HEADER_SETS": "Ta zmienna służy do inicjowania właściwości VERIFY_INTERFACE_HEADER_SETS elementów docelowych podczas ich tworzenia. Ustawienie wartości true powoduje włączenie weryfikacji zestawu nagłówków.",
	"assets/variables.json.CMAKE_VERSION": "Ciąg wersji narzędzia CMake w postaci trzech składników nieujemnej liczby całkowitej rozdzielonych kropkami (.), po których może następować znak - i inne informacje. Pierwsze dwa składniki reprezentują poziom funkcji, a trzeci składnik reprezentuje poziom poprawki błędu lub datę opracowania.",
	"assets/variables.json.CMAKE_VISIBILITY_INLINES_HIDDEN": "Wartość domyślna właściwości VISIBILITY_INLINES_HIDDEN elementu docelowego podczas tworzenia elementu docelowego.",
	"assets/variables.json.CMAKE_VS_DEBUGGER_COMMAND": "Ta zmienna jest używana do inicjowania właściwości VS_DEBUGGER_COMMAND w każdym elemencie docelowym podczas jego tworzenia. Sprawdź właściwości elementu docelowego, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_VS_DEBUGGER_COMMAND_ARGUMENTS": "Ta zmienna jest używana do inicjowania właściwości VS_DEBUGGER_COMMAND_ARGUMENTS w każdym elemencie docelowym podczas jego tworzenia. Sprawdź właściwości elementu docelowego, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_VS_DEBUGGER_ENVIRONMENT": "Ta zmienna jest używana do inicjowania właściwości VS_DEBUGGER_ENVIRONMENT w każdym elemencie docelowym podczas jego tworzenia. Sprawdź właściwości elementu docelowego, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_VS_DEBUGGER_WORKING_DIRECTORY": "Ta zmienna jest używana do inicjowania właściwości VS_DEBUGGER_WORKING_DIRECTORY w każdym elemencie docelowym podczas jego tworzenia. Sprawdź właściwości elementu docelowego, aby uzyskać dodatkowe informacje.",
	"assets/variables.json.CMAKE_VS_DEVENV_COMMAND": "Generatory dla programu Visual Studio 12 2013 i nowszych wersji ustawiają tę zmienną na polecenie devenv.com zainstalowane z odpowiednią wersją programu Visual Studio. Ta zmienna może być pusta w przypadku wersji programu Visual Studio Express, ponieważ nie udostępniają one tego narzędzia.",
	"assets/variables.json.CMAKE_VS_GLOBALS": "Lista rekordów Key=Value do ustawiania dla elementu docelowego jako właściwości docelowe VS_GLOBAL_ z variable=Key i wartością Value.",
	"assets/variables.json.CMAKE_VS_INCLUDE_INSTALL_TO_DEFAULT_BUILD": "Dołącz element docelowy INSTALL do domyślnej kompilacji.",
	"assets/variables.json.CMAKE_VS_INCLUDE_PACKAGE_TO_DEFAULT_BUILD": "Dołącz element docelowy PACKAGE do domyślnej kompilacji.",
	"assets/variables.json.CMAKE_VS_INTEL_Fortran_PROJECT_VERSION": "Podczas generowania dla programu Visual Studio 12 2013 lub nowszego z zainstalowaną wtyczką Intel Fortran ta właściwość określa wersję formatu pliku projektu vfproj. Jest przeznaczona do użytku wewnętrznego przez narzędzie CMake i nie powinna być używana przez kod projektu.",
	"assets/variables.json.CMAKE_VS_JUST_MY_CODE_DEBUGGING": "Włącz opcję Tylko mój kod przy użyciu debugera programu Visual Studio.",
	"assets/variables.json.CMAKE_VS_MSBUILD_COMMAND": "Generatory dla programu Visual Studio 12 2013 i nowszych wersji ustawiają tę zmienną na polecenie programu MSBuild.exe zainstalowanego z odpowiednią wersją programu Visual Studio.",
	"assets/variables.json.CMAKE_VS_NO_COMPILE_BATCHING": "Wyłącz przetwarzanie wsadowe kompilacji podczas korzystania z generatorów programu Visual Studio.",
	"assets/variables.json.CMAKE_VS_NsightTegra_VERSION": "W przypadku używania generatora programu Visual Studio ze zmienną CMAKE_SYSTEM_NAME ustawioną na wartość Android, ta zmienna zawiera numer wersji zainstalowanego środowiska NVIDIA Nsight Tegra Visual Studio Edition.",
	"assets/variables.json.CMAKE_VS_NUGET_PACKAGE_RESTORE": "W przypadku korzystania z generatora Visual Studio ta zmienna pamięci podręcznej określa, czy program msbuild ma automatycznie próbować przywrócić pakiety NuGet przed kompilacją. Pakiety NuGet można zdefiniować przy użyciu właściwości VS_PACKAGE_REFERENCES w elemencie docelowym. Jeśli nie zdefiniowano odwołań do pakietu, to ustawienie nic nie zrobi.",
	"assets/variables.json.CMAKE_VS_PLATFORM_NAME": "Nazwa platformy docelowej programu Visual Studio używana przez bieżący generator.",
	"assets/variables.json.CMAKE_VS_PLATFORM_NAME_DEFAULT": "Wartość domyślna dla nazwy platformy docelowej programu Visual Studio dla bieżącego generatora bez uwzględnienia wartości zmiennej CMAKE_GENERATOR_PLATFORM. W przypadku generatorów programu Visual Studio dla programu VS 2017 i starszych jest to zawsze Win32. W przypadku programu VS 2019 i nowszych wartość jest oparta na platformie hosta.",
	"assets/variables.json.CMAKE_VS_PLATFORM_TOOLSET": "Nazwa zestawu narzędzi platformy Visual Studio.",
	"assets/variables.json.CMAKE_VS_PLATFORM_TOOLSET_CUDA": "Wersja zestawu narzędzi NVIDIA CUDA Toolkit do użycia dla zestawu narzędzi Visual Studio.",
	"assets/variables.json.CMAKE_VS_PLATFORM_TOOLSET_CUDA_CUSTOM_DIR": "Ścieżka do autonomicznego zestawu narzędzi NVIDIA CUDA toolkit (np. wyodrębnionego z Instalatora).",
	"assets/variables.json.CMAKE_VS_PLATFORM_TOOLSET_FORTRAN": "Kompilator Fortran do użycia przez projekty programu Visual Studio.",
	"assets/variables.json.CMAKE_VS_PLATFORM_TOOLSET_HOST_ARCHITECTURE": "Preferowana architektura narzędzi programu Visual Studio.",
	"assets/variables.json.CMAKE_VS_PLATFORM_TOOLSET_VERSION": "Zestaw narzędzi platformy Visual Studio.",
	"assets/variables.json.CMAKE_VS_SDK_EXCLUDE_DIRECTORIES": "Ta zmienna pozwala przesłonić domyślne katalogi wykluczane programu Visual Studio.",
	"assets/variables.json.CMAKE_VS_SDK_EXECUTABLE_DIRECTORIES": "Ta zmienna pozwala przesłonić domyślne katalogi wykonywalne programu Visual Studio.",
	"assets/variables.json.CMAKE_VS_SDK_INCLUDE_DIRECTORIES": "Ta zmienna pozwala przesłonić domyślne katalogi uwzględniane programu Visual Studio.",
	"assets/variables.json.CMAKE_VS_SDK_LIBRARY_DIRECTORIES": "Ta zmienna pozwala przesłonić domyślne katalogi bibliotek programu Visual Studio.",
	"assets/variables.json.CMAKE_VS_SDK_LIBRARY_WINRT_DIRECTORIES": "Ta zmienna pozwala przesłonić domyślne katalogi WinRT bibliotek programu Visual Studio.",
	"assets/variables.json.CMAKE_VS_SDK_REFERENCE_DIRECTORIES": "Ta zmienna pozwala przesłonić domyślne katalogi odwołań programu Visual Studio.",
	"assets/variables.json.CMAKE_VS_SDK_SOURCE_DIRECTORIES": "Ta zmienna pozwala przesłonić domyślne katalogi źródłowe programu Visual Studio.",
	"assets/variables.json.CMAKE_VS_TARGET_FRAMEWORK_IDENTIFIER": "Identyfikator platformy docelowej programu Visual Studio.",
	"assets/variables.json.CMAKE_VS_TARGET_FRAMEWORK_TARGETS_VERSION": "Docelowa wersja platformy docelowej programu Visual Studio.",
	"assets/variables.json.CMAKE_VS_TARGET_FRAMEWORK_VERSION": "Wersja platformy docelowej programu Visual Studio.",
	"assets/variables.json.CMAKE_VS_USE_DEBUG_LIBRARIES": "Wskaż generatorom programu Visual Studio, które konfiguracje są uznawane za konfiguracje debugowania. Steruje to ustawieniem UseDebugLibraries w każdej konfiguracji pliku .vcxproj.",
	"assets/variables.json.CMAKE_VS_VERSION_BUILD_NUMBER": "Wersja programu Visual Studio.",
	"assets/variables.json.CMAKE_VS_WINDOWS_TARGET_PLATFORM_MIN_VERSION": "Poinformuj generatory programu Visual Studio, aby używały podanej minimalnej wersji platformy docelowej systemu Windows.",
	"assets/variables.json.CMAKE_VS_WINDOWS_TARGET_PLATFORM_VERSION": "Wersja docelowej platformy Windows programu Visual Studio.",
	"assets/variables.json.CMAKE_VS_WINDOWS_TARGET_PLATFORM_VERSION_MAXIMUM": "Przesłoń maksymalną wersję zestawu Windows 10 SDK dla programu VS 2015 i nowszych.",
	"assets/variables.json.CMAKE_VS_WINRT_BY_DEFAULT": "Poinformuj generatory programu Visual Studio dla programu VS 2010 i nowszych, że platforma docelowa domyślnie włącza kompilację WinRT i należy ją jawnie wyłączyć, jeśli opcja /ZW lub VS_WINRT_COMPONENT zostanie pominięta (w przeciwieństwie do włączenia jej, gdy jedna z tych opcji jest obecna)",
	"assets/variables.json.CMAKE_WARN_DEPRECATED": "Określa, czy generować ostrzeżenia dla przestarzałych funkcji.",
	"assets/variables.json.CMAKE_WARN_ON_ABSOLUTE_INSTALL_DESTINATION": "Żądaj, aby skrypt cmake_install.cmake generował ostrzeżenie przy każdym napotkaniu pliku z bezwzględną ścieżką INSTALL DESTINATION.",
	"assets/variables.json.CMAKE_WATCOM_RUNTIME_LIBRARY": "Wybierz bibliotekę środowiska uruchomieniowego Watcom do użycia przez kompilatory przeznaczone dla usługi ABI Watcom. Ta zmienna służy do inicjowania właściwości WATCOM_RUNTIME_LIBRARY we wszystkich obiektach docelowych podczas ich tworzenia. Jest on również propagowany przez wywołania polecenia try_compile do projektu testowego.",
	"assets/variables.json.CMAKE_WIN32_EXECUTABLE": "Wartość domyślna właściwości WIN32_EXECUTABLE elementów docelowych.",
	"assets/variables.json.CMAKE_WINDOWS_EXPORT_ALL_SYMBOLS": "Wartość domyślna właściwości elementu docelowego WINDOWS_EXPORT_ALL_SYMBOLS. Ta zmienna jest używana do inicjowania właściwości dla każdego elementu docelowego po jego utworzeniu.",
	"assets/variables.json.CMAKE_XCODE_ATTRIBUTE_an-attribute": "Ustaw bezpośrednio docelowe atrybuty środowiska Xcode.",
	"assets/variables.json.CMAKE_XCODE_BUILD_SYSTEM": "Wybór systemu kompilacji programu Xcode.",
	"assets/variables.json.CMAKE_XCODE_GENERATE_SCHEME": "Jeśli jest włączona, generator Xcode wygeneruje pliki schematów. Są one przydatne do wywoływania akcji analyze, archive, build-for-testing i test z poziomu wiersza polecenia.",
	"assets/variables.json.CMAKE_XCODE_GENERATE_TOP_LEVEL_PROJECT_ONLY": "Jeśli jest włączona, generator Xcode wygeneruje tylko jeden plik projektu Xcode dla polecenia project() najwyższego poziomu zamiast generować go dla każdego polecenia project().",
	"assets/variables.json.CMAKE_XCODE_LINK_BUILD_PHASE_MODE": "Ta zmienna jest używana do inicjowania właściwości XCODE_LINK_BUILD_PHASE_MODE w obiektach docelowych. Ma wpływ na metody używane przez generator Xcode do łączenia różnego rodzaju bibliotek. Wartość domyślna to NONE.",
	"assets/variables.json.CMAKE_XCODE_PLATFORM_TOOLSET": "Wybór kompilatora pakietu narzędzi Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_ADDRESS_SANITIZER": "Określa, czy włączyć moduł czyszczący adres w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_ADDRESS_SANITIZER_USE_AFTER_RETURN": "Określa, czy włączyć wykrywanie użycia stosu po powrocie w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_DEBUG_DOCUMENT_VERSIONING": "Określa, czy włączyć opcję Zezwalaj na debugowaniew podczas używania przeglądarki wersji dokumentów w sekcji Opcje wygenerowanego schematu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_DISABLE_MAIN_THREAD_CHECKER": "Określa, czy wyłączyć narzędzie Main Thread Checker w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_DYNAMIC_LIBRARY_LOADS": "Określa, czy włączyć dynamiczne ładowanie bibliotek w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_DYNAMIC_LINKER_API_USAGE": "Określa, czy włączyć użycie interfejsu API konsolidatora dynamicznego w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_ENABLE_GPU_API_VALIDATION": "Wartość właściwości Metal: walidacja interfejsu API w sekcji Opcje wygenerowanego schematu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_ENABLE_GPU_FRAME_CAPTURE_MODE": "Wartość właściwości przechwytywania ramek procesora GPU w sekcji Opcje wygenerowanego schematu Xcode. Przykładowe wartości to Metal i Wyłączone.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_ENABLE_GPU_SHADER_VALIDATION": "Wartość właściwości Metal: sprawdzanie poprawności cieniowania pikseli w sekcji Opcje wygenerowanego schematu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_ENVIRONMENT": "Określ zmienne środowiskowe, które powinny zostać dodane do sekcji Arguments wygenerowanego schematu środowiska Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_GUARD_MALLOC": "Określa, czy włączyć strażnika funkcji malloc w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_LAUNCH_CONFIGURATION": "Ustaw konfigurację kompilacji, aby uruchomić element docelowy.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_LAUNCH_MODE": "Wartość właściwości Launch w sekcji Informacje wygenerowanego schematu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_MAIN_THREAD_CHECKER_STOP": "Określa, czy włączyć opcję Pause on issues (Wstrzymanie w razie wystąpienia problemów) dla narzędzia Main Thread Checker w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_MALLOC_GUARD_EDGES": "Określa, czy włączyć strażnika alokacji funkcji malloc w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_MALLOC_SCRIBBLE": "Określa, czy włączyć nadpisywanie dla funkcji malloc w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_MALLOC_STACK": "Określa, czy włączyć śledzenie stosu dla funkcji malloc w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_THREAD_SANITIZER": "Określa, czy włączyć moduł czyszczący wątku w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_THREAD_SANITIZER_STOP": "Określa, czy włączyć wstrzymanie modułu czyszczącego wątku w przypadku wystąpienia problemów w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_UNDEFINED_BEHAVIOUR_SANITIZER": "Określa, czy włączyć moduł czyszczący niezdefiniowanego zachowania w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_UNDEFINED_BEHAVIOUR_SANITIZER_STOP": "Określa, czy włączyć opcję wstrzymania modułu czyszczącego niezdefiniowanego zachowania w przypadku wystąpienia problemów w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_WORKING_DIRECTORY": "Określ katalog roboczy akcji przebiegu i profilu w wygenerowanym schemacie Xcode.",
	"assets/variables.json.CMAKE_XCODE_SCHEME_ZOMBIE_OBJECTS": "Określa, czy włączyć obiekty zombie w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.CMAKE_XCODE_XCCONFIG": "Jeśli zostanie to ustawione, generator Xcode zarejestruje określony plik jako globalny plik XCConfig. W przypadku plików XCConfig na poziomie docelowym zobacz XCODE_XCCONFIG właściwość docelową.",
	"assets/variables.json.CPACK_ABSOLUTE_DESTINATION_FILES": "Lista plików zainstalowanych przy użyciu ścieżki określonej przez właściwość ABSOLUTE DESTINATION.",
	"assets/variables.json.CPACK_COMPONENT_INCLUDE_TOPLEVEL_DIRECTORY": "Przełącznik logiczny do uwzględniania/wykluczania katalogu najwyższego poziomu (w przypadku składnika).",
	"assets/variables.json.CPACK_CUSTOM_INSTALL_VARIABLES": "Zmienne CPack (ustawiane przez np. CPack-D, CPackConfig.cmake lub skrypty CPACK_PROJECT_CONFIG_FILE) nie są bezpośrednio widoczne w skryptach instalacji. Zamiast tego jeden z nich może przekazać listę par varName= value w zmiennej CPACK_CUSTOM_INSTALL_VARIABLES. W czasie instalacji każdy element listy spowoduje ustawienie zmiennej określonej nazwy (varName) na daną wartość. Symbol = może zostać pominięty w przypadku pustej wartości.",
	"assets/variables.json.CPACK_ERROR_ON_ABSOLUTE_INSTALL_DESTINATION": "Żądaj, aby skrypt cmake_install.cmake generował błąd natychmiast po napotkaniu pliku z bezwzględną ścieżką INSTALL DESTINATION.",
	"assets/variables.json.CPACK_INCLUDE_TOPLEVEL_DIRECTORY": "Przełącznik logiczny do uwzględniania/wykluczania katalogu najwyższego poziomu.",
	"assets/variables.json.CPACK_INSTALL_DEFAULT_DIRECTORY_PERMISSIONS": "Domyślne uprawnienia do niejawnie utworzonych katalogów podczas pakowania.",
	"assets/variables.json.CPACK_PACKAGING_INSTALL_PREFIX": "Prefiks używany w pakiecie kompilacji.",
	"assets/variables.json.CPACK_SET_DESTDIR": "Przełącznik logiczny stosowania przez narzędzie CPack mechanizmu DESTDIR podczas pakowania.",
	"assets/variables.json.CPACK_WARN_ON_ABSOLUTE_INSTALL_DESTINATION": "Żądaj, aby narzędzie CPack generowało ostrzeżenie przy każdym napotkaniu pliku z bezwzględną ścieżką INSTALL DESTINATION.",
	"assets/variables.json.CTEST_BINARY_DIRECTORY": "Określ ustawienie BuildDirectory narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_BUILD_COMMAND": "Określ ustawienie MakeCommand narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_BUILD_NAME": "Określ ustawienie BuildName narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_BZR_COMMAND": "Określ ustawienie BZRCommand narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_BZR_UPDATE_OPTIONS": "Określ ustawienie BZRUpdateOptions narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_CHANGE_ID": "Określ ustawienie ChangeId narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_CHECKOUT_COMMAND": "Poinstruuj polecenie ctest_start, jak wyewidencjonować lub zainicjować katalog źródłowy w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_CONFIGURATION_TYPE": "Określ ustawienie DefaultCTestConfigurationType narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_CONFIGURE_COMMAND": "Określ ustawienie ConfigureCommand narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_COVERAGE_COMMAND": "Określ ustawienie CoverageCommand narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_COVERAGE_EXTRA_FLAGS": "Określ ustawienie CoverageExtraFlags narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_CURL_OPTIONS": "Określ ustawienie CurlOptions narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_CUSTOM_COVERAGE_EXCLUDE": "Lista wyrażeń regularnych, które będą używane do wykluczania plików na podstawie ich ścieżki z danych wyjściowych pokrycia przez polecenie ctest_coverage.",
	"assets/variables.json.CTEST_CUSTOM_ERROR_EXCEPTION": "Lista wyrażeń regularnych, które będą używane do wykluczania podczas wykrywania komunikatów o błędach w danych wyjściowych kompilacji za pomocą polecenia ctest_build.",
	"assets/variables.json.CTEST_CUSTOM_ERROR_MATCH": "Lista wyrażeń regularnych, które będą używane do wykrywania komunikatów o błędach w danych wyjściowych kompilacji za pomocą polecenia ctest_build.",
	"assets/variables.json.CTEST_CUSTOM_ERROR_POST_CONTEXT": "Liczba wierszy do uwzględnienia jako kontekst, które następują po komunikacie o błędzie polecenia ctest_build. Wartość domyślna to 10.",
	"assets/variables.json.CTEST_CUSTOM_ERROR_PRE_CONTEXT": "Liczba wierszy do uwzględnienia jako kontekst, które poprzedzają komunikat o błędzie przez polecenie ctest_build. Wartość domyślna to 10.",
	"assets/variables.json.CTEST_CUSTOM_MAXIMUM_FAILED_TEST_OUTPUT_SIZE": "Podczas zapisywania danych wyjściowych testu zakończonego niepowodzeniem jest to maksymalny rozmiar w bajtach, który zostanie zebrany przez polecenie ctest_test. Wartość domyślna to 307200 (300 KiB). Zobacz CTEST_CUSTOM_TEST_OUTPUT_TRUNCATION, aby uzyskać informacje o możliwych trybach obcięć.",
	"assets/variables.json.CTEST_CUSTOM_MAXIMUM_NUMBER_OF_ERRORS": "Maksymalna liczba błędów, które zostaną wykryte w jednym kroku kompilacji. Po tej liczbie błędów polecenie ctest_test obetnie dane wyjściowe. Wartość domyślna to 50.",
	"assets/variables.json.CTEST_CUSTOM_MAXIMUM_NUMBER_OF_WARNINGS": "Maksymalna liczba ostrzeżeń, które zostaną wykryte w jednym kroku kompilacji. Po tej liczbie ostrzeżeń polecenie ctest_test obetnie dane wyjściowe. Wartość domyślna to 50.",
	"assets/variables.json.CTEST_CUSTOM_MAXIMUM_PASSED_TEST_OUTPUT_SIZE": "Podczas zapisywania danych wyjściowych testu z wynikiem pozytywnym jest to maksymalny rozmiar (w bajtach), który zostanie zebrany przez polecenie ctest_test. Wartość domyślna to 1024 (1 KiB). Zobacz CTEST_CUSTOM_TEST_OUTPUT_TRUNCATION, aby uzyskać informacje o możliwych trybach obcięć.",
	"assets/variables.json.CTEST_CUSTOM_MEMCHECK_IGNORE": "Lista wyrażeń regularnych używanych do wykluczania testów w czasie wykonywania polecenia ctest_memcheck.",
	"assets/variables.json.CTEST_CUSTOM_POST_MEMCHECK": "Lista poleceń do uruchomienia na końcu polecenia ctest_memcheck.",
	"assets/variables.json.CTEST_CUSTOM_POST_TEST": "Lista poleceń do uruchomienia na końcu polecenia ctest_test.",
	"assets/variables.json.CTEST_CUSTOM_PRE_MEMCHECK": "Lista poleceń do uruchomienia na początku polecenia ctest_memcheck.",
	"assets/variables.json.CTEST_CUSTOM_PRE_TEST": "Lista poleceń do uruchomienia na początku polecenia ctest_test.",
	"assets/variables.json.CTEST_CUSTOM_TESTS_IGNORE": "Lista nazw testów do wykluczenia z zestawu testów uruchamianych przez polecenie ctest_test.",
	"assets/variables.json.CTEST_CUSTOM_TEST_OUTPUT_TRUNCATION": "Ustaw tryb obcinania danych wyjściowych testu na wypadek skonfigurowania maksymalnego rozmiaru za pośrednictwem zmiennych CTEST_CUSTOM_MAXIMUM_PASSED_TEST_OUTPUT_SIZE lub CTEST_CUSTOM_MAXIMUM_FAILED_TEST_OUTPUT_SIZE. Domyślnie końcówka danych wyjściowych zostanie obcięta. Inne możliwe wartości to środkowe i główne.",
	"assets/variables.json.CTEST_CUSTOM_WARNING_EXCEPTION": "Lista wyrażeń regularnych, które będą używane do wykluczania podczas wykrywania komunikatów ostrzegawczych w danych wyjściowych kompilacji przez polecenie ctest_build.",
	"assets/variables.json.CTEST_CUSTOM_WARNING_MATCH": "Lista wyrażeń regularnych, które będą używane do wykrywania komunikatów ostrzegawczych w danych wyjściowych kompilacji przez polecenie ctest_build.",
	"assets/variables.json.CTEST_CVS_CHECKOUT": "Przestarzałe. Zamiast tej użyj właściwości CTEST_CHECKOUT_COMMAND.",
	"assets/variables.json.CTEST_CVS_COMMAND": "Określ ustawienie CVSCommand narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_CVS_UPDATE_OPTIONS": "Określ ustawienie CVSUpdateOptions narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_DROP_LOCATION": "Określ ustawienie DropLocation narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_DROP_METHOD": "Określ ustawienie DropMethod narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_DROP_SITE": "Określ ustawienie DropSite narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_DROP_SITE_CDASH": "Określ ustawienie IsCDash narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_DROP_SITE_PASSWORD": "Określ ustawienie DropSitePassword narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_DROP_SITE_USER": "Określ ustawienie DropSiteUser narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_EXTRA_COVERAGE_GLOB": "Lista wyrażeń regularnych, które będą używane przez polecenie ctest_coverage do znajdowania plików, które powinny być pokryte.",
	"assets/variables.json.CTEST_GIT_COMMAND": "Określ ustawienie GITCommand narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_GIT_INIT_SUBMODULES": "Określ ustawienie GITInitSubmodules narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_GIT_UPDATE_CUSTOM": "Określ ustawienie GITUpdateCustom narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_GIT_UPDATE_OPTIONS": "Określ ustawienie GITUpdateOptions narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_HG_COMMAND": "Określ ustawienie HGCommand narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_HG_UPDATE_OPTIONS": "Określ ustawienie HGUpdateOptions narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_LABELS_FOR_SUBPROJECTS": "Określ ustawienie LabelsForSubprojects narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_MEMORYCHECK_COMMAND": "Określ ustawienie MemoryCheckCommand narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_MEMORYCHECK_COMMAND_OPTIONS": "Określ ustawienie MemoryCheckCommandOptions narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_MEMORYCHECK_SANITIZER_OPTIONS": "Określ ustawienie MemoryCheckSanitizerOptions narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_MEMORYCHECK_SUPPRESSIONS_FILE": "Określ ustawienie MemoryCheckSuppressionFile narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_MEMORYCHECK_TYPE": "Określ ustawienie MemoryCheckType narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest. Prawidłowe wartości to Valgrind, Purify, BoundsChecker, DrMemory, CudaSanitizer, ThreadSanitizer, AddressSanitizer, LeakSanitizer, MemorySanitizer i UndefinedBehaviorSanitizer.",
	"assets/variables.json.CTEST_NIGHTLY_START_TIME": "Określ ustawienie NightlyStartTime narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_P4_CLIENT": "Określ ustawienie P4Client narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_P4_COMMAND": "Określ ustawienie P4Command narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_P4_OPTIONS": "Określ ustawienie P4Options narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_P4_UPDATE_OPTIONS": "Określ ustawienie P4UpdateOptions narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_RESOURCE_SPEC_FILE": "Określ ustawienie ResourceSpecFile narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_RUN_CURRENT_SCRIPT": "Ustawienie 0 zapobiega ponownemu uruchomieniu narzędzia ctest po osiągnięciu końca uruchomienia skryptu przez wywołanie skryptu ctest -S.",
	"assets/variables.json.CTEST_SCP_COMMAND": "Starsza opcja. Nieużywana.",
	"assets/variables.json.CTEST_SCRIPT_DIRECTORY": "Katalog zawierający skrypt CTest najwyższego poziomu. Koncepcja jest podobna do CMAKE_SOURCE_DIR.",
	"assets/variables.json.CTEST_SITE": "Określ ustawienie Site narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_SOURCE_DIRECTORY": "Określ ustawienie SourceDirectory narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_SUBMIT_INACTIVITY_TIMEOUT": "Określ ustawienie SubmitInactivityTimeout narzędzia CTest w skrypcie po stronie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_SUBMIT_URL": "Określ ustawienie SubmitURL narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_SVN_COMMAND": "Określ ustawienie SVNCommand narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_SVN_OPTIONS": "Określ ustawienie SVNOptions narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_SVN_UPDATE_OPTIONS": "Określ ustawienie SVNUpdateOptions narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_TEST_LOAD": "Określ ustawienie TestLoad w kroku Test narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest. Ustawia ono wartość domyślną dla opcji TEST_LOAD polecenia ctest_test.",
	"assets/variables.json.CTEST_TEST_TIMEOUT": "Określ ustawienie TimeOut narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_TLS_VERIFY": "Określ ustawienie TLSVerify narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest lub w kodzie CMakeLists.txt projektu przed dołączeniem modułu CTest. Wartość jest wartością logiczną wskazującą, czy należy zweryfikować certyfikat serwera podczas przesyłania do pulpitu nawigacyjnego za pośrednictwem adresów URL https://.",
	"assets/variables.json.CTEST_TLS_VERSION": "Określ ustawienie TLSVersion narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest lub w kodzie CMakeLists.txt projektu przed dołączeniem modułu CTest. Wartość jest minimalną wersją protokołu TLS dozwoloną podczas przesyłania do pulpitu nawigacyjnego za pośrednictwem adresów URL https://.",
	"assets/variables.json.CTEST_TRIGGER_SITE": "Starsza opcja. Nieużywana.",
	"assets/variables.json.CTEST_UPDATE_COMMAND": "Określ ustawienie UpdateCommand narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_UPDATE_OPTIONS": "Określ ustawienie UpdateOptions narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_UPDATE_VERSION_ONLY": "Określ ustawienie UpdateVersionOnly narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_UPDATE_VERSION_OVERRIDE": "Określ ustawienie UpdateVersionOverride narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CTEST_USE_LAUNCHERS": "Określ ustawienie UseLaunchers narzędzia CTest w skrypcie klienta pulpitu nawigacyjnego narzędzia CTest.",
	"assets/variables.json.CYGWIN": "Wartość true dla kolekcji narzędzi Cygwin.",
	"assets/variables.json.ENV": "Operator do odczytywania zmiennych środowiskowych.",
	"assets/variables.json.EXECUTABLE_OUTPUT_PATH": "Stara zmienna lokalizacji pliku wykonywalnego.",
	"assets/variables.json.GHSMULTI": "1 w przypadku korzystania z generatora Green Hills MULTI.",
	"assets/variables.json.IOS": "Ustaw wartość 1, jeśli system docelowy (CMAKE_SYSTEM_NAME) to iOS.",
	"assets/variables.json.LIBRARY_OUTPUT_PATH": "Stara zmienna lokalizacji biblioteki.",
	"assets/variables.json.LINUX": "Ustaw wartość true, gdy system docelowy to Linux.",
	"assets/variables.json.MINGW": "Ustaw na wartość true, gdy co najmniej jeden język jest włączony z kompilatorem przeznaczonym docelowo dla interfejsu ABI GNU w systemie Windows (MinGW).",
	"assets/variables.json.MSVC": "Ustaw na wartość true, jeśli kompilator jest wersją programu Microsoft Visual C++ lub innym kompilatorem symulującym składnię wiersza polecenia cl programu Visual C++.",
	"assets/variables.json.MSVC10": "Niezalecane. Zamiast tego użyj zmiennej MSVC_VERSION.",
	"assets/variables.json.MSVC11": "Niezalecane. Zamiast tego użyj zmiennej MSVC_VERSION.",
	"assets/variables.json.MSVC12": "Niezalecane. Zamiast tego użyj zmiennej MSVC_VERSION.",
	"assets/variables.json.MSVC14": "Niezalecane. Zamiast tego użyj zmiennej MSVC_VERSION.",
	"assets/variables.json.MSVC60": "Niezalecane. Zamiast tego użyj zmiennej MSVC_VERSION.",
	"assets/variables.json.MSVC70": "Niezalecane. Zamiast tego użyj zmiennej MSVC_VERSION.",
	"assets/variables.json.MSVC71": "Niezalecane. Zamiast tego użyj zmiennej MSVC_VERSION.",
	"assets/variables.json.MSVC80": "Niezalecane. Zamiast tego użyj zmiennej MSVC_VERSION.",
	"assets/variables.json.MSVC90": "Niezalecane. Zamiast tego użyj zmiennej MSVC_VERSION.",
	"assets/variables.json.MSVC_IDE": "Wartość true w przypadku używania środowiska IDE programu Microsoft Visual C++.",
	"assets/variables.json.MSVC_TOOLSET_VERSION": "Używana wersja zestawu narzędzi programu Microsoft Visual C/C++, jeśli istnieje. Jeśli używany zestaw narzędzi kompilatora typu MSVC, ta zmienna jest ustawiana na podstawie wersji kompilatora podanej przez zmienną MSVC_VERSION.",
	"assets/variables.json.MSVC_VERSION": "Używana wersja programu Microsoft Visual C/C++, jeśli jest używany. Jeśli używany jest kompilator symulujący program Visual C++, ta zmienna jest ustawiana na symulowaną wersję zestawu narzędzi zgodnie z definicją preprocesora _MSC_VER.",
	"assets/variables.json.MSYS": "Wartość true w przypadku używania generatora MSYS Makefiles.",
	"assets/variables.json.PackageName_ROOT": "Wywołania find_package(<PackageName>) będą wyszukiwać w prefiksach określonych przez zmienną <PackageName>_ROOT CMake, gdzie <PackageName> jest nazwą (zachowaną wielkością liter) nadaną wywołaniu find_package, a _ROOT literałem. Na przykład find_package(Foo) będzie wyszukiwać prefiksy określone w zmiennej Foo_ROOT CMake (jeśli jest ustawiona). Zobacz zasady CMP0074.",
	"assets/variables.json.PROJECT-NAME_BINARY_DIR": "Katalog najwyższego poziomu plików binarnych dla projektu o podanej nazwie.",
	"assets/variables.json.PROJECT-NAME_DESCRIPTION": "Wartość podana dla opcji DESCRIPTION ostatniego wywołania polecenia project z nazwą projektu <PROJECT-NAME>, jeśli istnieje.",
	"assets/variables.json.PROJECT-NAME_HOMEPAGE_URL": "Wartość podana dla opcji HOMEPAGE_URL ostatniego wywołania polecenia project z nazwą projektu <PROJECT-NAME>, jeśli istnieje.",
	"assets/variables.json.PROJECT-NAME_IS_TOP_LEVEL": "Zmienna logiczna wskazująca, czy nazwany projekt został wywołany w pliku CMakeLists.txt najwyższego poziomu.",
	"assets/variables.json.PROJECT-NAME_SOURCE_DIR": "Katalog źródłowy najwyższego poziomu dla projektu o podanej nazwie.",
	"assets/variables.json.PROJECT-NAME_VERSION": "Wartość podana dla opcji VERSION ostatniego wywołania polecenia project z nazwą projektu <PROJECT-NAME>, jeśli istnieje.",
	"assets/variables.json.PROJECT-NAME_VERSION_MAJOR": "Pierwszy składnik numeru wersji zmiennej <PROJECT-NAME>_VERSION zgodnie z ustawieniem określonym przez polecenie project.",
	"assets/variables.json.PROJECT-NAME_VERSION_MINOR": "Drugi składnik numeru wersji zmiennej <PROJECT-NAME>_VERSION zgodnie z ustawieniem określonym przez polecenie project.",
	"assets/variables.json.PROJECT-NAME_VERSION_PATCH": "Trzeci składnik numeru wersji zmiennej <PROJECT-NAME>_VERSION zgodnie z ustawieniem określonym przez polecenie project.",
	"assets/variables.json.PROJECT-NAME_VERSION_TWEAK": "Czwarty składnik numeru wersji zmiennej <PROJECT-NAME>_VERSION zgodnie z ustawieniem określonym przez polecenie project.",
	"assets/variables.json.PROJECT_BINARY_DIR": "Pełna ścieżka do katalogu kompilacji dla projektu.",
	"assets/variables.json.PROJECT_DESCRIPTION": "Krótki opis projektu podany do polecenia project.",
	"assets/variables.json.PROJECT_HOMEPAGE_URL": "Adres URL strony głównej projektu.",
	"assets/variables.json.PROJECT_IS_TOP_LEVEL": "Zmienna logiczna wskazująca, czy ostatnio wywołane polecenie projektu w bieżącym lub powyższym zakresie znajdowało się w pliku CMakeLists.txt najwyższego poziomu.",
	"assets/variables.json.PROJECT_NAME": "Nazwa projektu podana dla polecenia project.",
	"assets/variables.json.PROJECT_SOURCE_DIR": "To jest katalog źródłowy ostatniego wywołania polecenia project wykonanego w bieżącym zakresie katalogu lub jednym z jego elementów nadrzędnych. Zauważ, że nie mają na niego wpływu wywołania polecenia project wykonane w zakresie katalogu podrzędnego (tj. z wywołania polecenia add_subdirectory z bieżącego zakresu).",
	"assets/variables.json.PROJECT_VERSION": "Wartość podana dla opcji VERSION ostatniego wywołania polecenia project, jeśli istnieje.",
	"assets/variables.json.PROJECT_VERSION_MAJOR": "Pierwszy składnik numeru wersji zmiennej PROJECT_VERSION zgodnie z ustawieniem określonym przez polecenie project.",
	"assets/variables.json.PROJECT_VERSION_MINOR": "Drugi składnik numeru wersji zmiennej PROJECT_VERSION zgodnie z ustawieniem określonym przez polecenie project.",
	"assets/variables.json.PROJECT_VERSION_PATCH": "Trzeci składnik numeru wersji zmiennej PROJECT_VERSION zgodnie z ustawieniem określonym przez polecenie project.",
	"assets/variables.json.PROJECT_VERSION_TWEAK": "Czwarty składnik numeru wersji zmiennej PROJECT_VERSION zgodnie z ustawieniem określonym przez polecenie project.",
	"assets/variables.json.UNIX": "Ustaw na wartość True, jeśli system docelowy to UNIX lub system podobny do UNIX (np. APPLE i CYGWIN). Zmienna CMAKE_SYSTEM_NAME powinna być odpytywana, jeśli potrzebne są dokładniejsze informacje o systemie docelowym.",
	"assets/variables.json.WIN32": "Ustaw wartość true, jeśli system docelowy to Windows (w tym Win64).",
	"assets/variables.json.WINCE": "Wartość true, gdy zmienna CMAKE_SYSTEM_NAME jest ustawiona na wartość WindowsCE.",
	"assets/variables.json.WINDOWS_PHONE": "Wartość true, gdy zmienna CMAKE_SYSTEM_NAME jest ustawiona na wartość WindowsPhone.",
	"assets/variables.json.WINDOWS_STORE": "Wartość true, gdy zmienna CMAKE_SYSTEM_NAME jest ustawiona na wartość WindowsStore.",
	"assets/variables.json.XCODE": "Wartość true w przypadku używania generatora środowiska Xcode.",
	"assets/variables.json.XCODE_VERSION": "Wersja środowiska Xcode (tylko generator środowiska Xcode).",
	"assets/variables.json.ADVANCED": "Wartość true, jeśli pozycja ma być domyślnie ukryta w graficznych interfejsach użytkownika.",
	"assets/variables.json.HELPSTRING": "Pomoc skojarzona z wpisem w graficznych interfejsach użytkownika.",
	"assets/variables.json.MODIFIED": "Wewnętrzna właściwość zarządzania. Nie ustawiaj jej ani nie pobieraj.",
	"assets/variables.json.STRINGS": "Wyliczaj możliwe wartości wpisów STRING na potrzeby wybierania graficznego interfejsu użytkownika.",
	"assets/variables.json.TYPE": "Typ widżetu do wprowadzania w graficznych interfejsach użytkownika.",
	"assets/variables.json.VALUE": "Wartość wpisu pamięci podręcznej.",
	"assets/variables.json.ADDITIONAL_CLEAN_FILES": "Rozdzielana średnikami lista plików lub katalogów, które zostaną usunięte jako część globalnego celu czyszczenia. Jest to przydatne do określania wygenerowanych plików lub katalogów, które są używane przez wiele obiektów docelowych lub przez samo narzędzie CMake lub które są generowane w sposób uniemożliwiający przechwycenie jako dane wyjściowe bądź produkty uboczne poleceń niestandardowych.",
	"assets/variables.json.ADDITIONAL_MAKE_CLEAN_FILES": "Dodatkowe pliki do usunięcia na etapie czyszczenia.",
	"assets/variables.json.BINARY_DIR": "Ta właściwość katalogu tylko do odczytu zgłasza ścieżkę bezwzględną do katalogu danych binarnych odpowiadającą źródłu, na którym następuje odczyt.",
	"assets/variables.json.BUILDSYSTEM_TARGETS": "Ta właściwość katalogu tylko do odczytu zawiera rozdzieloną średnikami listę elementów docelowych systemu kompilacji dodanych do katalogu przez wywołanie poleceń add_library, add_executable i add_custom_target. Lista nie zawiera żadnych importowanych elementów docelowych ani elementów docelowych będących aliasami, lecz zawiera biblioteki interfejsu. Każda pozycja na liście to nazwa logiczna elementu docelowego, którą można przekazać do funkcji get_property za pomocą opcji TARGET.",
	"assets/variables.json.CACHE_VARIABLES": "Lista zmiennych pamięci podręcznej dostępnych w bieżącym katalogu.",
	"assets/variables.json.CLEAN_NO_CUSTOM": "Ustaw na wartość true, aby generatory plików Makefile nie usuwały danych wyjściowych poleceń niestandardowych dla tego katalogu podczas wykonywania operacji make clean. Jest to ignorowane dla innych generatorów, ponieważ nie jest możliwe do zaimplementowania.",
	"assets/variables.json.CMAKE_CONFIGURE_DEPENDS": "Poinformuj program CMake o dodatkowych plikach wejściowych dla procesu konfiguracji. Jeśli dowolny nazwany plik zostanie zmodyfikowany, system kompilacji uruchomi ponowne program CMake w celu ponownego skonfigurowania pliku i ponownego wygenerowania systemu kompilacji.",
	"assets/variables.json.COMPILE_DEFINITIONS": "Definicje preprocesora na potrzeby kompilowania źródeł katalogu.",
	"assets/variables.json.COMPILE_DEFINITIONS_CONFIG": "Ignorowane. Zobacz zasady CMP0043 narzędzia CMake.",
	"assets/variables.json.COMPILE_OPTIONS": "Lista opcji do przekazania do kompilatora.",
	"assets/variables.json.DEFINITIONS": "Tylko na potrzeby zgodności narzędzia CMake 2.4. Zamiast tego użyj właściwości COMPILE_DEFINITIONS.",
	"assets/variables.json.EXCLUDE_FROM_ALL": "Ustaw tę właściwość katalogu na wartość true w podkatalogu, aby wykluczyć jego elementy docelowe z elementu docelowego „all” elementów nadrzędnych. W przypadku wykluczenia uruchomienie np. polecenia make w katalogu nadrzędnym domyślnie nie spowoduje skompilowania elementów docelowych w podkatalogu. Nie ma to wpływu na element docelowy „all” samego podkatalogu. Uruchomienie np. polecenia make wewnątrz podkatalogu nadal spowoduje skompilowanie jego elementów docelowych.",
	"assets/variables.json.IMPLICIT_DEPENDS_INCLUDE_TRANSFORM": "Określ transformacje linii #include dla zależności w katalogu.",
	"assets/variables.json.IMPORTED_TARGETS": "Ta właściwość katalogu tylko do odczytu zawiera rozdzieloną średnikami listę zaimportowanych elementów docelowych, które zostały dodane do katalogu za pomocą wywołań do poleceń add_library i add_executable. Każdy wpis na liście to nazwa logiczna elementu docelowego, która jest odpowiednia do przekazania do opcji TARGET polecenia get_property w przypadku wywołania w tym samym katalogu.",
	"assets/variables.json.INCLUDE_DIRECTORIES": "Lista katalogów wyszukiwania plików nagłówkowych preprocesora.",
	"assets/variables.json.INCLUDE_REGULAR_EXPRESSION": "Wyrażenie regularne skanowania plików nagłówkowych.",
	"assets/variables.json.INTERPROCEDURAL_OPTIMIZATION": "Ta właściwość katalogu już nie istnieje.",
	"assets/variables.json.INTERPROCEDURAL_OPTIMIZATION_CONFIG": "Ta właściwość katalogu już nie istnieje.",
	"assets/variables.json.LABELS": "Określ listę etykiet tekstowych skojarzonych z katalogiem i wszystkimi jego podkatalogami. Jest to równoważne z ustawieniem właściwości docelowej LABELS i właściwości testu LABELS we wszystkich elementach docelowych i testach w bieżącym katalogu i podkatalogach. Uwaga: moduły uruchamiania muszą mieć włączoną funkcję propagowania etykiet do elementów docelowych.",
	"assets/variables.json.LINK_DIRECTORIES": "Lista katalogów wyszukiwania konsolidatora.",
	"assets/variables.json.LINK_OPTIONS": "Lista opcji do użycia dla kroku konsolidacji elementów docelowych biblioteki udostępnionej, modułu i pliku wykonywalnego, a także krok konsolidacji urządzenia.",
	"assets/variables.json.LISTFILE_STACK": "Bieżący stos przetwarzanych plików listy.",
	"assets/variables.json.MACROS": "Lista poleceń makr dostępnych w bieżącym katalogu.",
	"assets/variables.json.PARENT_DIRECTORY": "Katalog źródłowy, który dodał bieżący podkatalog.",
	"assets/variables.json.RULE_LAUNCH_COMPILE": "Określ program uruchamiający dla reguł kompilacji.",
	"assets/variables.json.RULE_LAUNCH_CUSTOM": "Określ program uruchamiający dla reguł niestandardowych.",
	"assets/variables.json.RULE_LAUNCH_LINK": "Określ program uruchamiający dla reguł łączenia.",
	"assets/variables.json.SOURCE_DIR": "Ta właściwość katalogu tylko do odczytu zgłasza ścieżkę bezwzględną do katalogu źródłowego, w którym następuje odczyt.",
	"assets/variables.json.SUBDIRECTORIES": "Ta właściwość katalogu tylko do odczytu zawiera listę rozdzielonych średnikami podkatalogów przetworzonych dotąd przez polecenia add_subdirectory lub subdirs. Każdy wpis jest ścieżką bezwzględną do katalogu źródłowego (zawierającego plik CMakeLists.txt). Ta właściwość nadaje się do przekazania do opcji DIRECTORY polecenia get_property.",
	"assets/variables.json.SYSTEM": "Ta właściwość katalogu służy do inicjowania właściwości docelowej SYSTEM dla niezaimportowanych obiektów docelowych utworzonych w tym katalogu. Jest ona ustawiona na wartość „true” przez właściwości add_subdirectory i FetchContent_Declare, gdy opcja SYSTEM jest podana jako argument dla tych poleceń.",
	"assets/variables.json.TESTS": "Lista testów.",
	"assets/variables.json.TEST_INCLUDE_FILE": "Przestarzałe. Zamiast tego użyj elementu TEST_INCLUDE_FILES.",
	"assets/variables.json.TEST_INCLUDE_FILES": "Lista plików narzędzia cmake, które zostaną uwzględnione w czasie działania narzędzia ctest.",
	"assets/variables.json.VARIABLES": "Lista zmiennych zdefiniowanych w bieżącym katalogu.",
	"assets/variables.json.VS_GLOBAL_SECTION_POST_section": "Określ sekcję globalną postSolution w programie Visual Studio.",
	"assets/variables.json.VS_GLOBAL_SECTION_PRE_section": "Określ sekcję globalną preSolution w programie Visual Studio.",
	"assets/variables.json.VS_STARTUP_PROJECT": "Określ domyślny projekt startowy w rozwiązaniu programu Visual Studio.",
	"assets/variables.json.ALLOW_DUPLICATE_CUSTOM_TARGETS": "Zezwalaj na tworzenie zduplikowanych niestandardowych elementów docelowych.",
	"assets/variables.json.AUTOGEN_SOURCE_GROUP": "Nazwa elementu source_group dla plików wygenerowanych przez funkcje AUTOMOC, AUTORCC i AUTOUIC.",
	"assets/variables.json.AUTOGEN_TARGETS_FOLDER": "Nazwa elementu FOLDER dla elementów docelowych *_autogen dodawanych automatycznie przez narzędzie CMake na potrzeby elementów docelowych, dla których włączono właściwość AUTOMOC.",
	"assets/variables.json.AUTOMOC_SOURCE_GROUP": "Nazwa elementu source_group dla plików wygenerowanych przez funkcję AUTOMOC.",
	"assets/variables.json.AUTOMOC_TARGETS_FOLDER": "Nazwa elementu FOLDER dla elementów docelowych *_autogen dodawanych automatycznie przez narzędzie CMake na potrzeby elementów docelowych, dla których włączono właściwość AUTOMOC.",
	"assets/variables.json.AUTORCC_SOURCE_GROUP": "Nazwa elementu source_group dla plików wygenerowanych przez funkcję AUTORCC.",
	"assets/variables.json.AUTOUIC_SOURCE_GROUP": "Nazwa elementu source_group dla plików wygenerowanych przez funkcję AUTOUIC.",
	"assets/variables.json.CMAKE_CUDA_KNOWN_FEATURES": "Lista funkcji języka CUDA znanych tej wersji programu CMake.",
	"assets/variables.json.CMAKE_CXX_KNOWN_FEATURES": "Lista funkcji języka C++ znanych tej wersji programu CMake.",
	"assets/variables.json.CMAKE_C_KNOWN_FEATURES": "Lista funkcji języka C znanych tej wersji programu CMake.",
	"assets/variables.json.CMAKE_HIP_KNOWN_FEATURES": "Lista funkcji testu HIP znanych tej wersji narzędzia CMake.",
	"assets/variables.json.CMAKE_ROLE": "Informuje o tym, w jakim trybie działa aktualnie uruchomiony skrypt. Może przyjąć jedną z kilku wartości:",
	"assets/variables.json.DEBUG_CONFIGURATIONS": "Określ konfiguracje dla debugowania.",
	"assets/variables.json.DISABLED_FEATURES": "Lista funkcji, które są wyłączone podczas uruchomienia narzędzia CMake.",
	"assets/variables.json.ECLIPSE_EXTRA_CPROJECT_CONTENTS": "Dodatkowa zawartość, która ma być wstawiana do wygenerowanego pliku cproject środowiska Eclipse.",
	"assets/variables.json.ECLIPSE_EXTRA_NATURES": "Lista wcieleń projektu do dodania do wygenerowanego pliku projektu Eclipse.",
	"assets/variables.json.ENABLED_FEATURES": "Lista funkcji, które są włączone podczas uruchomienia narzędzia CMake.",
	"assets/variables.json.ENABLED_LANGUAGES": "Właściwość tylko do odczytu zawierająca listę aktualnie włączonych języków",
	"assets/variables.json.FIND_LIBRARY_USE_LIB32_PATHS": "Określa, czy polecenie find_library powinno automatycznie wyszukiwać katalogi lib32.",
	"assets/variables.json.FIND_LIBRARY_USE_LIB64_PATHS": "Określa, czy polecenie find_library powinno automatycznie wyszukiwać katalogi lib64.",
	"assets/variables.json.FIND_LIBRARY_USE_LIBX32_PATHS": "Określa, czy polecenie find_library powinno automatycznie wyszukiwać katalogi libx32.",
	"assets/variables.json.FIND_LIBRARY_USE_OPENBSD_VERSIONING": "Określa, czy polecenie find_library powinno znajdować biblioteki udostępnione w stylu OpenBSD.",
	"assets/variables.json.GENERATOR_IS_MULTI_CONFIG": "Właściwość tylko do odczytu, która ma wartość true w generatorach wielu konfiguracji.",
	"assets/variables.json.GLOBAL_DEPENDS_DEBUG_MODE": "Włącz tryb debugowania wykresu zależności globalnych elementu docelowego.",
	"assets/variables.json.GLOBAL_DEPENDS_NO_CYCLES": "Nie zezwalaj na cykle wykresu zależności globalnych elementów docelowych.",
	"assets/variables.json.INSTALL_PARALLEL": "Włącza opcję instalacji równoległej dla generatora Ninja.",
	"assets/variables.json.IN_TRY_COMPILE": "Właściwość tylko do odczytu, która ma wartość true podczas konfiguracji try-compile.",
	"assets/variables.json.JOB_POOLS": "Tylko Ninja: lista dostępnych pul.",
	"assets/variables.json.PACKAGES_FOUND": "Lista pakietów, które zostały znalezione podczas uruchomienia narzędzia CMake.",
	"assets/variables.json.PACKAGES_NOT_FOUND": "Lista pakietów, które nie zostały znalezione podczas uruchomienia narzędzia CMake.",
	"assets/variables.json.PREDEFINED_TARGETS_FOLDER": "Nazwa elementu FOLDER dla elementów docelowych, które są dodawane automatycznie przez narzędzie CMake.",
	"assets/variables.json.PROPAGATE_TOP_LEVEL_INCLUDES_TO_TRY_COMPILE": "Gdy ta właściwość globalna ma wartość true, zmienna CMAKE_PROJECT_TOP_LEVEL_INCLUDES jest propagowana do wywołań try_compile używających podpisu całego projektu. Ta właściwość nie ma wpływu na wywołania podpisu pliku źródłowego. Parametr PROPAGATE_TOP_LEVEL_INCLUDES_TO_TRY_COMPILE jest domyślnie nieustawiony.",
	"assets/variables.json.REPORT_UNDEFINED_PROPERTIES": "Jeśli ta opcja jest ustawiona, zgłaszaj wszelkie niezdefiniowane właściwości do tego pliku.",
	"assets/variables.json.RULE_MESSAGES": "Określ, czy dla każdej reguły programu make ma być zgłaszany komunikat.",
	"assets/variables.json.TARGET_ARCHIVES_MAY_BE_SHARED_LIBS": "Ustaw, jeśli biblioteki udostępnione mogą być nazywane jak archiwa.",
	"assets/variables.json.TARGET_MESSAGES": "Określ, czy zgłaszać ukończenie każdego elementu docelowego.",
	"assets/variables.json.TARGET_SUPPORTS_SHARED_LIBS": "Czy platforma docelowa obsługuje biblioteki udostępnione.",
	"assets/variables.json.USE_FOLDERS": "Określa, czy do organizowania obiektów docelowych w folderach ma być używana właściwość obiektu docelowego FOLDER. Wartość USE_FOLDERS na końcu pliku CMakeLists.txt najwyższego poziomu określa zachowanie.",
	"assets/variables.json.XCODE_EMIT_EFFECTIVE_PLATFORM_NAME": "Kontroluj emisję elementu EFFECTIVE_PLATFORM_NAME przez generator środowiska Xcode.",
	"assets/variables.json.CPACK_DESKTOP_SHORTCUTS": "Określa listę nazw skrótów, które powinny zostać utworzone na pulpicie nawigacyjnym dla tego pliku.",
	"assets/variables.json.CPACK_NEVER_OVERWRITE": "Zażądaj, żeby ten plik nie był przesłaniany przy instalacji lub ponownej instalacji.",
	"assets/variables.json.CPACK_PERMANENT": "Zażądaj, żeby ten plik nie był usuwany podczas odinstalowywania.",
	"assets/variables.json.CPACK_STARTUP_SHORTCUTS": "Określa listę nazw skrótów, które powinny zostać utworzone w folderze autostartu dla tego pliku.",
	"assets/variables.json.CPACK_START_MENU_SHORTCUTS": "Określa listę nazw skrótów, które powinny zostać utworzone w menu Start dla tego pliku.",
	"assets/variables.json.CPACK_WIX_ACL": "Określa uprawnienia dostępu dla plików lub katalogów zainstalowanych przez instalatora narzędzia WiX.",
	"assets/variables.json.ABSTRACT": "Czy ten plik źródłowy to klasa abstrakcyjna.",
	"assets/variables.json.AUTORCC_OPTIONS": "Dodatkowe opcje programu rcc w przypadku użycia właściwości AUTORCC",
	"assets/variables.json.AUTOUIC_OPTIONS": "Dodatkowe opcje programu uic w przypadku użycia właściwości AUTOUIC",
	"assets/variables.json.COMPILE_FLAGS": "Dodatkowe flagi, które mają zostać dodane podczas kompilowania tego pliku źródłowego.",
	"assets/variables.json.CXX_SCAN_FOR_MODULES": "CXX_SCAN_FOR_MODULES jest wartością logiczną określającą, czy narzędzie CMake będzie skanować źródło pod kątem zależności modułu języka C++. Zobacz również CXX_SCAN_FOR_MODULES ustawień dotyczących całego miejsca docelowego.",
	"assets/variables.json.EXTERNAL_OBJECT": "W przypadku ustawienia na wartość true jest to plik obiektu.",
	"assets/variables.json.Fortran_FORMAT": "Ustaw na wartość FIXED lub FREE, aby wskazać układ kodu źródłowego w języku Fortran.",
	"assets/variables.json.Fortran_PREPROCESS": "Określ, czy plik źródłowy języka Fortran powinien być bezwarunkowo wstępnie przetwarzany.",
	"assets/variables.json.GENERATED": "Określa, czy ten plik źródłowy jest generowany jako część kompilacji lub procesu narzędzia CMake.",
	"assets/variables.json.HEADER_FILE_ONLY": "Wskazuje, czy ten plik źródłowy jest tylko plikiem nagłówka.",
	"assets/variables.json.KEEP_EXTENSION": "Generuj plik wyjściowy z tym samym rozszerzeniem co plik źródłowy.",
	"assets/variables.json.LANGUAGE": "Określ język programowania, w którym napisano plik źródłowy.",
	"assets/variables.json.LOCATION": "Pełna ścieżka do pliku źródłowego.",
	"assets/variables.json.MACOSX_PACKAGE_LOCATION": "Umieść plik źródłowy wewnątrz pakietu Application Bundle (MACOSX_BUNDLE), pakietu Core Foundation Bundle (BUNDLE) lub pakiecie Framework Bundle (FRAMEWORK). Ma zastosowanie do systemów macOS i iOS.",
	"assets/variables.json.OBJECT_DEPENDS": "Dodatkowe pliki, od których zależy skompilowany plik obiektu.",
	"assets/variables.json.OBJECT_OUTPUTS": "Dodatkowe wyjścia dla reguły generatorów Ninja lub Makefile.",
	"assets/variables.json.SKIP_AUTOGEN": "Wyklucz plik źródłowy z przetwarzania przez funkcje AUTOMOC, AUTOUIC i AUTORCC (dla projektów Qt).",
	"assets/variables.json.SKIP_AUTOMOC": "Wyklucz plik źródłowy z przetwarzania przez funkcję AUTOMOC (dla projektów Qt).",
	"assets/variables.json.SKIP_AUTORCC": "Wyklucz plik źródłowy z przetwarzania przez funkcję AUTORCC (dla projektów Qt).",
	"assets/variables.json.SKIP_AUTOUIC": "Wyklucz plik źródłowy z przetwarzania przez funkcję AUTOUIC (dla projektów Qt).",
	"assets/variables.json.SKIP_LINTING": "Ta właściwość umożliwia wykluczenie określonego pliku źródłowego z procesu lintingu. Proces lintingu obejmuje uruchamianie narzędzi, takich jak <LANG>_CPPLINT, <LANG>_CLANG_TIDY, <LANG>_CPPCHECK i <LANG>_INCLUDE_WHAT_YOU_USE w plikach źródłowych, a także kompilowanie plików nagłówkowych w ramach VERIFY_INTERFACE_HEADER_SETS. Ustawienie SKIP_LINTING pliku źródłowego spowoduje, że wymienione narzędzia lintingu nie zostaną wykonane w przypadku określonego pliku.",
	"assets/variables.json.SKIP_PRECOMPILE_HEADERS": "Czy ten plik źródłowy jest pomijany przez funkcję PRECOMPILE_HEADERS.",
	"assets/variables.json.SKIP_UNITY_BUILD_INCLUSION": "Ustawienie tej właściwości na wartość true zapewnia, że plik źródłowy zostanie pominięty przez kompilacje aparatu Unity, gdy jego skojarzony element docelowy ma właściwość UNITY_BUILD ustawioną na wartość true. Plik źródłowy zostanie zamiast tego skompilowany w taki sam sposób, jak w przypadku wyłączonych kompilacji aparatu Unity.",
	"assets/variables.json.Swift_DEPENDENCIES_FILE": "Ta właściwość określa ścieżkę pliku zależności Swift (swiftdeps) dla źródła. Jeśli nie zostanie określona, wartością domyślną będzie <OBJECT>.swiftdeps.",
	"assets/variables.json.Swift_DIAGNOSTICS_FILE": "Ta właściwość określa, gdzie jest serializowana diagnostyka języka Swift.",
	"assets/variables.json.SYMBOLIC": "Czy to jest po prostu nazwy reguły.",
	"assets/variables.json.UNITY_GROUP": "Ta właściwość określa zasobnik, którego częścią jest źródło, gdy właściwość UNITY_BUILD_MODE ma wartość GROUP.",
	"assets/variables.json.VS_COPY_TO_OUT_DIR": "Ustawia tag <CopyToOutputDirectory> dla pliku źródłowego w pliku projektu programu Visual Studio. Prawidłowe wartości to Never (Nigdy), Always (Zawsze) i PreserveNewest (Zachowaj najnowsze).",
	"assets/variables.json.VS_CSHARP_tagname": "Konfiguracja specyficzna dla pliku źródłowego programu Visual Studio i języka CSharp.",
	"assets/variables.json.VS_DEPLOYMENT_CONTENT": "Oznacz plik źródłowy jako zawartość do wdrożenia z aplikacją dla systemu Windows Phone lub aplikacją ze Sklepu Windows podczas kompilacji za pomocą generatora programu Visual Studio. Wartość musi zwracać 1 lub 0 i może używać wyrażeń generatora <cmake-generator-expressions(7)> do dokonywania wyboru na podstawie konfiguracji kompilacji. Wpis w pliku vcxproj dla pliku źródłowego zostanie oznaczony jako DeploymentContent lub ExcludedFromBuild dla wartości odpowiednio 1 i 0.",
	"assets/variables.json.VS_DEPLOYMENT_LOCATION": "Określa lokalizację wdrożenia dla pliku źródłowego zawartości z aplikacją dla systemu Windows Phone lub aplikacją ze Sklepu Windows w przypadku kompilacji za pomocą generatorów programu Visual Studio <cmake-generators(7)>. Ta właściwość ma zastosowanie tylko w przypadku, gdy używana jest właściwość VS_DEPLOYMENT_CONTENT. Wartość reprezentuje ścieżkę względną wobec pakietu aplikacji i ma zastosowanie do wszystkich konfiguracji.",
	"assets/variables.json.VS_INCLUDE_IN_VSIX": "Właściwość logiczna służąca do określenia, czy plik powinien zostać dołączony do pakietu rozszerzenia VSIX (Visual Studio Integration Extension). Jest to potrzebne do tworzenia rozszerzeń programu Visual Studio.",
	"assets/variables.json.VS_RESOURCE_GENERATOR": "Ta właściwość pozwala określić generator zasobów do użycia względem tego pliku. Jeśli nie zostanie ustawiona, jej wartość domyślna to PublicResXFileCodeGenerator.",
	"assets/variables.json.VS_SETTINGS": "Ustaw dowolny element metadanych w pliku",
	"assets/variables.json.VS_SHADER_DISABLE_OPTIMIZATIONS": "Wyłącz optymalizacje kompilatora dla pliku źródłowego HLSL. Spowoduje to dodanie flagi -Od do wiersza polecenia dla narzędzia FxCompiler. Określ wartość true dla tej właściwości, aby wyłączyć optymalizowanie kompilatora.",
	"assets/variables.json.VS_SHADER_ENABLE_DEBUG": "Włącz informacje o debugowaniu dla pliku źródłowego HLSL. Spowoduje to dodanie flagi -Zi do wiersza polecenia dla narzędzia FxCompiler. Określ wartość true, aby wygenerować informacje o debugowaniu dla skompilowanego programu do cieniowania.",
	"assets/variables.json.VS_SHADER_ENTRYPOINT": "Określa nazwę punktu wejścia dla programu do cieniowania pliku źródłowego HLSL.",
	"assets/variables.json.VS_SHADER_FLAGS": "Ustaw dodatkowe flagi cieniowania programu Visual Studio pliku źródłowego HLSL.",
	"assets/variables.json.VS_SHADER_MODEL": "Określa model cieniowania pliku źródłowego HLSL. Niektóre typy cieniowania mogą być używane tylko z najnowszymi modelami cieniowania",
	"assets/variables.json.VS_SHADER_OBJECT_FILE_NAME": "Określa nazwę pliku dla skompilowanego pliku obiektu programu do cieniowania dla pliku źródłowego HLSL. Spowoduje to dodanie flagi -Fo do wiersza polecenia dla narzędzia FxCompiler.",
	"assets/variables.json.VS_SHADER_OUTPUT_HEADER_FILE": "Ustaw nazwę wyjściowego pliku nagłówkowego zawierającego kod obiektu pliku źródłowego HLSL.",
	"assets/variables.json.VS_SHADER_TYPE": "Ustaw typ cieniowania programu Visual Studio pliku źródłowego HLSL.",
	"assets/variables.json.VS_SHADER_VARIABLE_NAME": "Ustaw nazwę zmiennej w pliku nagłówkowym zawierającym kod obiektu pliku źródłowego HLSL.",
	"assets/variables.json.VS_TOOL_OVERRIDE": "Zastąp domyślne narzędzie programu Visual Studio, które zostanie zastosowane względem pliku źródłowego, nowym narzędziem, które nie jest oparte na rozszerzeniu pliku.",
	"assets/variables.json.VS_XAML_TYPE": "Oznacz plik źródłowy Extensible Application Markup Language (XAML) jako inny typ niż strona domyślna. Najczęstszym sposobem użycia będzie ustawienie domyślnego pliku App.xaml jako elementu ApplicationDefinition.",
	"assets/variables.json.WRAP_EXCLUDE": "Wyklucz ten plik źródłowy z jakichkolwiek technik opakowywania kodu.",
	"assets/variables.json.XCODE_EXPLICIT_FILE_TYPE": "Ustaw atrybut explicitFileType środowiska Xcode w ramach jego odwołania na plik źródłowy. Narzędzie CMake oblicza wartość domyślną opartą na rozszerzeniu pliku, ale może ona zostać ustawiona jawnie za pomocą tej właściwości.",
	"assets/variables.json.XCODE_FILE_ATTRIBUTES": "Dodaj wartości do ustawienia ATTRIBUTES środowiska Xcode w ramach jego odwołania do pliku źródłowego. Między innymi może to zostać użyte do ustawienia roli dla pliku MIG:",
	"assets/variables.json.XCODE_LAST_KNOWN_FILE_TYPE": "Ustaw atrybut lastKnownFileType środowiska Xcode w ramach jego odwołania na plik źródłowy. Narzędzie CMake oblicza wartość domyślną opartą na rozszerzeniu pliku, ale może ona zostać ustawiona jawnie za pomocą tej właściwości.",
	"assets/variables.json.ATTACHED_FILES": "Dołącz listę plików podczas przesyłania do pulpitu nawigacyjnego.",
	"assets/variables.json.ATTACHED_FILES_ON_FAIL": "Dołącz listę plików podczas przesyłania do pulpitu nawigacyjnego, jeśli test nie powiedzie się.",
	"assets/variables.json.COST": "Ta właściwość opisuje koszt testu. Gdy testowanie równoległe jest włączone, testy w zestawie testów będą uruchamiane w kolejności malejącej kosztów. Projekty mogą jawnie definiować koszt testu, ustawiając tę właściwość na wartość zmiennoprzecinkową.",
	"assets/variables.json.DEPENDS": "Określa, że ten test powinien być uruchamiany wyłącznie po określonej liście testów.",
	"assets/variables.json.DISABLED": "W przypadku ustawienia na wartość true test zostanie pominięty i będzie miał stan „Not Run”. Test z właściwością DISABLED nie będzie wliczany do łącznej liczby testów, a jego stan ukończenia będzie raportowany do CDash jako „Disabled” (Wyłączony).",
	"assets/variables.json.ENVIRONMENT": "Określ zmienne środowiskowe, które powinny być zdefiniowane na potrzeby uruchamiania testu.",
	"assets/variables.json.ENVIRONMENT_MODIFICATION": "Określ zmienne środowiskowe, które powinny zostać zmodyfikowane na potrzeby uruchamiania testu. Należy pamiętać, że operacje wykonywane przez tę właściwość są wykonywane po zastosowaniu właściwości ENVIRONMENT.",
	"assets/variables.json.FAIL_REGULAR_EXPRESSION": "Jeśli dane wyjściowe testu (stdout lub stderr) są zgodne z tym wyrażeniem regularnym, test zakończy się niepowodzeniem, niezależnie od kodu zakończenia procesu. Testy przekraczające limit czasu określony przez limit czasu nie powiodły się niezależnie od FAIL_REGULAR_EXPRESSION. Wszystkie niezerowe błędy kodu powrotnego lub testu na poziomie systemu, w tym błędy segmentacji, przerwanie sygnału lub błędy sterty, przerywają test, nawet jeśli wyrażenie regularne nie jest zgodne.",
	"assets/variables.json.FIXTURES_CLEANUP": "Określa listę warunków początkowych, dla których test ma być traktowany jako test czyszczenia. Nazwy tych warunków początkowych różnią się od nazw przypadków testowych i nie muszą być w żaden sposób podobne do nazw skojarzonych z nimi testów.",
	"assets/variables.json.FIXTURES_REQUIRED": "Określa listę warunków początkowych, których wymaga test. W nazwach warunków początkowych jest uwzględniana wielkość liter i nie muszą być w żaden sposób podobne do nazw skojarzonych z nimi testów.",
	"assets/variables.json.FIXTURES_SETUP": "Określa listę warunków początkowych, dla których test ma być traktowany jako test konfiguracji. Nazwy tych warunków początkowych różnią się od nazw przypadków testowych i nie muszą być w żaden sposób podobne do nazw skojarzonych z nimi testów.",
	"assets/variables.json.GENERATED_RESOURCE_SPEC_FILE": "Ścieżka do dynamicznie generowanego pliku specyfikacji zasobu <ctest-resource-dynamically-generated-spec-file> wygenerowana przez ten test.",
	"assets/variables.json.MEASUREMENT": "Określ miarę i wartość CDASH do raportowania dla testu.",
	"assets/variables.json.PASS_REGULAR_EXPRESSION": "Dane wyjściowe testu (stdout lub stderr) muszą być zgodne z tym wyrażeniem regularnym, aby test zakończył się powodzeniem. Kod zakończenia procesu jest ignorowany. Testy przekraczające limit czasu określony przez limit czasu nadal nie powiodły się niezależnie od FAIL_REGULAR_EXPRESSION. Błędy testów na poziomie systemu, w tym błędy segmentacji, przerwanie sygnału lub błędy sterty, mogą zakończyć się niepowodzeniem testu, nawet jeśli wyrażenie PASS_REGULAR_EXPRESSION zostanie dopasowane.",
	"assets/variables.json.PROCESSORS": "Ustaw, aby określić liczbę miejsc procesu, których ten test wymaga. Jeśli nie zostanie ustawiona, wartością domyślną jest 1 procesor.",
	"assets/variables.json.PROCESSOR_AFFINITY": "Ustaw wartość true, aby żądać od narzędzia CTest uruchomienia procesu testu za pomocą koligacji procesora CPU dla stałego zestawu procesorów. Jeśli jest to włączone i obsługiwane dla bieżącej platformy, narzędzie CTest wybierze zestaw procesorów do umieszczenia w masce koligacji procesora CPU podczas uruchamiania procesu testu. Liczba procesorów w zestawie jest określana przez właściwość testu PROCESSORS lub liczbę procesorów dostępnych dla narzędzia CTest, w zależności od tego, która z tych wartości jest mniejsza. Wybrany zestaw procesorów zostanie odłączony od procesorów przypisanych do innych współbieżnie uruchomionych testów, które również mają włączoną właściwość PROCESSOR_AFFINITY.",
	"assets/variables.json.REQUIRED_FILES": "Lista plików wymaganych do uruchomienia testu. Nazwy plików są względne do właściwości WORKING_DIRECTORY, chyba że zostanie podana ścieżka bezwzględna.",
	"assets/variables.json.RESOURCE_GROUPS": "Określ zasoby wymagane przez test, pogrupowane w sposób istotny dla testu. Zobacz alokację zasobów <ctest-resource-allocation>, aby uzyskać więcej informacji o tym, jak ta właściwość integruje się z funkcją alokacji zasobów narzędzia CTest.",
	"assets/variables.json.RESOURCE_LOCK": "Określ listę zasobów, które są zablokowane przez ten test.",
	"assets/variables.json.RUN_SERIAL": "Nie uruchamiaj tego testu równolegle z żadnym innym testem.",
	"assets/variables.json.SKIP_REGULAR_EXPRESSION": "Jeśli dane wyjściowe testu (stderr lub stdout) są zgodne z tym wyrażeniem regularnym, test zostanie oznaczony jako pominięty, niezależnie od kodu zakończenia procesu. Testy przekraczające limit czasu określony przez limit czasu nadal nie powiodły się niezależnie od SKIP_REGULAR_EXPRESSION. Błędy testów na poziomie systemu, w tym błędy segmentacji, przerwania sygnału lub sterty, mogą zakończyć się niepowodzeniem testu, nawet jeśli wyrażenie regularne jest zgodne.",
	"assets/variables.json.SKIP_RETURN_CODE": "Zwróć kod, aby oznaczyć test jako pominięty.",
	"assets/variables.json.TIMEOUT": "Liczba sekund dozwolonych dla tego testu.",
	"assets/variables.json.TIMEOUT_AFTER_MATCH": "Zmień długość limitu czasu testu po napotkaniu zgodnego wiersza w jego danych wyjściowych.",
	"assets/variables.json.TIMEOUT_SIGNAL_GRACE_PERIOD": "Jeśli właściwość testowa TIMEOUT_SIGNAL_NAME jest ustawiona, ta właściwość określa liczbę sekund oczekiwania na zakończenie procesu testowego po wysłaniu sygnału niestandardowego. W przeciwnym razie ta właściwość nie ma znaczenia.",
	"assets/variables.json.TIMEOUT_SIGNAL_NAME": "Określ niestandardowy sygnał do wysłania do procesu testowego po osiągnięciu limitu czasu. Ta funkcja jest dostępna tylko na platformach obsługujących sygnały POSIX. Nie jest dostępna w systemie Windows.",
	"assets/variables.json.WILL_FAIL": "Jeśli ma wartość true, odwraca kryteria testu powodzenia/niepowodzenia. Testy, dla których wartość WILL_FAIL jest prawdziwa, kończą się niepowodzeniem z kodem zwrotnym 0 i są przekazywane z kodem zwrotnym innym niż zero. Testy, które przekraczają limit czasu określony przez limit czasu, nadal kończą się niepowodzeniem niezależnie od WILL_FAIL. Błędy testów na poziomie systemu, w tym błędy segmentacji, przerwania sygnału lub sterty, mogą zakończyć się niepowodzeniem testu, nawet jeśli wartość WILL_FAIL jest prawdziwa.",
	"assets/variables.json.WORKING_DIRECTORY": "Katalog, z którego zostanie wywołany testowy plik wykonywalny.",
	"assets/variables.json.AIX_EXPORT_ALL_SYMBOLS": "W systemie AIX narzędzie CMake automatycznie eksportuje wszystkie symbole z bibliotek udostępnionych oraz plików wykonywalnych z ustawioną właściwością docelową ENABLE_EXPORTS. Jawnie wyłącz tę właściwość logiczną, aby ograniczyć to zachowanie i domyślnie wykonywać eksport bez symboli. W tym przypadku oczekuje się, że w projekcie zostaną użyte inne metody eksportowania niektórych symboli.",
	"assets/variables.json.ALIASED_TARGET": "Nazwa elementu docelowego, dla którego ten element docelowy jest aliasem.",
	"assets/variables.json.ALIAS_GLOBAL": "Właściwość tylko do odczytu wskazująca, czy element docelowy aliasu jest widoczny globalnie.",
	"assets/variables.json.ANDROID_ANT_ADDITIONAL_OPTIONS": "Ustaw dodatkowe opcje dla systemu kompilacji Android Ant. Jest to ciąg zawierający wszystkie opcje wiersza polecenia dla kompilacji programu Ant. Ta właściwość jest inicjowana za pomocą wartości zmiennej CMAKE_ANDROID_ANT_ADDITIONAL_OPTIONS, jeśli jest ona ustawiona podczas tworzenia elementu docelowego.",
	"assets/variables.json.ANDROID_API": "Podczas kompilacji skrośnej dla systemu Android za pomocą programu NVIDIA Nsight Tegra Visual Studio Edition ta właściwość ustawia wersję docelową interfejsu API systemu Android (np. 15). Numer wersji musi być dodatnią liczbą całkowitą. Ta właściwość jest inicjowana za pomocą wartości zmiennej CMAKE_ANDROID_API, jeśli jest ona ustawiona podczas tworzenia elementu docelowego.",
	"assets/variables.json.ANDROID_API_MIN": "Ustaw minimalną wersję interfejsu API systemu Android (np. 9). Numer wersji musi być dodatnią liczbą całkowitą. Ta właściwość jest inicjowana za pomocą wartości zmiennej CMAKE_ANDROID_API_MIN, jeśli jest ona ustawiona podczas tworzenia elementu docelowego. Kompilacje kodu natywnego używają tej wersji interfejsu API.",
	"assets/variables.json.ANDROID_ARCH": "Podczas kompilacji skrośnej dla systemu Android za pomocą programu NVIDIA Nsight Tegra Visual Studio Edition ta właściwość ustawia architekturę docelową systemu Android.",
	"assets/variables.json.ANDROID_ASSETS_DIRECTORIES": "Ustaw katalogi elementów zawartości systemu Android do skopiowania do głównego folderu elementów zawartości przed kompilacją. Ta właściwość ciągu zawiera ścieżki katalogu rozdzielone średnikami. Ta właściwość jest inicjowana za pomocą wartości zmiennej CMAKE_ANDROID_ASSETS_DIRECTORIES, jeśli jest ona ustawiona podczas tworzenia elementu docelowego.",
	"assets/variables.json.ANDROID_GUI": "Podczas kompilacji skrośnej dla systemu Android za pomocą programu NVIDIA Nsight Tegra Visual Studio Edition ta właściwość określa, czy plik wykonywalny ma zostać skompilowany jako pakiet aplikacji w systemie Android.",
	"assets/variables.json.ANDROID_JAR_DEPENDENCIES": "Ustaw właściwość systemu Android, która określa zależności plików JAR. Jest to właściwość ciągu. Ta właściwość jest inicjowana za pomocą wartości zmiennej CMAKE_ANDROID_JAR_DEPENDENCIES, jeśli jest ona ustawiona podczas tworzenia elementu docelowego.",
	"assets/variables.json.ANDROID_JAR_DIRECTORIES": "Ustaw właściwość systemu Android, która określa katalogi dla wyszukiwania bibliotek JAR.",
	"assets/variables.json.ANDROID_JAVA_SOURCE_DIR": "Ustaw właściwość systemu Android definiującą główne katalogi kodu źródłowego Java. Jest to właściwość ciągu zawierająca ścieżki katalogu rozdzielone średnikami. Ta właściwość jest inicjowana za pomocą wartości zmiennej CMAKE_ANDROID_JAVA_SOURCE_DIR, jeśli jest ona ustawiona podczas tworzenia elementu docelowego.",
	"assets/variables.json.ANDROID_NATIVE_LIB_DEPENDENCIES": "Ustaw właściwość systemu Android, która określa zależności plików so. Jest to właściwość ciągu.",
	"assets/variables.json.ANDROID_NATIVE_LIB_DIRECTORIES": "Ustaw właściwość systemu Android, która określa katalogi dla wyszukiwania bibliotek so.",
	"assets/variables.json.ANDROID_PROCESS_MAX": "Ustaw właściwość systemu Android, która definiuje maksymalną liczbę równoległych procesów kompilatora zestawu Android NDK (np. 4). Ta właściwość jest inicjowana za pomocą wartości zmiennej CMAKE_ANDROID_PROCESS_MAX, jeśli jest ona ustawiona podczas tworzenia elementu docelowego.",
	"assets/variables.json.ANDROID_PROGUARD": "Jeśli ta właściwość jest ustawiona na wartość true, narzędzie ProGuard może zmniejszyć, zoptymalizować i zaciemnić kod przez usunięcie nieużywanego kodu i zmianę nazw klas, pól i metod na nazwy trudne do zrozumienia. Ta właściwość jest inicjowana za pomocą wartości zmiennej CMAKE_ANDROID_PROGUARD, jeśli jest ona ustawiona podczas tworzenia elementu docelowego.",
	"assets/variables.json.ANDROID_PROGUARD_CONFIG_PATH": "Ustaw właściwość systemu Android, która określa lokalizację pliku konfiguracji narzędzia ProGuard. Pozostaw właściwość pustą, aby użyć lokalizacji domyślnej. Ta właściwość ciągu zawiera ścieżkę pliku konfiguracji narzędzia ProGuard. Ta właściwość jest inicjowana przez wartość zmiennej CMAKE_ANDROID_PROGUARD_CONFIG_PATH, jeśli jest ona ustawiona podczas tworzenia elementu docelowego.",
	"assets/variables.json.ANDROID_SECURE_PROPS_PATH": "Ustaw właściwość systemu Android, która określa lokalizację zabezpieczonego pliku właściwości. Jest to właściwość ciągu zawierająca ścieżkę pliku. Ta właściwość jest inicjowana za pomocą wartości zmiennej CMAKE_ANDROID_SECURE_PROPS_PATH, jeśli jest ona ustawiona podczas tworzenia elementu docelowego.",
	"assets/variables.json.ANDROID_SKIP_ANT_STEP": "Ustaw właściwość systemu Android, która określa, czy pominąć krok kompilacji programu Ant. Jest to właściwość logiczna inicjowana za pomocą wartości zmiennej CMAKE_ANDROID_SKIP_ANT_STEP, jeśli jest ona ustawiona podczas tworzenia elementu docelowego.",
	"assets/variables.json.ANDROID_STL_TYPE": "Podczas kompilacji skrośnej dla systemu Android za pomocą programu NVIDIA Nsight Tegra Visual Studio Edition ta właściwość określa typ obsługi biblioteki STL dla projektu. Jest to właściwość ciągu, którą można ustawić na jedną z następujących wartości:",
	"assets/variables.json.ARCHIVE_OUTPUT_DIRECTORY": "Katalog wyjściowy dla skompilowanych plików docelowych XXX.",
	"assets/variables.json.ARCHIVE_OUTPUT_DIRECTORY_CONFIG": "Katalog wyjściowy poszczególnych konfiguracji dla plików docelowych określonych przez właściwość ARCHIVE.",
	"assets/variables.json.ARCHIVE_OUTPUT_NAME": "Nazwa wyjściowa dla plików docelowych XXX.",
	"assets/variables.json.ARCHIVE_OUTPUT_NAME_CONFIG": "Nazwa wyjściowa poszczególnych konfiguracji dla plików docelowych określonych przez właściwość ARCHIVE.",
	"assets/variables.json.AUTOGEN_BETTER_GRAPH_MULTI_CONFIG": "AUTOGEN_BETTER_GRAPH_MULTI_CONFIG jest właściwością logiczną, którą można ustawić w elemencie docelowym, aby uzyskać lepszy wykres zależności dla generatorów z wieloma konfiguracjami. Po włączeniu tej właściwości narzędzie CMake wygeneruje więcej elementów docelowych dla konfiguracji. W związku z tym graf zależności będzie dokładniejszy dla generatorów z wieloma konfiguracjami i zostanie pominięta pewna ponowna kompilacja.",
	"assets/variables.json.AUTOGEN_BUILD_DIR": "Katalog, w którym funkcje AUTOMOC, AUTOUIC i AUTORCC generują pliki dla elementu docelowego.",
	"assets/variables.json.AUTOGEN_COMMAND_LINE_LENGTH_MAX": "Limit długości wiersza polecenia dla elementów docelowych autogen, tj. moc lub uic, który wyzwala użycie plików odpowiedzi w systemie Windows zamiast przekazywania wszystkich argumentów do wiersza polecenia.",
	"assets/variables.json.AUTOGEN_ORIGIN_DEPENDS": "Przełącznik do przekierowania zależności docelowych źródeł do odpowiedniego elementu docelowego <ORIGIN>_autogen.",
	"assets/variables.json.AUTOGEN_PARALLEL": "Liczba równoległych procesów moc lub uic do uruchomienia przez funkcje AUTOMOC i AUTOUIC.",
	"assets/variables.json.AUTOGEN_TARGET_DEPENDS": "Dodatkowe zależności docelowe odpowiadającego elementu docelowego <ORIGIN>_autogen.",
	"assets/variables.json.AUTOGEN_USE_SYSTEM_INCLUDE": "AUTOGEN_USE_SYSTEM_INCLUDE jest właściwością logiczną, którą można ustawić w elemencie docelowym, aby wskazać, że katalog dołączony elementu docelowego autogen powinien zostać dodany jako systemowy katalog dołączany lub normalny katalog dołączany do elementu docelowego.",
	"assets/variables.json.AUTOMOC": "Czy element docelowy ma być przetwarzany przez funkcję auto-moc (dla projektów Qt).",
	"assets/variables.json.AUTOMOC_COMPILER_PREDEFINES": "Wartość logiczna używana przez funkcję AUTOMOC do określenia, czy plik definicji wstępnych moc_predefs.h ma zostać wygenerowany.",
	"assets/variables.json.AUTOMOC_DEPEND_FILTERS": "Filtruj definicje używane przez funkcję AUTOMOC do wyodrębniania z pliku źródłowego nazw plików, które są zarejestrowane jako dodatkowe zależności dla pliku moc lub pliku źródłowego.",
	"assets/variables.json.AUTOMOC_EXECUTABLE": "AUTOMOC_EXECUTABLE jest ścieżką pliku wskazującą plik wykonywalny moc do użycia na potrzeby plików z włączoną wartością logiczną AUTOMOC. Ustawienie tej właściwości spowoduje, że narzędzie CMake będzie pomijać automatyczne wykrywanie pliku binarnego moc oraz testy poprawności normalnie uruchamiane w celu zapewnienia, że plik binarny jest dostępny i działa zgodnie z oczekiwaniami.",
	"assets/variables.json.AUTOMOC_MACRO_NAMES": "Lista rozdzielonych średnikami nazw makr używanych przez funkcję AUTOMOC do określenia, czy plik kodu C++ wymaga przetworzenia przez program moc.",
	"assets/variables.json.AUTOMOC_MOC_OPTIONS": "Dodatkowe opcje programu moc w przypadku użycia właściwości AUTOMOC",
	"assets/variables.json.AUTOMOC_PATH_PREFIX": "Gdy ta właściwość jest włączona, narzędzie CMake wygeneruje opcję prefiksu ścieżki -p dla programu moc w elementach docelowych platformy Qt z włączoną wartością logiczną AUTOMOC.",
	"assets/variables.json.AUTORCC": "Czy element docelowy ma być przetwarzany przez program auto-rcc (dotyczy projektów platformy Qt).",
	"assets/variables.json.AUTORCC_EXECUTABLE": "AUTORCC_EXECUTABLE jest ścieżką pliku wskazującą plik wykonywalny rcc do użycia na potrzeby plików z włączoną wartością logiczną AUTORCC. Ustawienie tej właściwości spowoduje, że narzędzie CMake będzie pomijać automatyczne wykrywanie pliku binarnego rcc oraz testy poprawności normalnie uruchamiane w celu zapewnienia, że plik binarny jest dostępny i działa zgodnie z oczekiwaniami.",
	"assets/variables.json.AUTOUIC": "Czy element docelowy ma być przetwarzany przez program auto-uic (dotyczy projektów platformy Qt).",
	"assets/variables.json.AUTOUIC_EXECUTABLE": "AUTOUIC_EXECUTABLE jest ścieżką pliku wskazującą plik wykonywalny uic do użycia na potrzeby plików z włączoną wartością logiczną AUTOUIC. Ustawienie tej właściwości spowoduje, że narzędzie CMake będzie pomijać automatyczne wykrywanie pliku binarnego uic oraz testy poprawności normalnie uruchamiane w celu zapewnienia, że plik binarny jest dostępny i działa zgodnie z oczekiwaniami.",
	"assets/variables.json.AUTOUIC_SEARCH_PATHS": "Lista ścieżek wyszukiwania używana przez funkcję AUTOUIC do wyszukiwania dołączonych plików ui.",
	"assets/variables.json.BUILD_RPATH": "Rozdzielana średnikami lista określająca wpisy ścieżki środowiska uruchomieniowego (RPATH) do dodania do plików binarnych połączonych w drzewie kompilacji (dla platform, które go obsługują). Domyślnie narzędzie CMake ustawia ścieżkę plików binarnych środowiska uruchomieniowego w drzewie kompilacji tak, aby zawierała ścieżki wyszukiwania, o których wiadomo, że są potrzebne do znalezienia bibliotek udostępnionych, które łączą. Projekty mogą ustawiać BUILD_RPATH, aby określić dodatkowe ścieżki wyszukiwania.",
	"assets/variables.json.BUILD_RPATH_USE_ORIGIN": "Określa, czy używać ścieżek względnych dla ścieżki RPATH kompilacji.",
	"assets/variables.json.BUILD_WITH_INSTALL_NAME_DIR": "Właściwość BUILD_WITH_INSTALL_NAME_DIR jest wartością logiczną określającą, czy element install_name dla elementu docelowego w drzewie kompilacji w systemie macOS używa katalogu określonego przez właściwość INSTALL_NAME_DIR. To ustawienie dotyczy tylko elementów docelowych w systemie macOS.",
	"assets/variables.json.BUILD_WITH_INSTALL_RPATH": "Właściwość BUILD_WITH_INSTALL_RPATH to wartość logiczna określająca, czy element docelowy w drzewie kompilacji ma zostać połączony za pomocą właściwości INSTALL_RPATH. Ma ona pierwszeństwo przed właściwością SKIP_BUILD_RPATH i umożliwia uniknięcie ponownego łączenia przed instalacją.",
	"assets/variables.json.BUNDLE": "Ten element docelowy to pakiet CFBundle w systemie macOS.",
	"assets/variables.json.BUNDLE_EXTENSION": "Rozszerzenie pliku używane dla nazwy elementu docelowego BUNDLE, FRAMEWORK lub MACOSX_BUNDLE w systemach macOS i iOS.",
	"assets/variables.json.COMMON_LANGUAGE_RUNTIME": "Dzięki ustawieniu tej właściwości elementu docelowego element docelowy jest konfigurowany do kompilacji z obsługą języka C++/interfejsu wiersza polecenia.",
	"assets/variables.json.COMPATIBLE_INTERFACE_BOOL": "Właściwości, które muszą być zgodne z ich interfejsem łączenia",
	"assets/variables.json.COMPATIBLE_INTERFACE_NUMBER_MAX": "Właściwości, których maksymalne wartości z interfejsu łącza zostaną użyte.",
	"assets/variables.json.COMPATIBLE_INTERFACE_NUMBER_MIN": "Właściwości, których minimalne wartości z interfejsu linku zostaną użyte.",
	"assets/variables.json.COMPATIBLE_INTERFACE_STRING": "Właściwości, które muszą być zgodne na poziomie ciągów z ich interfejsem łączenia",
	"assets/variables.json.COMPILE_FEATURES": "Funkcje kompilatora włączone dla tego elementu docelowego.",
	"assets/variables.json.COMPILE_PDB_NAME": "Nazwa wyjściowa dla pliku pdb symboli debugowania firmy Microsoft wygenerowanego przez kompilator podczas kompilowania plików źródłowych.",
	"assets/variables.json.COMPILE_PDB_NAME_CONFIG": "Nazwa wyjściowa dla konfiguracji dla pliku pdb symboli debugowania firmy Microsoft wygenerowanego przez kompilator podczas kompilowania plików źródłowych.",
	"assets/variables.json.COMPILE_PDB_OUTPUT_DIRECTORY": "Katalog wyjściowy dla pliku pdb symboli debugowania firmy Microsoft wygenerowanego przez kompilator podczas kompilowania plików źródłowych.",
	"assets/variables.json.COMPILE_PDB_OUTPUT_DIRECTORY_CONFIG": "Katalog wyjściowy dla konfiguracji dla pliku pdb symboli debugowania firmy Microsoft wygenerowanego przez kompilator podczas kompilowania plików źródłowych.",
	"assets/variables.json.COMPILE_WARNING_AS_ERROR": "Określ, czy ostrzeżenia podczas kompilacji mają być traktowane jako błędy. Jeśli ta opcja jest włączona, dodaje flagę, aby traktować ostrzeżenia podczas kompilacji jako błędy. Jeśli opcja cmake --compile-no-warning-as-error jest podana w wierszu polecenia cmake, ta właściwość jest ignorowana.",
	"assets/variables.json.CONFIG_OUTPUT_NAME": "Stara nazwa podstawowa pliku docelowego dla konfiguracji. Zamiast tego użyj właściwości OUTPUT_NAME_.",
	"assets/variables.json.CONFIG_POSTFIX": "Przyrostek do dołączenia do nazwy pliku docelowego dla konfiguracji <CONFIG>.",
	"assets/variables.json.CROSSCOMPILING_EMULATOR": "Użyj podanego emulatora do uruchamiania plików wykonywalnych utworzonych podczas kompilacji skrośnej. To polecenie zostanie dodane jako prefiks do poleceń add_test, add_custom_command i add_custom_target dla plików wykonywalnych systemu docelowego kompilacji.",
	"assets/variables.json.CUDA_ARCHITECTURES": "Lista architektur, dla których ma zostać wygenerowany kod urządzenia.",
	"assets/variables.json.CUDA_CUBIN_COMPILATION": "Kompiluj źródła języka CUDA do plików .cubin zamiast do plików .obj w bibliotekach obiektów.",
	"assets/variables.json.CUDA_EXTENSIONS": "Wartość logiczna określająca, czy są wymagane rozszerzenia specyficzne dla kompilatora.",
	"assets/variables.json.CUDA_FATBIN_COMPILATION": "Kompiluj źródła języka CUDA do plików .fatbin zamiast do plików .obj w ramach bibliotek obiektów.",
	"assets/variables.json.CUDA_OPTIX_COMPILATION": "Kompiluj źródła języka CUDA do plików .optixir zamiast do plików .obj w bibliotekach obiektów.",
	"assets/variables.json.CUDA_PTX_COMPILATION": "Kompiluj źródła architektury CUDA do plików ptx zamiast do plików obj w bibliotekach obiektów.",
	"assets/variables.json.CUDA_RESOLVE_DEVICE_SYMBOLS": "Tylko architektura CUDA: włącza łączenie urządzeń dla określonego elementu docelowego biblioteki, gdy jest to wymagane",
	"assets/variables.json.CUDA_RUNTIME_LIBRARY": "Wybierz bibliotekę środowiska uruchomieniowego CUDA, która ma być używana przez kompilatory przeznaczone dla języka CUDA.",
	"assets/variables.json.CUDA_SEPARABLE_COMPILATION": "Tylko architektura CUDA: włącza oddzielną kompilację kodu urządzenia",
	"assets/variables.json.CUDA_STANDARD": "Standard CUDA/C++, którego funkcje są wymagane do skompilowania tego elementu docelowego.",
	"assets/variables.json.CUDA_STANDARD_REQUIRED": "Wartość logiczna opisująca, czy właściwość CUDA_STANDARD jest wymagana.",
	"assets/variables.json.CXX_EXTENSIONS": "Wartość logiczna określająca, czy są wymagane rozszerzenia specyficzne dla kompilatora.",
	"assets/variables.json.CXX_MODULE_DIRS": "Rozdzielana średnikami lista katalogów podstawowych domyślnego zestawu modułów C++ obiektu docelowego (tj. zestawu plików z nazwą i typem CXX_MODULES). Właściwość obsługuje wyrażenia generatora <cmake-generator-expressions(7)>.",
	"assets/variables.json.CXX_MODULE_DIRS_NAME": "Rozdzielana średnikami lista katalogów podstawowych zestawu nagłówków modułu <NAME> C++ elementu docelowego, który ma ustawiony typ CXX_MODULES. Właściwość obsługuje wyrażenia generatora <cmake-generator-expressions(7)>.",
	"assets/variables.json.CXX_MODULE_SET": "Rozdzielana średnikami lista plików w domyślnym zestawie nagłówków modułu C++ obiektu docelowego (tj. zestaw plików z nazwą i typem CXX_MODULES). Jeśli którakolwiek ze ścieżek jest względna, jest obliczana względem katalogu źródłowego obiektu docelowego. Właściwość obsługuje wyrażenia generatora <cmake-generator-expressions(7)>.",
	"assets/variables.json.CXX_MODULE_SETS": "Lista tylko do odczytu zestawów modułów PRIVATE i PUBLIC C++ obiektu docelowego (tj. wszystkich zestawów plików z typem CXX_MODULES). Pliki wymienione w tych zestawach plików są traktowane jako pliki źródłowe na potrzeby integracji środowiska IDE.",
	"assets/variables.json.CXX_MODULE_SET_NAME": "Rozdzielana średnikami lista plików w zestawie nagłówków modułu <NAME> C++ elementu docelowego, który ma ustawiony typ CXX_MODULES. Jeśli dowolna ze ścieżek jest względna, jest obliczana względem katalogu źródłowego obiektu docelowego. Właściwość obsługuje wyrażenia generatora <cmake-generator-expressions(7)>.",
	"assets/variables.json.CXX_MODULE_STD": "CXX_MODULE_STD jest wartością logiczną określającą, czy obiekt docelowy może używać importu standardowego; jego źródeł języka C++ lub nie.",
	"assets/variables.json.CXX_STANDARD": "Standard języka C++, którego funkcje są wymagane do skompilowania tego elementu docelowego.",
	"assets/variables.json.CXX_STANDARD_REQUIRED": "Wartość logiczna opisująca, czy właściwość CXX_STANDARD jest wymagana.",
	"assets/variables.json.C_EXTENSIONS": "Wartość logiczna określająca, czy są wymagane rozszerzenia specyficzne dla kompilatora.",
	"assets/variables.json.C_STANDARD": "Standard języka C, którego funkcje są wymagane do skompilowania tego elementu docelowego.",
	"assets/variables.json.C_STANDARD_REQUIRED": "Wartość logiczna opisująca, czy wartość właściwości C_STANDARD jest wymagana.",
	"assets/variables.json.DEBUG_POSTFIX": "Zobacz właściwość elementu docelowego <CONFIG>_POSTFIX.",
	"assets/variables.json.DEFINE_SYMBOL": "Zdefiniuj symbol podczas kompilowania źródeł tego elementu docelowego.",
	"assets/variables.json.DEPLOYMENT_ADDITIONAL_FILES": "Ustaw pliki AdditionalFiles projektu WinCE w narzędziu DeploymentTool w plikach vcproj generowanych przez generatory programu Visual Studio. Jest to przydatne, gdy chcesz debugować na zdalnym urządzeniu WinCE. Określ dodatkowe pliki, które zostaną skopiowane na urządzenie. Na przykład:",
	"assets/variables.json.DEPLOYMENT_REMOTE_DIRECTORY": "Ustaw katalog RemoteDirectory projektu WinCE w narzędziu DeploymentTool i RemoteExecutable w narzędziu DebuggerTool w plikach vcproj generowanych przez generatory programu Visual Studio. Jest to przydatne, gdy chcesz debugować na zdalnym urządzeniu WinCE. Na przykład:",
	"assets/variables.json.DEPRECATION": "Komunikat o wycofaniu od dewelopera zaimportowanego elementu docelowego.",
	"assets/variables.json.DISABLE_PRECOMPILE_HEADERS": "Wyłącza kompilację wstępną plików nagłówkowych określonych przez właściwość PRECOMPILE_HEADERS.",
	"assets/variables.json.DLL_NAME_WITH_SOVERSION": "Ta właściwość określa, czy właściwość docelowa elementu docelowego SOVERSION jest dodawana do nazwy pliku wygenerowanych nazw plików DLL dla platformy systemu Windows, która jest wybierana, gdy zmienna WIN32 jest ustawiona.",
	"assets/variables.json.DOTNET_SDK": "Określ zestaw .NET SDK dla projektów języka C#. Na przykład: Microsoft .NET.Sdk.",
	"assets/variables.json.DOTNET_TARGET_FRAMEWORK": "Określ docelową platformę .NET.",
	"assets/variables.json.DOTNET_TARGET_FRAMEWORK_VERSION": "Określ docelową wersję platformy .NET.",
	"assets/variables.json.EchoString": "Komunikat do wyświetlenia po skompilowaniu elementu docelowego.",
	"assets/variables.json.ENABLE_EXPORTS": "Określ, czy plik wykonywalny, czy biblioteka udostępniona eksportuje symbole.",
	"assets/variables.json.EXCLUDE_FROM_DEFAULT_BUILD": "Wyklucz element docelowy z operacji Kompiluj rozwiązanie.",
	"assets/variables.json.EXCLUDE_FROM_DEFAULT_BUILD_CONFIG": "Specyficzna dla konfiguracji wersja wykluczenia elementu docelowego z operacji Kompiluj rozwiązanie.",
	"assets/variables.json.EXPORT_COMPILE_COMMANDS": "Włącz/wyłącz dane wyjściowe poleceń kompilacji podczas generowania dla elementu docelowego.",
	"assets/variables.json.EXPORT_FIND_PACKAGE_NAME": "Steruj nazwą pakietu skojarzoną z elementem docelowym zależności podczas eksportowania wywołania find_dependency w trakcie instalacji lub eksportu. Może to służyć do przypisywania nazwy pakietu do pakietu skompilowanego przez narzędzie CMake i wyeksportowanego albo zastąpienia pakietu w wywołaniu find_package, które utworzyło element docelowy.",
	"assets/variables.json.EXPORT_NAME": "Wyeksportowana nazwa dla plików docelowych.",
	"assets/variables.json.EXPORT_NO_SYSTEM": "Ta właściwość wpływa na zachowanie poleceń instalacji i eksportu podczas instalowania lub eksportowania obiektu docelowego. Gdy właściwość EXPORT_NO_SYSTEM jest ustawiona na wartość „true”, te polecenia generują zaimportowany element docelowy z właściwością SYSTEM ustawioną na wartość „false”.",
	"assets/variables.json.EXPORT_PROPERTIES": "Lista dodatkowych właściwości do eksportowania dla elementu docelowego.",
	"assets/variables.json.FOLDER": "W przypadku obiektów IDE, które prezentują obiekty docelowe przy użyciu hierarchii folderów, ta właściwość określa nazwę folderu, pod którą ma zostać umieszczony obiekt docelowy. Aby zagnieżdżać foldery, użyj wartości FOLDER, takich jak GUI/Dialogs, ze znakami oddzielającymi poziomy folderów. Obiekty docelowe bez właściwości FOLDER będą wyświetlane jako jednostki najwyższego poziomu. Obiekty docelowe z tą samą wartością właściwości FOLDER będą wyświetlane w tym samym folderze co elementy równorzędne.",
	"assets/variables.json.Fortran_BUILDING_INSTRINSIC_MODULES": "Instruuje preprocesor CMake Fortran, że obiekt docelowy kompiluje wewnętrzne składniki Fortran na potrzeby kompilatora Fortran.",
	"assets/variables.json.Fortran_MODULE_DIRECTORY": "Określ katalog docelowy dla modułów Fortran dostarczanych przez element docelowy.",
	"assets/variables.json.FRAMEWORK": "Kompiluj bibliotekę SHARED lub STATIC jako pakiet Framework Bundle w systemach macOS i iOS.",
	"assets/variables.json.FRAMEWORK_MULTI_CONFIG_POSTFIX_CONFIG": "Przyrostek do dołączenia do nazwy pliku platformy dla konfiguracji <CONFIG>, gdy jest używany generator wielu konfiguracji (na przykład Xcode i Ninja Multi-Config).",
	"assets/variables.json.FRAMEWORK_VERSION": "Wersja struktury utworzonej przy użyciu właściwości elementu docelowego FRAMEWORK (np. A).",
	"assets/variables.json.GENERATOR_FILE_NAME": "Plik generatora dla tego elementu docelowego.",
	"assets/variables.json.GHS_INTEGRITY_APP": "Wartość logiczna ON / OFF określająca, czy cel wykonywalny powinien być traktowany jako aplikacja integralności.",
	"assets/variables.json.GHS_NO_SOURCE_GROUP_FILE": "Wartość logiczna ON / OFF określająca, czy plik projektu dla elementu docelowego powinien być pojedynczym plikiem lub wieloma plikami.",
	"assets/variables.json.GNUtoMS": "Konwertuj bibliotekę importu GNU (.dll.a) na format firmy Microsoft (lib).",
	"assets/variables.json.HAS_CXX": "Połącz element docelowy za pomocą narzędzia konsolidatora języka C++ (przestarzałe).",
	"assets/variables.json.HEADER_DIRS": "Rozdzielana średnikami lista katalogów podstawowych domyślnego zestawu nagłówków obiektu docelowego (tj. zestawu plików, z nazwą i typem HEADERS). Właściwość obsługuje wyrażenia generatora <cmake-generator-expressions(7)>.",
	"assets/variables.json.HEADER_DIRS_NAME": "Rozdzielana średnikami lista katalogów podstawowych zestawu nagłówków <NAME> elementu docelowego, który ma ustawiony typ HEADERS. Właściwość obsługuje wyrażenia generatora <cmake-generator-expressions(7)>.",
	"assets/variables.json.HEADER_SET": "Rozdzielana średnikami lista plików w domyślnym zestawie nagłówków obiektu docelowego (tj. zestaw plików z nazwą i typem HEADERS). Jeśli którakolwiek ze ścieżek jest względna, są obliczane względem katalogu źródłowego obiektu docelowego. Właściwość obsługuje wyrażenia generatora <cmake-generator-expressions(7)>.",
	"assets/variables.json.HEADER_SETS": "Lista tylko do odczytu zestawów nagłówków PRIVATE i PUBLIC elementu docelowego (tj. wszystkich zestawów plików z typem HEADERS). Pliki wymienione w tych zestawach plików są traktowane jako pliki źródłowe na potrzeby integracji IDE. Pliki mają także zestaw właściwość HEADER_FILE_ONLY ustawiony na wartość TRUE.",
	"assets/variables.json.HEADER_SET_NAME": "Rozdzielana średnikami lista plików w zestawie nagłówków <NAME> elementu docelowego, który ma ustawiony typ HEADERS. Jeśli dowolna ze ścieżek jest względna, jest obliczana względem katalogu źródłowego obiektu docelowego. Właściwość obsługuje wyrażenia generatora <\\cmake-generator-expressions(7)>.",
	"assets/variables.json.HIP_ARCHITECTURES": "Lista architektur procesorów GPU, dla których ma zostać wygenerowany kod urządzenia. Nazwy architektur są interpretowane na podstawie zmiennej CMAKE_HIP_PLATFORM.",
	"assets/variables.json.HIP_EXTENSIONS": "Wartość logiczna określająca, czy są wymagane rozszerzenia specyficzne dla kompilatora.",
	"assets/variables.json.HIP_STANDARD": "Standard HIP/C++ zażądał skompilowania tego obiektu docelowego.",
	"assets/variables.json.HIP_STANDARD_REQUIRED": "Wartość logiczna opisująca, czy wartość HIP_STANDARD jest wymagana.",
	"assets/variables.json.IMPORTED": "Przeznaczone tylko do odczytu wskazanie, czy element docelowy ma właściwość IMPORTED.",
	"assets/variables.json.IMPORTED_COMMON_LANGUAGE_RUNTIME": "Właściwość służąca do definiowania, czy obiekt docelowy używa języka C++/interfejsu wiersza polecenia.",
	"assets/variables.json.IMPORTED_CONFIGURATIONS": "Konfiguracje podane dla importowanego elementu docelowego.",
	"assets/variables.json.IMPORTED_CXX_MODULES_COMPILE_DEFINITIONS": "Definicje preprocesora na potrzeby kompilowania źródeł modułu C++ elementu docelowego IMPORTED.",
	"assets/variables.json.IMPORTED_CXX_MODULES_COMPILE_FEATURES": "Funkcje kompilatora włączone dla tych modułów C++ tego elementu docelowego IMPORTED.",
	"assets/variables.json.IMPORTED_CXX_MODULES_COMPILE_OPTIONS": "Lista opcji do przekazania do kompilatora dla modułów C++ elementu docelowego IMPORTED.",
	"assets/variables.json.IMPORTED_CXX_MODULES_INCLUDE_DIRECTORIES": "Lista katalogów wyszukiwania plików dołączonych preprocesora podczas kompilowania modułów C++ dla elementów docelowych IMPORTED.",
	"assets/variables.json.IMPORTED_CXX_MODULES_LINK_LIBRARIES": "Lista zależności bezpośrednich, które mają być używane na potrzeby wymagań dotyczących użycia modułów języka C++ w modułach C++ obiektu docelowego.",
	"assets/variables.json.IMPORTED_GLOBAL": "Wskazuje, czy element docelowy z właściwością IMPORTED jest widoczny globalnie.",
	"assets/variables.json.IMPORTED_IMPLIB": "Pełna ścieżka do biblioteki importu dla elementu docelowego z właściwością IMPORTED.",
	"assets/variables.json.IMPORTED_IMPLIB_CONFIG": "Specyficzna dla konfiguracji <CONFIG> wersja właściwości IMPORTED_IMPLIB.",
	"assets/variables.json.IMPORTED_LIBNAME": "Określ nazwę biblioteki dołączanej dla importowanej biblioteki interfejsu.",
	"assets/variables.json.IMPORTED_LIBNAME_CONFIG": "Specyficzna dla konfiguracji <CONFIG> wersja właściwości IMPORTED_LIBNAME.",
	"assets/variables.json.IMPORTED_LINK_DEPENDENT_LIBRARIES": "Zależne biblioteki udostępnione importowanej biblioteki udostępnionej.",
	"assets/variables.json.IMPORTED_LINK_DEPENDENT_LIBRARIES_CONFIG": "Specyficzna dla konfiguracji <CONFIG> wersja właściwości IMPORTED_LINK_DEPENDENT_LIBRARIES.",
	"assets/variables.json.IMPORTED_LINK_INTERFACE_LANGUAGES": "Języki kompilowane w bibliotece statycznej z właściwością IMPORTED.",
	"assets/variables.json.IMPORTED_LINK_INTERFACE_LANGUAGES_CONFIG": "Specyficzna dla konfiguracji <CONFIG> wersja właściwości IMPORTED_LINK_INTERFACE_LANGUAGES.",
	"assets/variables.json.IMPORTED_LINK_INTERFACE_LIBRARIES": "Interfejs przechodni łączenia elementu docelowego z właściwością IMPORTED.",
	"assets/variables.json.IMPORTED_LINK_INTERFACE_LIBRARIES_CONFIG": "Specyficzna dla konfiguracji <CONFIG> wersja właściwości IMPORTED_LINK_INTERFACE_LIBRARIES.",
	"assets/variables.json.IMPORTED_LINK_INTERFACE_MULTIPLICITY": "Liczba powtórzeń dla cykli bibliotek statycznych z właściwością IMPORTED.",
	"assets/variables.json.IMPORTED_LINK_INTERFACE_MULTIPLICITY_CONFIG": "Specyficzna dla konfiguracji <CONFIG> wersja właściwości IMPORTED_LINK_INTERFACE_MULTIPLICITY.",
	"assets/variables.json.IMPORTED_LOCATION": "Pełna ścieżka do głównego pliku na dysku dla elementu docelowego z właściwością IMPORTED.",
	"assets/variables.json.IMPORTED_LOCATION_CONFIG": "Specyficzna dla konfiguracji <CONFIG> wersja właściwości IMPORTED_LOCATION.",
	"assets/variables.json.IMPORTED_NO_SONAME": "Określa, czy element docelowy biblioteki udostępnionej z właściwością IMPORTED nie ma pola soname.",
	"assets/variables.json.IMPORTED_NO_SONAME_CONFIG": "Specyficzna dla konfiguracji <CONFIG> wersja właściwości IMPORTED_NO_SONAME.",
	"assets/variables.json.IMPORTED_NO_SYSTEM": "Ustawienie właściwości IMPORTED_NO_SYSTEM na wartość „true” dla zaimportowanego elementu docelowego określa, że nie jest ona wartością docelową systemu. Ma to następujące skutki:",
	"assets/variables.json.IMPORTED_OBJECTS": "Rozdzielana średnikami lista bezwzględnych ścieżek do plików obiektów na dysku dla zaimportowanej biblioteki obiektów.",
	"assets/variables.json.IMPORTED_OBJECTS_CONFIG": "Specyficzna dla konfiguracji <CONFIG> wersja właściwości IMPORTED_OBJECTS.",
	"assets/variables.json.IMPORTED_SONAME": "Pole soname elementu docelowego typu biblioteka udostępniona z właściwością IMPORTED.",
	"assets/variables.json.IMPORTED_SONAME_CONFIG": "Specyficzna dla konfiguracji <CONFIG> wersja właściwości IMPORTED_SONAME.",
	"assets/variables.json.IMPORT_PREFIX": "Określa prefiks nazwy biblioteki importu.",
	"assets/variables.json.IMPORT_SUFFIX": "Określa sufiks nazwy biblioteki importu.",
	"assets/variables.json.INSTALL_NAME_DIR": "Nazwa katalogu dla zainstalowanych elementów docelowych na platformach Apple.",
	"assets/variables.json.INSTALL_REMOVE_ENVIRONMENT_RPATH": "Określa, czy ścieżki rpath zdefiniowane przez łańcuch narzędzi powinny być usuwane podczas instalacji.",
	"assets/variables.json.INSTALL_RPATH": "Ścieżka rpath do użycia dla zainstalowanych elementów docelowych.",
	"assets/variables.json.INSTALL_RPATH_USE_LINK_PATH": "Dodaj ścieżki do ścieżki rpath dla wyszukiwania konsolidatora i zainstalowanych elementów.",
	"assets/variables.json.INTERFACE_AUTOMOC_MACRO_NAMES": "Rozdzielana średnikami lista nazw makr, które mają być propagowane przez funkcję AUTOMOC do użytkowników.",
	"assets/variables.json.INTERFACE_AUTOUIC_OPTIONS": "Lista opcji interfejsu, które zostaną przekazane do narzędzia uic.",
	"assets/variables.json.INTERFACE_COMPILE_DEFINITIONS": "Lista wymagań dla publicznego elementu property_name dotycząca biblioteki.",
	"assets/variables.json.INTERFACE_COMPILE_FEATURES": "Lista wymagań dla publicznego elementu property_name dotycząca biblioteki.",
	"assets/variables.json.INTERFACE_COMPILE_OPTIONS": "Lista wymagań dla publicznego elementu property_name dotycząca biblioteki.",
	"assets/variables.json.INTERFACE_CXX_MODULE_SETS": "Lista tylko do odczytu zestawów modułów PUBLIC C++ obiektu docelowego (tj. wszystkich zestawów plików z typem CXX_MODULES). Pliki wymienione w tych zestawach modułów języka C++ można instalować i eksportować wraz z instalacją i eksportowaniem.",
	"assets/variables.json.INTERFACE_HEADER_SETS": "Lista tylko do odczytu zestawów nagłówków INTERFACE i PUBLIC obiektu docelowego (tj. wszystkich zestawów plików z typem HEADERS). Pliki wymienione w tych zestawach nagłówków można instalować za pomocą funkcji instalowania i eksportować wraz z instalacją i eksportowaniem.",
	"assets/variables.json.INTERFACE_HEADER_SETS_TO_VERIFY": "Służy do określania, które zestawy nagłówków PUBLIC i INTERFACE elementu docelowego powinny zostać zweryfikowane.",
	"assets/variables.json.INTERFACE_INCLUDE_DIRECTORIES": "Lista wymagań dla publicznego elementu property_name dotycząca biblioteki.",
	"assets/variables.json.INTERFACE_LINK_DEPENDS": "Dodatkowe pliki interfejsu publicznego, od których zależą dane binarne elementu docelowego na potrzeby łączenia.",
	"assets/variables.json.INTERFACE_LINK_DIRECTORIES": "Lista wymagań dla publicznego elementu property_name dotycząca biblioteki.",
	"assets/variables.json.INTERFACE_LINK_LIBRARIES": "Wyświetl listę bibliotek interfejsu publicznego dla biblioteki.",
	"assets/variables.json.INTERFACE_LINK_LIBRARIES_DIRECT": "Lista bibliotek, które użytkownicy tej biblioteki powinni traktować jako zależności linków bezpośrednich.",
	"assets/variables.json.INTERFACE_LINK_LIBRARIES_DIRECT_EXCLUDE": "Lista bibliotek, które użytkownicy tej biblioteki nie powinni traktować jako zależności linków bezpośrednich.",
	"assets/variables.json.INTERFACE_LINK_OPTIONS": "Lista wymagań dla publicznego elementu property_name dotycząca biblioteki.",
	"assets/variables.json.INTERFACE_POSITION_INDEPENDENT_CODE": "Określa, czy konsumenci muszą utworzyć element docelowy niezależny od pozycji",
	"assets/variables.json.INTERFACE_PRECOMPILE_HEADERS": "Lista plików nagłówkowych interfejsu do wstępnego kompilowania w używających elementach docelowych.",
	"assets/variables.json.INTERFACE_SOURCES": "Lista źródeł interfejsu do kompilowania w używających elementach docelowych.",
	"assets/variables.json.INTERFACE_SYSTEM_INCLUDE_DIRECTORIES": "Lista publicznych systemowych katalogów plików nagłówkowych dla biblioteki.",
	"assets/variables.json.IOS_INSTALL_COMBINED": "Kompiluj połączony element docelowy (urządzenia i symulatora) podczas instalacji.",
	"assets/variables.json.ISPC_HEADER_DIRECTORY": "Określ względny katalog docelowy dla nagłówków kompilatora ISPC dostarczanych przez element docelowy.",
	"assets/variables.json.ISPC_HEADER_SUFFIX": "Określ sufiks wyjściowy, który będzie używany dla nagłówków wygenerowanych przez kompilator ISPC dostarczanych przez element docelowy.",
	"assets/variables.json.ISPC_INSTRUCTION_SETS": "Lista architektur zestawów instrukcji, dla których ma zostać wygenerowany kod.",
	"assets/variables.json.JOB_POOL_COMPILE": "Tylko Ninja: pula używana do kompilowania.",
	"assets/variables.json.JOB_POOL_LINK": "Tylko Ninja: pula używana na potrzeby łączenia.",
	"assets/variables.json.JOB_POOL_PRECOMPILE_HEADER": "Tylko Ninja: pula używana do generowania wstępnie skompilowanych nagłówków.",
	"assets/variables.json.LANG_CLANG_TIDY": "Ta właściwość jest implementowana tylko wtedy, gdy element <LANG> ma wartość C, CXX, OBJC lub OBJCXX.",
	"assets/variables.json.LANG_CLANG_TIDY_EXPORT_FIXES_DIR": "Ta właściwość jest implementowana tylko wtedy, gdy <LANG> ma wartość C, CXX, OBJC lub OBJCXX i ma wpływ tylko wtedy, gdy ustawiono <LANG>_CLANG_TIDY.",
	"assets/variables.json.LANG_COMPILER_LAUNCHER": "Ta właściwość jest implementowana tylko wtedy, gdy właściwość <LANG> ma wartość C, CXX, Fortran, HIP, ISPC, OBJC, OBJCXX lub CUDA.",
	"assets/variables.json.LANG_CPPCHECK": "Ta właściwość jest obsługiwana tylko wtedy, gdy element <LANG> ma wartość C lub CXX.",
	"assets/variables.json.LANG_CPPLINT": "Ta właściwość jest obsługiwana tylko wtedy, gdy element <LANG> ma wartość C lub CXX.",
	"assets/variables.json.LANG_EXTENSIONS": "Odmiany są następujące:",
	"assets/variables.json.LANG_INCLUDE_WHAT_YOU_USE": "Ta właściwość jest implementowana tylko wtedy, gdy element <LANG> ma wartość C lub CXX.",
	"assets/variables.json.LANG_LINKER_LAUNCHER": "Ta właściwość jest implementowana tylko wtedy, gdy właściwość <LANG> ma wartość C, CXX, OBJC lub OBJCXX",
	"assets/variables.json.LANG_STANDARD": "Odmiany są następujące:",
	"assets/variables.json.LANG_STANDARD_REQUIRED": "Odmiany są następujące:",
	"assets/variables.json.LANG_VISIBILITY_PRESET": "Wartość dla flag kompilacji widoczności symbolu",
	"assets/variables.json.LIBRARY_OUTPUT_DIRECTORY": "Katalog wyjściowy dla skompilowanych plików docelowych XXX.",
	"assets/variables.json.LIBRARY_OUTPUT_DIRECTORY_CONFIG": "Ustawiany dla konfiguracji katalog wyjściowy dla  plików elementu docelowego LIBRARY.",
	"assets/variables.json.LIBRARY_OUTPUT_NAME": "Nazwa wyjściowa dla plików docelowych XXX.",
	"assets/variables.json.LIBRARY_OUTPUT_NAME_CONFIG": "Ustawiana dla konfiguracji nazwa wyjściowa dla plików elementu docelowego LIBRARY.",
	"assets/variables.json.LINKER_LANGUAGE": "Określa język, którego kompilator wywoła konsolidator.",
	"assets/variables.json.LINKER_TYPE": "Określ, który konsolidator będzie używany dla kroku linku. Wartość właściwości może używać wyrażeń generatora <cmake-generator-expressions(7)>.",
	"assets/variables.json.LINK_DEPENDS": "Dodatkowe pliki, od których zależą dane binarne elementu docelowego na potrzeby łączenia.",
	"assets/variables.json.LINK_DEPENDS_NO_SHARED": "Nie dodawaj zależności od połączonych plików bibliotek udostępnionych.",
	"assets/variables.json.LINK_FLAGS": "Dodatkowe flagi do użycia podczas łączenia tego elementu docelowego, jeśli jest to biblioteka udostępniona, moduł biblioteki lub plik wykonywalny. Biblioteki statyczne muszą używać właściwości STATIC_LIBRARY_OPTIONS lub STATIC_LIBRARY_FLAGS.",
	"assets/variables.json.LINK_FLAGS_CONFIG": "Ustawiane dla konfiguracji flagi konsolidatora dla elementu docelowego biblioteki UDOSTĘPNIONEJ, MODUŁU lub PLIKU wykonywalnego.",
	"assets/variables.json.LINK_INTERFACE_LIBRARIES": "Lista bibliotek interfejsu publicznego dla biblioteki udostępnionej lub pliku wykonywalnego.",
	"assets/variables.json.LINK_INTERFACE_LIBRARIES_CONFIG": "Ustawiana dla konfiguracji lista bibliotek interfejsu publicznego dla elementu docelowego.",
	"assets/variables.json.LINK_INTERFACE_MULTIPLICITY": "Liczba powtórzeń dla bibliotek STATIC z zależnościami cyklicznymi.",
	"assets/variables.json.LINK_INTERFACE_MULTIPLICITY_CONFIG": "Ustawiana dla konfiguracji liczba powtórzeń cykli bibliotek STATIC.",
	"assets/variables.json.LINK_LIBRARIES": "Lista zależności dołączanych bezpośrednio.",
	"assets/variables.json.LINK_LIBRARIES_ONLY_TARGETS": "Wymuszaj, aby elementy łączące, które mogą być nazwami docelowymi, są w rzeczywistości istniejącymi elementami docelowymi.",
	"assets/variables.json.LINK_LIBRARY_OVERRIDE": "Zastąp funkcje biblioteki skojarzone z bibliotekami z LINK_LIBRARY wyrażeń generatora. Może to służyć do rozpoznawania niezgodnych funkcji biblioteki, które wynikają z określenia różnych funkcji dla tej samej biblioteki w różnych wyrażeniach generatora LINK_LIBRARY.",
	"assets/variables.json.LINK_LIBRARY_OVERRIDE_LIBRARY": "Zastąp funkcję biblioteki skojarzoną z biblioteką <LIBRARY> z wyrażeń generatora LINK_LIBRARY. Może to służyć do rozpoznawania niezgodnych funkcji biblioteki, które wynikają z określenia różnych funkcji biblioteki <LIBRARY> w różnych wyrażeniach generatora LINK_LIBRARY.",
	"assets/variables.json.LINK_SEARCH_END_STATIC": "Zakończ polecenie łączenia tak, aby zostały użyte statyczne biblioteki systemowe.",
	"assets/variables.json.LINK_SEARCH_START_STATIC": "Przyjmij, że konsolidator domyślnie szuka bibliotek statycznych.",
	"assets/variables.json.LINK_WHAT_YOU_USE": "Jest to opcja logiczna, która w przypadku ustawienia na wartość TRUE spowoduje automatyczne uruchomienie spisu treści lub wartości CMAKE_LINK_WHAT_YOU_USE_CHECK dla obiektu docelowego po jego dołączeniu. Ponadto flaga konsolidatora określona przez wartość CMAKE_<LANG>_LINK_WHAT_YOU_USE_FLAG będzie przekazana do obiektu docelowego przy użyciu polecenia link, dzięki czemu wszystkie biblioteki określone w wierszu polecenia zostaną połączone w obiekcie docelowym. Efektem będzie operacja łączenia generująca listę bibliotek, które nie udostępniają symboli używanych przez ten obiekt docelowy, ale które są do niego dołączane.",
	"assets/variables.json.LOCATION_CONFIG": "Właściwość tylko do odczytu podająca lokalizację elementu docelowego na dysku.",
	"assets/variables.json.MACHO_COMPATIBILITY_VERSION": "Jaki numer wersji zgodności ma ten element docelowy dla plików binarnych Mach-O.",
	"assets/variables.json.MACHO_CURRENT_VERSION": "Jaki bieżący numer wersji ma ten element docelowy dla plików binarnych Mach-O.",
	"assets/variables.json.MACOSX_BUNDLE": "Kompiluj plik wykonywalny jako pakiet Application Bundle w systemach macOS lub iOS.",
	"assets/variables.json.MACOSX_BUNDLE_INFO_PLIST": "Określ niestandardowy szablon Info.plist dla pakietu Application Bundle systemów macOS i iOS.",
	"assets/variables.json.MACOSX_FRAMEWORK_INFO_PLIST": "Określ niestandardowy szablon Info.plist dla struktury systemów macOS i iOS.",
	"assets/variables.json.MACOSX_RPATH": "Określa, czy ten element docelowy w systemie macOS lub iOS jest lokalizowany w środowisku uruchomieniowym przy użyciu ścieżek rpath.",
	"assets/variables.json.MANUALLY_ADDED_DEPENDENCIES": "Pobierz ręcznie dodane zależności do innych elementów docelowych najwyższego poziomu.",
	"assets/variables.json.MAP_IMPORTED_CONFIG_CONFIG": "Mapuj konfigurację projektu na konfigurację importowanego elementu docelowego.",
	"assets/variables.json.MSVC_DEBUG_INFORMATION_FORMAT": "Wybierz format informacji debugowania podczas określania wartości docelowej usługi ABI MSVC.",
	"assets/variables.json.MSVC_RUNTIME_LIBRARY": "Wybierz bibliotekę środowiska uruchomieniowego MSVC do użycia przez kompilatory przeznaczone dla interfejsu ABI środowiska MSVC.",
	"assets/variables.json.NAME": "Nazwa logiczna dla elementu docelowego.",
	"assets/variables.json.NO_SONAME": "Określa, czy ustawić pole soname podczas dołączania biblioteki udostępnionej.",
	"assets/variables.json.NO_SYSTEM_FROM_IMPORTED": "Nie traktuj katalogów plików nagłówkowych z interfejsów wykorzystanych zaimportowanych obiektów docelowych jako katalogów systemowych.",
	"assets/variables.json.OBJCXX_EXTENSIONS": "Wartość logiczna określająca, czy są wymagane rozszerzenia specyficzne dla kompilatora.",
	"assets/variables.json.OBJCXX_STANDARD": "Standard języka ObjC++, którego funkcje są wymagane do skompilowania tego elementu docelowego.",
	"assets/variables.json.OBJCXX_STANDARD_REQUIRED": "Wartość logiczna opisująca, czy wartość właściwości OBJCXX_STANDARD jest wymagana.",
	"assets/variables.json.OBJC_EXTENSIONS": "Wartość logiczna określająca, czy są wymagane rozszerzenia specyficzne dla kompilatora.",
	"assets/variables.json.OBJC_STANDARD": "Standard języka OBJC, którego funkcje są wymagane do skompilowania tego elementu docelowego.",
	"assets/variables.json.OBJC_STANDARD_REQUIRED": "Wartość logiczna opisująca, czy wartość właściwości OBJC_STANDARD jest wymagana.",
	"assets/variables.json.OPTIMIZE_DEPENDENCIES": "Aktywuje optymalizację zależności bibliotek statycznych i bibliotek obiektów.",
	"assets/variables.json.OSX_ARCHITECTURES": "Ustawia jako docelowe określone architektury dla systemu macOS.",
	"assets/variables.json.OSX_ARCHITECTURES_CONFIG": "Ustawiane dla konfiguracji architektury plików binarnych systemów macOS i iOS dla elementu docelowego.",
	"assets/variables.json.OUTPUT_NAME": "Nazwa wyjściowa dla plików docelowych.",
	"assets/variables.json.OUTPUT_NAME_CONFIG": "Podstawowa nazwa pliku docelowego dla konfiguracji.",
	"assets/variables.json.PCH_INSTANTIATE_TEMPLATES": "Gdy ta właściwość jest równa true, opcje kompilatora dotyczące prekompilowanych nagłówków będą zawierać flagę tworzenia wystąpienia szablonów podczas generowania nagłówka PCH, jeśli jest obsługiwany. Może to znacznie skrócić czas kompilowania. Obsługiwane w narzędziu Clang od wersji 11.",
	"assets/variables.json.PCH_WARN_INVALID": "Gdy ta właściwość ma wartość true, opcje kompilatora nagłówka wstępnej kompilacji będą zawierać flagę kompilatora, która powinna ostrzegać o nieprawidłowych wstępnie skompilowanych nagłówkach, np. -Winvalid-pch dla kompilatora GNU.",
	"assets/variables.json.PDB_NAME": "Nazwa wyjściowa dla pliku pdb symboli debugowania firmy Microsoft wygenerowanego przez konsolidator dla elementu docelowego pliku wykonywalnego lub biblioteki udostępnionej.",
	"assets/variables.json.PDB_NAME_CONFIG": "Ustawiana dla konfiguracji nazwa wyjściowa dla pliku pdb symboli debugowania firmy Microsoft wygenerowanego przez konsolidator dla elementu docelowego pliku wykonywalnego lub biblioteki udostępnionej.",
	"assets/variables.json.PDB_OUTPUT_DIRECTORY": "Katalog wyjściowy dla pliku pdb symboli debugowania firmy Microsoft wygenerowanego przez konsolidator dla elementu docelowego pliku wykonywalnego lub biblioteki udostępnionej.",
	"assets/variables.json.PDB_OUTPUT_DIRECTORY_CONFIG": "Ustawiany dla konfiguracji katalog wyjściowy dla pliku pdb symboli debugowania firmy Microsoft wygenerowanego przez kompilator dla elementu docelowego pliku wykonywalnego lub biblioteki udostępnionej.",
	"assets/variables.json.POSITION_INDEPENDENT_CODE": "Określa, czy należy utworzyć cel niezależny od pozycji",
	"assets/variables.json.POST_INSTALL_SCRIPT": "Obsługa przestarzałej instalacji.",
	"assets/variables.json.PRECOMPILE_HEADERS": "Lista plików nagłówkowych do wstępnej kompilacji.",
	"assets/variables.json.PRECOMPILE_HEADERS_REUSE_FROM": "Element docelowy, z którego ma zostać ponownie użyty artefakt kompilacji wstępnie skompilowanych nagłówków.",
	"assets/variables.json.PREFIX": "Określa, co poprzedza nazwę biblioteki.",
	"assets/variables.json.PRE_INSTALL_SCRIPT": "Obsługa przestarzałej instalacji.",
	"assets/variables.json.PRIVATE_HEADER": "Określ pliki prywatnego nagłówka w elemencie docelowym biblioteki udostępnionej z właściwością FRAMEWORK.",
	"assets/variables.json.PROJECT_LABEL": "Zmień nazwę elementu docelowego w środowisku IDE.",
	"assets/variables.json.PUBLIC_HEADER": "Określ publiczne pliki nagłówkowe w elemencie docelowym biblioteki udostępnionej FRAMEWORK.",
	"assets/variables.json.RESOURCE": "Określ pliki zasobów we właściwości FRAMEWORK lub BUNDLE.",
	"assets/variables.json.RUNTIME_OUTPUT_DIRECTORY": "Katalog wyjściowy dla skompilowanych plików docelowych XXX.",
	"assets/variables.json.RUNTIME_OUTPUT_DIRECTORY_CONFIG": "Przypisany do konfiguracji katalog wyjściowy dla plików docelowych elementu RUNTIME.",
	"assets/variables.json.RUNTIME_OUTPUT_NAME": "Nazwa wyjściowa dla plików docelowych XXX.",
	"assets/variables.json.RUNTIME_OUTPUT_NAME_CONFIG": "Przypisana do konfiguracji nazwa wyjścia dla plików docelowych elementu RUNTIME.",
	"assets/variables.json.SKIP_BUILD_RPATH": "Czy dla drzewa kompilacji powinny być używane ścieżki rpath.",
	"assets/variables.json.SOURCES": "Określa listę ścieżek do plików źródłowych dla obiektu docelowego. Następujące polecenia są ustawiane lub dodawane do właściwości docelowej SOURCES i są typowym sposobem manipulowania nią:",
	"assets/variables.json.SOVERSION": "Numer wersji usługi ABI obiektu docelowego biblioteki udostępnionej.",
	"assets/variables.json.STATIC_LIBRARY_FLAGS": "Flagi archiwizatora (lub bibliotekarza MSVC) dla elementu docelowego będącego biblioteką statyczną. Elementy docelowe, które są bibliotekami udostępnionymi, modułami lub plikami wykonywalnymi, muszą korzystać z właściwości LINK_OPTIONS lub LINK_FLAGS elementu docelowego.",
	"assets/variables.json.STATIC_LIBRARY_FLAGS_CONFIG": "Przypisane do konfiguracji flagi archiwizatora (lub bibliotekarza MSVC) dla elementu docelowego będącego biblioteką statyczną.",
	"assets/variables.json.STATIC_LIBRARY_OPTIONS": "Flagi archiwizatora (lub bibliotekarza MSVC) dla elementu docelowego będącego biblioteką statyczną. Elementy docelowe, które są bibliotekami udostępnionymi, modułami lub plikami wykonywalnymi, muszą korzystać z właściwości LINK_OPTIONS elementu docelowego.",
	"assets/variables.json.SUFFIX": "Co jest za nazwą elementu docelowego.",
	"assets/variables.json.Swift_COMPILATION_MODE": "Określ sposób kompilowania elementu docelowego przez program Swift.",
	"assets/variables.json.Swift_LANGUAGE_VERSION": "Ta właściwość określa wersję języka dla źródeł Swift w elemencie docelowym. Jeśli nie zostanie określona, wartością domyślną będzie CMAKE_Swift_LANGUAGE_VERSION; w przeciwnym razie będzie to najnowsza wersja obsługiwana przez kompilator.",
	"assets/variables.json.Swift_MODULE_DIRECTORY": "Określ katalog docelowy dla modułów Swift dostarczanych przez element docelowy.",
	"assets/variables.json.Swift_MODULE_NAME": "Ta właściwość określa nazwę modułu Swift. Domyślnie jest to nazwa elementu docelowego.",
	"assets/variables.json.TEST_LAUNCHER": "Użyj podanego modułu uruchamiania do uruchamiania plików wykonywalnych. To polecenie zostanie dodane jako prefiks do poleceń add_test dla plików wykonywalnych systemu docelowego kompilacji i jest przeznaczone do uruchamiania na maszynie hosta.",
	"assets/variables.json.TRANSITIVE_COMPILE_PROPERTIES": "Właściwości, które wyrażenie generatora TARGET_PROPERTY dla elementu docelowego i jego elementów zależnych, oblicza jako sumę wartości zebranych z przechodniego zamknięcia zależności linków, z wyłączeniem wpisów chronionych przez LINK_ONLY.",
	"assets/variables.json.TRANSITIVE_LINK_PROPERTIES": "Właściwości, które wyrażenie generatora TARGET_PROPERTY dla elementu docelowego i jego elementów zależnych, oblicza jako sumę wartości zebranych z przechodniego zamknięcia zależności linków, w tym wpisów chronionych przez LINK_ONLY.",
	"assets/variables.json.UNITY_BUILD": "Gdy ta właściwość jest ma wartość true, docelowe pliki źródłowe zostaną połączone w partie, aby zapewnić szybszą kompilację. Odbywa się to przez utworzenie (zestawu) źródeł aparatu Unity z instrukcją #include dla oryginalnych źródeł, a następnie skompilowanie tych źródeł aparatu Unity zamiast oryginałów. Jest to znane jako kompilacja Unity lub Jumbo.",
	"assets/variables.json.UNITY_BUILD_BATCH_SIZE": "Określa maksymalną liczbę plików źródłowych, które można połączyć w dowolny pojedynczy plik źródłowy aparatu Unity, gdy kompilacje Unity są włączone przez właściwość docelową UNITY_BUILD. Oryginalne pliki źródłowe zostaną rozdystrybuowane między tyle plików źródłowych aparatu Unity, ile wymaga ten limit.",
	"assets/variables.json.UNITY_BUILD_CODE_AFTER_INCLUDE": "Fragment kodu, który został dołączony dosłownie przez funkcję UNITY_BUILD po każdej instrukcji #include w wygenerowanych plikach źródłowych aparatu Unity. Na przykład:",
	"assets/variables.json.UNITY_BUILD_CODE_BEFORE_INCLUDE": "Fragment kodu, który został dołączony dosłownie przez funkcję UNITY_BUILD przed każdą instrukcją #include w wygenerowanych plikach źródłowych aparatu Unity. Na przykład:",
	"assets/variables.json.UNITY_BUILD_MODE": "Narzędzia CMake udostępnia różne algorytmy wybierania, które zasoby mają być grupowane razem w zasobniku. Wybór zależy od tej właściwości, która ma następujące dopuszczalne wartości:",
	"assets/variables.json.UNITY_BUILD_UNIQUE_ID": "Nazwa prawidłowego identyfikatora C, który jest ustawiany na wartość unikatową dla pliku podczas kompilacji za pomocą aparatu Unity.",
	"assets/variables.json.VERIFY_INTERFACE_HEADER_SETS": "Służy do sprawdzania, czy wszystkie nagłówki w zestawach nagłówków PUBLIC i INTERFACE elementu docelowego mogą być dołączane samodzielnie.",
	"assets/variables.json.VERSION": "Numer wersji obiektu docelowego biblioteki udostępnionej.",
	"assets/variables.json.VISIBILITY_INLINES_HIDDEN": "Czy ma zostać dodana flaga kompilacji w celu ukrycia symboli funkcji śródwierszowych",
	"assets/variables.json.VS_CONFIGURATION_TYPE": "Typ konfiguracji projektu programu Visual Studio.",
	"assets/variables.json.VS_DEBUGGER_COMMAND": "Ustawia polecenie debugera lokalnego dla elementów docelowych programu Visual Studio z obsługą języka C++. Wartość właściwości może używać wyrażeń generatora <cmake-generator-expressions(7)>. Jest to zdefiniowane w <LocalDebuggerCommand> w pliku projektu Visual Studio. Ta właściwość jest inicjowana przez wartość zmiennej CMAKE_VS_DEBUGGER_COMMAND, jeśli jest ona ustawiona podczas tworzenia elementu docelowego.",
	"assets/variables.json.VS_DEBUGGER_COMMAND_ARGUMENTS": "Ustawia argumenty wiersza polecenia lokalnego debugera dla elementów docelowych programu Visual Studio z obsługą języka C++. Wartość właściwości może używać wyrażeń generatora <cmake-generator-expressions(7)>. Jest to zdefiniowane w <LocalDebuggerCommandArguments> w pliku projektu Visual Studio. Ta właściwość jest inicjowana przez wartość zmiennej CMAKE_VS_DEBUGGER_COMMAND_ARGUMENTS, jeśli jest ona ustawiona podczas tworzenia elementu docelowego.",
	"assets/variables.json.VS_DEBUGGER_ENVIRONMENT": "Ustawia lokalne środowisko debugera dla elementów docelowych programu Visual Studio z obsługą języka C++. Wartość właściwości może używać wyrażeń generatora <cmake-generator-expressions(7)>. Jest to zdefiniowane w <LocalDebuggerEnvironment> w pliku projektu Visual Studio. Ta właściwość jest inicjowana przez wartość zmiennej CMAKE_VS_DEBUGGER_ENVIRONMENT, jeśli jest ona ustawiona podczas tworzenia elementu docelowego.",
	"assets/variables.json.VS_DEBUGGER_WORKING_DIRECTORY": "Ustawia katalog roboczy debugera lokalnego dla elementów docelowych programu Visual Studio z obsługą języka C++. Wartość właściwości może używać wyrażeń generatora <cmake-generator-expressions(7)>. Jest to zdefiniowane w <LocalDebuggerWorkingDirectory> w pliku projektu Visual Studio. Ta właściwość jest inicjowana przez wartość zmiennej CMAKE_VS_DEBUGGER_WORKING_DIRECTORY, jeśli jest ona ustawiona podczas tworzenia elementu docelowego.",
	"assets/variables.json.VS_DESKTOP_EXTENSIONS_VERSION": "Wersja rozszerzenia systemu Windows 10 Desktop w programie Visual Studio",
	"assets/variables.json.VS_DOTNET_DOCUMENTATION_FILE": "Dane wyjściowe dokmentacji platformy .NET zarządzanego projektu programu Visual Studio",
	"assets/variables.json.VS_DOTNET_REFERENCEPROP_refname_TAG_tagname": "Definiuje właściwości XML <tagname> dla odwołania platformy .NET <refname>.",
	"assets/variables.json.VS_DOTNET_REFERENCES": "Odwołania do platformy .NET zarządzanego projektu programu Visual Studio",
	"assets/variables.json.VS_DOTNET_REFERENCES_COPY_LOCAL": "Ustawia właściwość kopii lokalnej dla wszystkich odwołań do wskazówek platformy .NET w obiekcie docelowym",
	"assets/variables.json.VS_DOTNET_REFERENCE_refname": "Odwołanie do platformy .NET zarządzanego projektu programu Visual Studio o nazwie <refname> i ścieżka do wskazówki.",
	"assets/variables.json.VS_DOTNET_STARTUP_OBJECT": "Ustawia właściwość obiektu uruchamiania w elementach docelowych programu Visual Studio .NET. Wartość właściwości definiuje w pełni kwalifikowaną nazwę klasy (w tym nazwę pakietu), na przykład: MyCompany.Package.MyStarterClass.",
	"assets/variables.json.VS_DOTNET_TARGET_FRAMEWORK_VERSION": "Określ docelową wersję platformy .NET.",
	"assets/variables.json.VS_DPI_AWARE": "Ustaw opcję Narzędzie manifestu -> Wejście i Wyjście -> Rozpoznawianie DPI we właściwościach projektu docelowego programu Visual Studio.",
	"assets/variables.json.VS_FILTER_PROPS": "Ustawia plik właściwości filtru do uwzględnienia w pliku filtru projektu języka C++ programu Visual Studio.",
	"assets/variables.json.VS_GLOBAL_KEYWORD": "Słowo kluczowe projektu programu Visual Studio.",
	"assets/variables.json.VS_GLOBAL_PROJECT_TYPES": "Typy projektów programu Visual Studio.",
	"assets/variables.json.VS_GLOBAL_ROOTNAMESPACE": "Główna przestrzeń nazw projektu programu Visual Studio.",
	"assets/variables.json.VS_GLOBAL_variable": "Zmienna globalna specyficzna dla projektu programu Visual Studio.",
	"assets/variables.json.VS_IOT_EXTENSIONS_VERSION": "Wersja rozszerzeń systemu Windows 10 IoT w programie Visual Studio",
	"assets/variables.json.VS_IOT_STARTUP_TASK": "Ciągłe zadanie w tle systemu Windows 10 IoT w programie Visual Studio",
	"assets/variables.json.VS_JUST_MY_CODE_DEBUGGING": "Włącz opcję Tylko mój kod przy użyciu debugera programu Visual Studio.",
	"assets/variables.json.VS_KEYWORD": "Usunięto. To, po określeniu słowa kluczowego projektu programu Visual Studio dla generatora programu Visual Studio 9 2008 i starszych wersji, ale wszystkie te generatory zostały usunięte.",
	"assets/variables.json.VS_MOBILE_EXTENSIONS_VERSION": "Wersja rozszerzeń systemu Windows 10 Mobile w programie Visual Studio",
	"assets/variables.json.VS_NO_COMPILE_BATCHING": "Wyłącz przetwarzanie wsadowe kompilacji dla obiektu docelowego. Zazwyczaj program MSBuild wywołuje kompilator z wieloma plikami c/cpp, a kompilator uruchamia podprocesy dla każdego pliku, aby utworzyć kompilację równoległą. Jeśli chcesz, aby kompilator był wywoływany z jednym plikiem naraz ustawionym VS_NO_COMPILE_BATCHING na WARTOŚĆ ON. Jeśli ta flaga jest ustawiona, program MSBuild wywoła kompilator z jednym plikiem c/cpp naraz. Przydatne, gdy chcesz użyć narzędzia zastępującego kompilator, na przykład narzędzia do buforowania kompilacji.",
	"assets/variables.json.VS_NO_SOLUTION_DEPLOY": "Określ, że obiekt docelowy nie powinien być oznaczony do wdrożenia na urządzeniu z systemem Windows CE lub Windows Phone w wygenerowanym rozwiązaniu programu Visual Studio.",
	"assets/variables.json.VS_PACKAGE_REFERENCES": "Odwołania do pakietu programu Visual Studio dla programu nuget.",
	"assets/variables.json.VS_PLATFORM_TOOLSET": "Zastępuje zestaw narzędzi platformy użyty do skompilowania elementu docelowego.",
	"assets/variables.json.VS_PROJECT_IMPORT": "Importy projektów zarządzanych przez program Visual Studio",
	"assets/variables.json.VS_SCC_AUXPATH": "Ścieżka pomocnicza kontroli kodu źródłowego programu Visual Studio.",
	"assets/variables.json.VS_SCC_LOCALPATH": "Ścieżka lokalna kontroli kodu źródłowego programu Visual Studio.",
	"assets/variables.json.VS_SCC_PROJECTNAME": "Projekt kontroli kodu źródłowego programu Visual Studio.",
	"assets/variables.json.VS_SCC_PROVIDER": "Dostawca kontroli kodu źródłowego programu Visual Studio.",
	"assets/variables.json.VS_SDK_REFERENCES": "Odwołania do zestawu SDK projektu programu Visual Studio. Określ rozdzieloną średnikami listę odwołań do zestawu SDK, która zostanie dodana do wygenerowanego projektu programu Visual Studio, np. Microsoft.AdMediatorWindows81, Version=1.0.",
	"assets/variables.json.VS_SOLUTION_DEPLOY": "Określ, że obiekt docelowy powinien być oznaczony do wdrożenia, gdy nie jest przeznaczony dla systemu Windows CE, Windows Phone lub aplikacji ze Sklepu Windows.",
	"assets/variables.json.VS_SOURCE_SETTINGS_tool": "Określ dowolne metadane elementu dla wszystkich nieskompilowanych plików, które używają elementu <tool>.",
	"assets/variables.json.VS_USER_PROPS": "Ustawia dołączanie pliku właściwości użytkownika w pliku projektu programu Visual Studio C++. Standardowa ścieżka to $(katalog_główny_użytkownika)\\\\Microsoft.Cpp.$(platforma).user.props. W większości przypadków ścieżka to %LOCALAPPDATA%\\\\Microsoft\\\\MSBuild\\\\v4.0\\\\Microsoft.Cpp.Win32.user.props lub %LOCALAPPDATA%\\\\Microsoft\\\\MSBuild\\\\v4.0\\\\Microsoft.Cpp.x64.user.props.",
	"assets/variables.json.VS_USE_DEBUG_LIBRARIES": "Wskaż generatorom programu Visual Studio, które konfiguracje są uznawane za konfiguracje debugowania. Steruje to ustawieniem UseDebugLibraries w każdej konfiguracji pliku .vcxproj.",
	"assets/variables.json.VS_WINDOWS_TARGET_PLATFORM_MIN_VERSION": "Minimalna wersja platformy docelowej systemu Windows w programie Visual Studio",
	"assets/variables.json.VS_WINRT_COMPONENT": "Oznacz element docelowy jako składnik środowiska wykonawczego systemu Windows dla generatora programu Visual Studio. Skompiluj element docelowy za pomocą rozszerzeń języka C++/CX dla środowiska wykonawczego systemu Windows. W przypadku bibliotek SHARED i MODULE powoduje to również zdefiniowanie makra preprocesora _WINRT_DLL.",
	"assets/variables.json.VS_WINRT_EXTENSIONS": "Przestarzałe. Zamiast tego użyj właściwości VS_WINRT_COMPONENT. Przestarzała właściwość była eksperymentalną implementacją właściwości VS_WINRT_COMPONENT.",
	"assets/variables.json.VS_WINRT_REFERENCES": "Odwołania do metadanych środowiska uruchomieniowego systemu Windows projektu programu Visual Studio",
	"assets/variables.json.WATCOM_RUNTIME_LIBRARY": "Wybierz bibliotekę środowiska uruchomieniowego Watcom do użycia przez kompilatory przeznaczone dla usługi ABI Watcom.",
	"assets/variables.json.WIN32_EXECUTABLE": "Kompiluj plik wykonywalny z punktu wejścia WinMain w systemie Windows.",
	"assets/variables.json.WINDOWS_EXPORT_ALL_SYMBOLS": "Ta właściwość jest zaimplementowana tylko dla zgodnych narzędzi firmy Microsoft w systemie Windows.",
	"assets/variables.json.XCODE_ATTRIBUTE_an-attribute": "Ustaw bezpośrednio docelowe atrybuty środowiska Xcode.",
	"assets/variables.json.XCODE_EMBED_FRAMEWORKS_CODE_SIGN_ON_COPY": "Poinformuj generator Xcode, aby wykonał podpisywanie kodu dla wszystkich struktur i bibliotek osadzonych przy użyciu właściwości XCODE_EMBED_FRAMEWORKS <XCODE_EMBED_<type>> .",
	"assets/variables.json.XCODE_EMBED_FRAMEWORKS_REMOVE_HEADERS_ON_COPY": "Poinformuj generator Xcode, aby usunął nagłówki ze wszystkich struktur osadzonych przy użyciu właściwości XCODE_EMBED_FRAMEWORKS <XCODE_EMBED_<type>> .",
	"assets/variables.json.XCODE_EMBED_type": "Poinformuj generatora Xcode, aby osadzał określoną listę elementów w pakiecie docelowym. Element <type> określa fazę kompilowania osadzania, która ma zostać użyta. Zapoznaj się z dokumentacją Xcode, aby uzyskać informacje o lokalizacji podstawowej każdego elementu <type>.",
	"assets/variables.json.XCODE_EMBED_type_CODE_SIGN_ON_COPY": "Właściwość logiczna używana tylko przez generator Xcode. Określa, czy wykonywać podpisywanie kodów w przypadku elementów osadzonych przy użyciu właściwości XCODE_EMBED_.",
	"assets/variables.json.XCODE_EMBED_type_PATH": "Ta właściwość jest używana tylko przez generator Xcode. Po jej zdefiniowaniu określa ścieżkę względną, która będzie używana podczas osadzania elementów określonych przez właściwość XCODE_EMBED_. Ścieżka jest określana względem lokalizacji podstawowej fazy kompilowania elementu Embed XXX skojarzonej z elementem <type>. Zapoznaj się z dokumentacją Xcode, aby uzyskać informacje o lokalizacji podstawowej każdego elementu <type>.",
	"assets/variables.json.XCODE_EMBED_type_REMOVE_HEADERS_ON_COPY": "Właściwość logiczna używana tylko przez generator Xcode. Określa, czy usuwać nagłówki ze wszystkich osadzonych struktur przy użyciu właściwości XCODE_EMBED_.",
	"assets/variables.json.XCODE_GENERATE_SCHEME": "Jeśli jest włączona, generator Xcode wygeneruje pliki schematów. Są one przydatne do wywoływania akcji analyze, archive, build-for-testing i test z poziomu wiersza polecenia.",
	"assets/variables.json.XCODE_LINK_BUILD_PHASE_MODE": "W przypadku korzystania z generatora Xcode biblioteki, które mają być dołączone, zostaną określone w pliku projektu Xcode przy użyciu fazy kompilacji „Połącz plik binarny z bibliotekami\" lub bezpośrednio jako flagi konsolidatora. Pierwsza możliwość zezwala programowi Xcode na zarządzanie ścieżkami kompilacji, które mogą być niezbędne podczas tworzenia archiwów Xcode, ponieważ mogą one używać innych ścieżek kompilacji niż w przypadku zwykłego kompilowania.",
	"assets/variables.json.XCODE_PRODUCT_TYPE": "Ustaw atrybut productType środowiska Xcode w ramach jego odwołania na obiekt docelowy. Narzędzie CMake oblicza wartość domyślną opartą na typie docelowym, ale może ona zostać ustawiona jawnie za pomocą tej właściwości.",
	"assets/variables.json.XCODE_SCHEME_ADDRESS_SANITIZER": "Określa, czy włączyć moduł czyszczący adres w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.XCODE_SCHEME_ADDRESS_SANITIZER_USE_AFTER_RETURN": "Określa, czy włączyć wykrywanie użycia stosu po powrocie w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.XCODE_SCHEME_ARGUMENTS": "Określ argumenty wiersza polecenia, które powinny zostać dodane do sekcji Arguments wygenerowanego schematu środowiska Xcode.",
	"assets/variables.json.XCODE_SCHEME_DEBUG_AS_ROOT": "Czy debugować element docelowy jako element główny.",
	"assets/variables.json.XCODE_SCHEME_DEBUG_DOCUMENT_VERSIONING": "Określa, czy włączyć opcję Zezwalaj na debugowaniew podczas używania przeglądarki wersji dokumentów w sekcji Opcje wygenerowanego schematu Xcode.",
	"assets/variables.json.XCODE_SCHEME_DISABLE_MAIN_THREAD_CHECKER": "Określa, czy wyłączyć narzędzie Main Thread Checker w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.XCODE_SCHEME_DYNAMIC_LIBRARY_LOADS": "Określa, czy włączyć dynamiczne ładowanie bibliotek w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.XCODE_SCHEME_DYNAMIC_LINKER_API_USAGE": "Określa, czy włączyć użycie interfejsu API konsolidatora dynamicznego w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.XCODE_SCHEME_ENABLE_GPU_API_VALIDATION": "Wartość właściwości Metal: walidacja interfejsu API w sekcji Opcje wygenerowanego schematu Xcode.",
	"assets/variables.json.XCODE_SCHEME_ENABLE_GPU_FRAME_CAPTURE_MODE": "Wartość właściwości przechwytywania ramek procesora GPU w sekcji Opcje wygenerowanego schematu Xcode. Przykładowe wartości to Metal i Wyłączone.",
	"assets/variables.json.XCODE_SCHEME_ENABLE_GPU_SHADER_VALIDATION": "Wartość właściwości Metal: sprawdzanie poprawności cieniowania pikseli w sekcji Opcje wygenerowanego schematu Xcode.",
	"assets/variables.json.XCODE_SCHEME_ENVIRONMENT": "Określ zmienne środowiskowe, które powinny zostać dodane do sekcji Arguments wygenerowanego schematu środowiska Xcode.",
	"assets/variables.json.XCODE_SCHEME_EXECUTABLE": "Określ ścieżkę do pliku wykonywalnego w sekcji Info wygenerowanego schematu środowiska Xcode. Jeśli nie zostanie to ustawione, generator schematów wybierze bieżący obiekt docelowy, gdy jest to faktycznie plik wykonywalny.",
	"assets/variables.json.XCODE_SCHEME_GUARD_MALLOC": "Określa, czy włączyć strażnika funkcji malloc w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.XCODE_SCHEME_LAUNCH_CONFIGURATION": "Ustaw konfigurację kompilacji, aby uruchomić element docelowy.",
	"assets/variables.json.XCODE_SCHEME_LAUNCH_MODE": "Wartość właściwości Launch w sekcji Informacje wygenerowanego schematu Xcode.",
	"assets/variables.json.XCODE_SCHEME_MAIN_THREAD_CHECKER_STOP": "Określa, czy włączyć opcję Pause on issues (Wstrzymanie w razie wystąpienia problemów) dla narzędzia Main Thread Checker w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.XCODE_SCHEME_MALLOC_GUARD_EDGES": "Określa, czy włączyć strażnika alokacji funkcji malloc w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.XCODE_SCHEME_MALLOC_SCRIBBLE": "Określa, czy włączyć nadpisywanie dla funkcji malloc w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.XCODE_SCHEME_MALLOC_STACK": "Określa, czy włączyć śledzenie stosu dla funkcji malloc w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.XCODE_SCHEME_THREAD_SANITIZER": "Określa, czy włączyć moduł czyszczący wątku w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.XCODE_SCHEME_THREAD_SANITIZER_STOP": "Określa, czy włączyć wstrzymanie modułu czyszczącego wątku w przypadku wystąpienia problemów w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.XCODE_SCHEME_UNDEFINED_BEHAVIOUR_SANITIZER": "Określa, czy włączyć moduł czyszczący niezdefiniowanego zachowania w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.XCODE_SCHEME_UNDEFINED_BEHAVIOUR_SANITIZER_STOP": "Określa, czy włączyć opcję wstrzymania modułu czyszczącego niezdefiniowanego zachowania w przypadku wystąpienia problemów w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.XCODE_SCHEME_WORKING_DIRECTORY": "Określ katalog roboczy akcji Przebieg i Profil w wygenerowanym schemacie Xcode. W przypadku, gdy wartość zawiera wyrażenia generatora, zostaną one obliczone.",
	"assets/variables.json.XCODE_SCHEME_ZOMBIE_OBJECTS": "Określa, czy włączyć obiekty zombie w sekcji Diagnostics wygenerowanego schematu Xcode.",
	"assets/variables.json.XCODE_XCCONFIG": "Jeśli zostanie to ustawione, generator Xcode zarejestruje określony plik jako plik XCConfig na poziomie docelowym. W przypadku globalnych plików XCConfig zobacz zmienną CMAKE_XCODE_XCCONFIG.",
	"assets/variables.json.XCTEST": "Ten obiekt docelowy to obiekt XCTest CFBundle na komputerze Mac."
}