/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"assets/commands.json.add_compile_definitions": "Permet d'ajouter des définitions de préprocesseur à la compilation des fichiers sources.",
	"assets/commands.json.add_compile_options": "Permet d'ajouter des options à la compilation des fichiers sources.",
	"assets/commands.json.add_custom_command": "Ajoutez une règle de génération personnalisée au système de build généré.",
	"assets/commands.json.add_custom_target": "Ajoutez une cible sans sortie pour qu'elle soit toujours générée.",
	"assets/commands.json.add_definitions": "Permet d'ajouter des indicateurs de définition -D à la compilation des fichiers sources.",
	"assets/commands.json.add_dependencies": "Ajoutez une dépendance entre des cibles de niveau supérieur.",
	"assets/commands.json.add_executable": "Ajoutez un exécutable au projet à l'aide des fichiers sources spécifiés.",
	"assets/commands.json.add_library": "Ajoutez une bibliothèque au projet à l'aide des fichiers sources spécifiés.",
	"assets/commands.json.add_link_options": "Permet d'ajouter des options à l'étape d'édition des liens pour les cibles d'exécutables, de bibliothèques partagées ou de bibliothèques de modules dans le répertoire actif et les répertoires inférieurs qui sont ajoutés après l'appel de cette commande.",
	"assets/commands.json.add_subdirectory": "Ajoutez un sous-répertoire à la build.",
	"assets/commands.json.add_test": "Ajoutez un test au projet à exécuter par ctest.",
	"assets/commands.json.aux_source_directory": "Trouvez tous les fichiers sources d'un répertoire.",
	"assets/commands.json.block": "Évaluez un groupe de commandes avec une variable dédiée et/ou une portée de stratégie.",
	"assets/commands.json.break": "Arrêt d'une boucle foreach ou while englobante.",
	"assets/commands.json.build_command": "Obtenez une ligne de commande pour générer le projet actif. Ceci est principalement destiné à un usage interne par le module CTest.",
	"assets/commands.json.build_name": "Utilisation non autorisée depuis la version 3.0. Consultez la stratégie CMake CMP0036.",
	"assets/commands.json.cmake_file_api": "Active l’interaction avec l’API de fichier CMake <cmake-file-api(7)>.",
	"assets/commands.json.cmake_host_system_information": "Interrogez diverses informations sur le système hôte.",
	"assets/commands.json.cmake_language": "Appelle des méta-opérations sur les commandes CMake.",
	"assets/commands.json.cmake_minimum_required": "Nécessite une version minimale de cmake.",
	"assets/commands.json.cmake_parse_arguments": "Analyse les arguments de fonction ou de macro.",
	"assets/commands.json.cmake_path": "Cette commande sert à la manipulation des chemins. Seuls les aspects syntaxiques des chemins sont traités, il n'existe aucune sorte d'interaction avec un système de fichiers sous-jacent. Le chemin peut représenter un chemin inexistant ou même un chemin qui n'est pas autorisé à exister sur le système de fichiers ou la plateforme actuelle. Pour les opérations qui interagissent de manière effective avec le système de fichiers, consultez les informations relatives à la commande file.",
	"assets/commands.json.cmake_policy": "Gérez les paramètres de stratégie CMake. Pour plus d'informations sur les stratégies définies, consultez le manuel des stratégies cmake.",
	"assets/commands.json.configure_file": "Copiez un fichier à un autre emplacement et modifiez son contenu.",
	"assets/commands.json.continue": "Continuez jusqu'au niveau supérieur de la boucle foreach ou while.",
	"assets/commands.json.create_test_sourcelist": "Créez un programme de pilote de test qui lie de nombreux petits tests à un seul exécutable. Cela est utile lors de la génération d’exécutables statiques avec de grandes bibliothèques pour réduire la taille totale requise.",
	"assets/commands.json.ctest_build": "Effectuez l'étape de build CTest en tant que client de tableau de bord.",
	"assets/commands.json.ctest_configure": "Effectuez l'étape de configuration CTest en tant que client de tableau de bord.",
	"assets/commands.json.ctest_coverage": "Effectuez l'étape de couverture CTest en tant que client de tableau de bord.",
	"assets/commands.json.ctest_empty_binary_directory": "vide le répertoire binaire",
	"assets/commands.json.ctest_memcheck": "Effectuez l'étape de vérification de mémoire CTest en tant que client de tableau de bord.",
	"assets/commands.json.ctest_read_custom_files": "Lisez les fichiers CTestCustom.",
	"assets/commands.json.ctest_run_script": "Exécute un script ctest -S",
	"assets/commands.json.ctest_sleep": "Se met en veille pendant un certain temps",
	"assets/commands.json.ctest_start": "Démarre le test d'un modèle donné",
	"assets/commands.json.ctest_submit": "Effectuez l'étape d'envoi CTest en tant que client de tableau de bord.",
	"assets/commands.json.ctest_test": "Effectuez l'étape de test CTest en tant que client de tableau de bord.",
	"assets/commands.json.ctest_update": "Effectuez l'étape de mise jour CTest en tant que client de tableau de bord.",
	"assets/commands.json.ctest_upload": "Chargez les fichiers sur un serveur de tableau de bord en tant que client de tableau de bord.",
	"assets/commands.json.define_property": "Définissez et documentez les propriétés personnalisées.",
	"assets/commands.json.else": "Démarre la partie else d'un bloc if.",
	"assets/commands.json.elseif": "Démarre une partie elseif d'un bloc if.",
	"assets/commands.json.enable_language": "Activer les langages (CXX/C/OBJC/OBJCXX/Fortran/etc.)",
	"assets/commands.json.enable_testing": "Activez les tests pour le répertoire actif et ses niveaux inférieurs.",
	"assets/commands.json.endblock": "Termine une liste de commandes dans un bloc et supprime les étendues créées par la commande de bloc.",
	"assets/commands.json.endforeach": "Met fin à une liste de commandes dans un bloc foreach.",
	"assets/commands.json.endfunction": "Met fin à une liste de commandes dans un bloc function.",
	"assets/commands.json.endif": "Met fin à une liste de commandes dans un bloc if.",
	"assets/commands.json.endmacro": "Met fin à une liste de commandes dans un bloc macro.",
	"assets/commands.json.endwhile": "Met fin à une liste de commandes dans un bloc while.",
	"assets/commands.json.execute_process": "Exécutez un ou plusieurs processus enfants.",
	"assets/commands.json.exec_program": "Exécutez un programme exécutable durant le traitement du fichier CMakeList.txt.",
	"assets/commands.json.export": "Exportez des cibles ou des packages pour les projets externes afin de les utiliser directement à partir de l’arborescence de build du projet actif, sans installation.",
	"assets/commands.json.export_library_dependencies": "Utilisation non autorisée depuis la version 3.0. Consultez la stratégie CMake CMP0033.",
	"assets/commands.json.file": "Commande de manipulation de fichier.",
	"assets/commands.json.find_file": "Cette commande est utilisée pour rechercher le chemin complet du fichier nommé.",
	"assets/commands.json.find_library": "Cette commande est utilisée pour rechercher une bibliothèque.",
	"assets/commands.json.find_package": "Recherchez un package (généralement fourni par un élément externe au projet), puis chargez ses détails spécifiques au package. Les appels à cette commande peuvent également être interceptés par des fournisseurs de dépendances.",
	"assets/commands.json.find_path": "Cette commande est utilisée pour rechercher un répertoire contenant le fichier nommé.",
	"assets/commands.json.find_program": "Cette commande est utilisée pour rechercher un programme.",
	"assets/commands.json.fltk_wrap_ui": "Créez des wrappers d'interfaces utilisateur FLTK.",
	"assets/commands.json.foreach": "Évaluez un groupe de commandes pour chaque valeur d'une liste.",
	"assets/commands.json.function": "Permet de démarrer l'enregistrement d'une fonction pour appeler celle-ci plus tard en tant que commande.",
	"assets/commands.json.get_cmake_property": "Obtenez une propriété globale de l'instance de CMake.",
	"assets/commands.json.get_directory_property": "Obtenez une propriété de l'étendue DIRECTORY.",
	"assets/commands.json.get_filename_component": "Obtenez un composant spécifique d'un nom de fichier complet.",
	"assets/commands.json.get_property": "Obtenez une propriété.",
	"assets/commands.json.get_source_file_property": "Obtenez une propriété d'un fichier source.",
	"assets/commands.json.get_target_property": "Obtenez une propriété d'une cible.",
	"assets/commands.json.get_test_property": "Obtenez une propriété du test.",
	"assets/commands.json.if": "Exécutez un groupe de commandes de façon conditionnelle.",
	"assets/commands.json.include": "Chargez et exécutez du code CMake à partir d'un fichier ou d'un module.",
	"assets/commands.json.include_directories": "Ajoutez des répertoires Include à la build.",
	"assets/commands.json.include_external_msproject": "Incluez un fichier projet Microsoft externe dans un espace de travail.",
	"assets/commands.json.include_guard": "Fournit une protection include pour le fichier traité par CMake.",
	"assets/commands.json.include_regular_expression": "Définissez l’expression régulière utilisée pour la vérification des dépendances.",
	"assets/commands.json.install": "Spécifiez les règles à exécuter au moment de l'installation.",
	"assets/commands.json.install_files": "Cette commande a été remplacée par la commande install. Elle est fournie pour des raisons de compatibilité avec le code CMake plus ancien. La forme FILES est directement remplacée par la forme FILES de la commande install. La forme regexp peut être exprimée plus clairement à l'aide de la forme GLOB de la commande file.",
	"assets/commands.json.install_programs": "Cette commande a été remplacée par la commande install. Elle est fournie pour des raisons de compatibilité avec le code CMake plus ancien. La forme FILES est directement remplacée par la forme PROGRAMS de la commande install. La forme regexp peut être exprimée plus clairement à l'aide de la forme GLOB de la commande file.",
	"assets/commands.json.install_targets": "Cette commande a été remplacée par la commande install. Elle est fournie pour des raisons de compatibilité avec le code CMake plus ancien.",
	"assets/commands.json.link_directories": "Ajoutez des répertoires dans lesquels l’éditeur de liens recherchera des bibliothèques.",
	"assets/commands.json.link_libraries": "Lier les bibliothèques à toutes les cibles ajoutées plus tard.",
	"assets/commands.json.list": "Opérations sur les listes séparées par des points-virgules.",
	"assets/commands.json.load_cache": "Chargez les valeurs du cache CMake d'un autre projet.",
	"assets/commands.json.load_command": "Utilisation non autorisée depuis la version 3.0. Consultez la stratégie CMake CMP0031.",
	"assets/commands.json.macro": "Permet de démarrer l'enregistrement d'une macro pour appeler celle-ci plus tard en tant que commande",
	"assets/commands.json.make_directory": "Crée le répertoire spécifié. Les chemins complets doivent être indiqués. Les répertoires parents qui n'existent pas sont également créés. À utiliser avec précaution.",
	"assets/commands.json.mark_as_advanced": "Marquez les variables en cache cmake comme étant avancées.",
	"assets/commands.json.math": "Permet d'évaluer une expression mathématique.",
	"assets/commands.json.message": "Journalisez un message.",
	"assets/commands.json.option": "Permet de fournir une option booléenne que l'utilisateur peut éventuellement sélectionner.",
	"assets/commands.json.output_required_files": "Utilisation non autorisée depuis la version 3.0. Consultez la stratégie CMake CMP0032.",
	"assets/commands.json.project": "Permet de définir le nom du projet.",
	"assets/commands.json.qt_wrap_cpp": "Permet de créer manuellement des wrappers Qt.",
	"assets/commands.json.qt_wrap_ui": "Permet de créer manuellement des wrappers d'interfaces utilisateur Qt.",
	"assets/commands.json.remove": "Supprime VALUE de la variable VAR. Permet généralement de supprimer les entrées d'un vecteur (par exemple une liste de valeurs séparées par des points-virgules). VALUE est développé.",
	"assets/commands.json.remove_definitions": "Permet de supprimer les indicateurs de définition -D ajoutés par add_definitions.",
	"assets/commands.json.return": "Effectue un retour à partir d'un fichier, d'un répertoire ou d'une fonction.",
	"assets/commands.json.separate_arguments": "Permet d'analyser les arguments de ligne de commande dans une liste de valeurs séparées par des points-virgules.",
	"assets/commands.json.set": "Affectez une valeur donnée à une variable normale, de cache ou d'environnement. Consultez la documentation relative aux variables du langage cmake (7) pour connaître les étendues et l'interaction des variables normales et des entrées de cache.",
	"assets/commands.json.set_directory_properties": "Permet de définir les propriétés du répertoire actif et de ses sous-répertoires.",
	"assets/commands.json.set_property": "Définissez une propriété nommée dans une étendue donnée.",
	"assets/commands.json.set_source_files_properties": "Les fichiers sources peuvent avoir des propriétés qui affectent leur mode de génération.",
	"assets/commands.json.set_target_properties": "Les cibles peuvent avoir des propriétés qui affectent leur mode de génération.",
	"assets/commands.json.set_tests_properties": "Définissez une propriété des tests.",
	"assets/commands.json.site_name": "Affectez le nom de l'ordinateur à la variable donnée.",
	"assets/commands.json.source_group": "Définissez un regroupement pour les fichiers sources dans la génération de projet de l'IDE. Il existe deux signatures différentes pour créer des groupes sources.",
	"assets/commands.json.string": "Opérations sur les chaînes.",
	"assets/commands.json.subdirs": "Permet d'ajouter une liste de sous-répertoires à la build.",
	"assets/commands.json.subdir_depends": "Utilisation non autorisée depuis la version 3.0. Consultez la stratégie CMake CMP0029.",
	"assets/commands.json.target_compile_definitions": "Ajoutez des définitions de compilation à une cible.",
	"assets/commands.json.target_compile_features": "Ajoutez les fonctionnalités de compilateur attendues à une cible.",
	"assets/commands.json.target_compile_options": "Ajoutez des options de compilation à une cible.",
	"assets/commands.json.target_include_directories": "Ajoutez des répertoires include à une cible.",
	"assets/commands.json.target_link_directories": "Ajoutez des répertoires d'édition des liens à une cible.",
	"assets/commands.json.target_link_libraries": "Spécifiez les bibliothèques ou indicateurs à utiliser durant l'édition des liens d'une cible donnée et/ou de ses dépendants. Les exigences d'utilisation des cibles de bibliothèques ayant fait l'objet d'une édition des liens vont être propagées. Les exigences d'utilisation des dépendances d'une cible affectent la compilation de ses propres sources.",
	"assets/commands.json.target_link_options": "Permet d'ajouter des options à l'étape d'édition des liens pour une cible d'exécutable, de bibliothèque partagée ou de bibliothèque de module.",
	"assets/commands.json.target_precompile_headers": "Permet d'ajouter une liste de fichiers d'en-tête à précompiler.",
	"assets/commands.json.target_sources": "Ajoutez des sources à une cible.",
	"assets/commands.json.try_compile": "Essayez de générer du code.",
	"assets/commands.json.try_run": "Essayez d'effectuer la compilation, puis d'exécuter du code.",
	"assets/commands.json.unset": "Annulez la définition d'une variable, d'une variable de cache ou d'une variable d'environnement.",
	"assets/commands.json.use_mangled_mesa": "Utilisation non autorisée depuis la version 3.0. Consultez la stratégie CMake CMP0030.",
	"assets/commands.json.utility_source": "Utilisation non autorisée depuis la version 3.0. Consultez la stratégie CMake CMP0034.",
	"assets/commands.json.variable_requires": "Utilisation non autorisée depuis la version 3.0. Consultez la stratégie CMake CMP0035.",
	"assets/commands.json.variable_watch": "Observez les changements de la variable CMake.",
	"assets/commands.json.while": "Évaluez un groupe de commandes tant qu'une condition est vraie",
	"assets/commands.json.write_file": "Le premier argument est le nom du fichier, le reste des arguments correspond aux messages à écrire. Si l'argument APPEND est spécifié, le message est ajouté."
}