/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"validating.presets.file": "Lettura e convalida dei set di impostazioni \"file {0}\"",
	"unsupported.presets": "Sono stati rilevati set di impostazioni non supportati in {0}. Il supporto è limitato alle funzionalità definite dalla versione {1}.",
	"no.additional.properties": "NON deve avere proprietà aggiuntive",
	"unsupported.presets.disable": "Le proprietà e le macro sconosciute possono essere ignorate usando l'impostazione {0}.",
	"duplicate.build.preset.found": "Sono stati trovati duplicati all'interno della raccolta di set di impostazioni di compilazione: \"{0}\"",
	"duplicate.test.preset.found": "Sono stati trovati duplicati all'interno della raccolta dei set di impostazioni di test: \"{0}\"",
	"duplicate.package.preset.found": "Sono stati trovati duplicati all'interno della raccolta di set di impostazioni del pacchetto: \"{0}\"",
	"duplicate.workflow.preset.found": "Sono stati trovati duplicati all'interno della raccolta di set di impostazioni del flusso di lavoro: \"{0}\"",
	"workflow.does.not.start.configure.step": "Il set di impostazioni del flusso di lavoro \"{0}\" non inizia con un passaggio di configurazione.",
	"workflow.has.subsequent.configure.preset": "Il set di impostazioni del flusso di lavoro \"{0}\" ha un altro set di impostazioni di configurazione \"{1}\" oltre al primo passaggio \"{2}\": ",
	"successfully.validated.presets": "Convalida dei {0} sullo schema dei set di impostazioni completata",
	"included.presets.file.not.found": "Impossibile trovare il file dei set di impostazioni inclusi {0}",
	"expansion.errors": "Errori di espansione rilevati nel file dei set di impostazioni.",
	"reading.presets.file": "Lettura dei file dei set di impostazioni {0}",
	"failed.to.parse": "Non è stato possibile analizzare {0}: {1}",
	"expanding.presets.file": "Espansione del file dei set di impostazioni {0}",
	"successfully.expanded.presets.file": "Il file dei set di impostazioni è stato espanso {0}"
}